[
  {
    "kind": "t1",
    "id": "iilcoqr",
    "author": "EfficientSyllabus",
    "score": 1,
    "createdUtc": 1659407265,
    "body": "So last week Viktor Orban gave a controversial speech on \"race-mixing\" among other things. Here's the [complete official translation](https://miniszterelnok.hu/speech-by-prime-minister-viktor-orban-at-the-31st-balvanyos-summer-free-university-and-student-camp/), and [subtitled video](https://www.youtube.com/watch?v=QyNVFIo23Bg).\n\nSummaries by [Hungarian portal 444](https://insighthungary.444.hu/2022/07/28/orban-causes-outrage-for-opposing-mixed-race-society-in-hungary), [the Guardian](https://www.theguardian.com/world/2022/jul/24/viktor-orban-against-race-mixing-europe-hungary), [CNN](https://edition.cnn.com/2022/07/27/europe/viktor-orban-hungary-race-speech-intl/index.html).\n\n&gt; Migration has split Europe in two – or I could say that it has split the West in two. One half is a world where European and non-European peoples live together. These countries are no longer nations: they are nothing more than a conglomeration of peoples. I could also say that it is no longer the Western world, but the post-Western world. And around 2050, the laws of mathematics will lead to the final demographic shift: cities in this part of the continent – or that part – will see the proportion of residents of non-European origin rising to over 50 per cent of the total.\n\n&gt; In such a multi-ethnic context, there is an ideological feint here that is worth talking about and focusing on. The internationalist left employs a feint, an ideological ruse: the claim – their claim – that Europe by its very nature is populated by peoples of mixed race. This is a historical and semantic sleight of hand, because it conflates two different things. There is a world in which European peoples are mixed together with those arriving from outside Europe. Now that is a mixed-race world. And there is our world, where people from within Europe mix with one another, move around, work, and relocate. So, for example, in the Carpathian Basin we are not mixed-race: we are simply a mixture of peoples living in our own European homeland. And, given a favourable alignment of stars and a following wind, these peoples merge together in a kind of Hungaro-Pannonian sauce, creating their own new European culture. This is why we have always fought: we are willing to mix with one another, but we do not want to become peoples of mixed-race. [...] The time will come when we have to somehow accept Christians coming to us from there and integrate them into our lives. This has happened before; and those whom we do not want to let in will have to be stopped at our western borders – Schengen or no Schengen.\n\nOne advisor of his, the sociologist Zsuzsa Hegedüs (who is Jewish herself) has stepped down after the speech and called it \"pure Nazi text worthy of Goebbels\", due to such explicit references to \"race\" (\"faj\" in Hungarian).\n\nShortly after the speech people realized that it is almost verbatim from a 1973 book. In fact Orbán mentions the book just a bit before the above section:\n\n&gt; There is an outstanding 1973 book on this issue which was written in French, and recently published in Hungary. It is called “[The Camp of the Saints](https://en.wikipedia.org/wiki/The_Camp_of_the_Saints)” [Le Camp des Saints], and I recommend it to anyone who wants to understand the spiritual developments underlying the West’s inability to defend itself.\n\nThe NYT wrote [an article](https://www.nytimes.com/2019/11/22/books/stephen-miller-camp-saints.html) on it in 2019: \"A Racist Book’s Malign and Lingering Influence - “The Camp of the Saints,” published in 1973, has been a must-read within white supremacist circles for decades. Stephen Miller, Marine Le Pen and Steve King have touted it in recent years.\"\n\nMost of the above quoted speech section is from the intro of the book, including exact phrases like \"historical and semantic sleight of hand\". Orbán('s speech writers) basically just swapped the \"Gallo-Roman sauce\" of the original French book with \"Hungaro-Pannonian sauce\".\n\nCommon directions of criticism were 1) that Hungarians are also mixed, no population is racially pure, 2) Hungarians came from Asia, 3) it's biologically inaccurate to talk about \"faj\" (=\"race\", \"species\") regarding humans.\n\nInterestingly, or not, back in 2012, Orbán also called Hungarians \"half-Asian\" ([HU source](https://24.hu/belfold/2012/07/26/orban-veszekedos-felazsiai-nep-a-magyar/)):\n\n&gt; \"My philosophy is that unity is a question of strength: if there is strength, there is unity,\" he said. There are other ways of forging unity - for example, in the Scandinavian countries - but he believes that the Hungarians are incapable of doing so. \"That's the only way it works with half-Asian derivatives like us. Here everyone is clever, everyone knows better, everyone has a better idea,\" he said.\n\n[Turanism](https://en.wikipedia.org/wiki/Turanism) and emphasizing cultural or other relations to Turkic peoples have been common over the last ~150 years on the conservative right wing in Hungary. So how does this add up? Not so well, because the text was essentially taken out of a French nationalist context, and it doesn't fit so well. The actual far-righters in Hungary, like the Our Homeland Movement have been talking about a \"Northern Civilization\" (\"from the Celts all the way to the Japanese\") instead of Western for some time now, exactly for this reason, and I guess as a way to get closer to the Russian far-right vision of Dugin's Eurasianism.\n\nSo saying that Hungarians came from Asia misses the point (well, it's arguable anyway in a modern genetic sense, and even if so, the origin was near the Urals, the border of Europe). Orbán and the far right's problem is with Africans and Middle Eastern Muslims.\n\nHe has since stated that his speech may have been misunderstandable, and he actually just meant cultural differences, not biological. But the word \"race\" was unusually blunt even for Orbán. He usually talks in terms of religion (Christianity vs Islam) or cultures and civilizations, not races. In fact, the Hungarian word he used (\"faj\") is now quite taboo in this sense, today it's only used in the meaning of \"species\" (of animals or plants). Another common criticism came from this angle: that humanity is one species, *Homo sapiens*. This is a very shallow criticism but apparently many felt that it's some kind of gotcha, that Orbán doesn't even know basic biology and doesn't understand the concept of \"species\". Except that \"faj\" used to be a much broader term, for stuff like ethnicity, nationality, race, species etc.\n\nZooming out a bit, it's clear that Orbán loves the kind of attention that these speeches give him. It's like antifragility, he thrives on being demonized and gets stronger each time when he survives these. So, since there was a possibility of difficulties at home (due to economic problems, they can't keep to their election promises just a few months after their re-election), he decided to cause some controversy so he can again frame things in this way, that all conflict with the EU ultimately stems from the issues of migration, gender, Soros etc. That's his home turf, that's the lens he wants on everything.\n\nOn Thursday, Orbán [will speak at CPAC Texas in Dallas](https://www.newsweek.com/von-der-leyen-rips-orban-over-mixed-race-speech-cpac-still-welcoming-him-1729399), to the outrage of American media.\n\nSo, 1) Most of this wasn't even Orbán's own ideas but took it verbatim from a book, 2) The reaction to it was lazy criticism, the nth iteration of calling Orbán a fascist or feigning ignorance about meanings of words or performatively not understanding that by other races Orbán meant Africans and Middle Easterners, not Uralic Asians. 3) Orbán needed nothing other than exactly that, to be criticized for his stance on migration and gender instead of utility price hikes and tax raises.\n\nSo is he a racist? It doesn't matter because this is post-politics. People perform to get reactions, it's not about beliefs. A prominent journalist from Orbán's circles, Zsolt Bayer (shown [here](https://nepszava.hu/3162052_nemeth-szilard-bayer-zsolt-alsoors-rasszizmus-polo-fenykep) with a Secretary of State) wore a \"white lives matter\" T-shirt just a few weeks ago. It's hard to tell what one should interpret as sincere opinions (if that's even possible for a politician to have) versus pure posturing. But it's mostly just two sides symbiotically needing each other to justify themselves.",
    "permalink": "/r/TheMotte/comments/wda188/culture_war_roundup_for_the_week_of_august_01_2022/iilcoqr/"
  },
  {
    "kind": "t1",
    "id": "iikpd25",
    "author": "dblackdrake",
    "score": 1,
    "createdUtc": 1659396805,
    "body": "UKRAIN WATCH TIME: \n\n2 weeks a go I registered some predictions that I thought were pretty optimistic in Ukraine's favor; turns out I was too pessimistic. \n\nRussia is hauling out the museum piece 152's from the 1920's for second line units; the tempo of their advance and quantity/quality of artillery fire has dropped off way quicker (Like, an order of magnitude quicker) than I thought it would.\n\nApparently, the HIMARS shoot and scoot has been working. Ukraine can't push Russia where they are strong; but Russia can't advance along an entire front anymore without taking unsafe risks.\n\nThis on top of Ukrainian counteroffensives in Kherson; and (maybe? Questionably?) drama amongst the Russians staff running the war (apparently the two top guys hate each other, and refuse to allow one to be elevated over the other.  Water cooler shit though, so who knows.)\n\nBasically: I predicted slow Russian advance for some time until their logistical problems caught up to them and they couldn't just atomize their problems with a zillion guns, then a frozen front until some political solution was reached or Russia got their economy in gear; which was wrong.",
    "permalink": "/r/TheMotte/comments/wda188/culture_war_roundup_for_the_week_of_august_01_2022/iikpd25/"
  },
  {
    "kind": "t1",
    "id": "iijr0wh",
    "author": "Pongalh",
    "score": 1,
    "createdUtc": 1659383025,
    "body": "I spoke with a researcher who will go by \"Alex Datepsych.\" out of Spain, on dating, inceldom and related topics for those who may be interested. [Part 1](https://youtu.be/frw7mi-reRA). [Part 2](https://youtu.be/JcDBxBaEPEQ).\n\n&amp;#x200B;\n\nPer the details on my YouTube page, in Part 1 we touch on the deracinated dating pov of the isolated, profilicity (ala philosopher Hans-Georg Moeller), AWALT (\"All Women Are Like That\"), MGTOW, the all-that-matters-are-looks blackpilled MRAs, and hilarious old school pickup artist \"Mystery.\"\n\n&amp;#x200B;\n\nIn Part 2 we discuss the racial composition of incels; \"Just Be White\"; the relationship between income, job type and infidelity; and the impact of remote work and pandemic on singles vs. marrieds.\n\n&amp;#x200B;\n\n[Here is Alex's website](https://datepsychology.com/).",
    "permalink": "/r/TheMotte/comments/wda188/culture_war_roundup_for_the_week_of_august_01_2022/iijr0wh/"
  },
  {
    "kind": "t1",
    "id": "iijankv",
    "author": "PutAHelmetOn",
    "score": 1,
    "createdUtc": 1659376660,
    "body": "Is gender identity like a [fursona](https://en.wikipedia.org/wiki/Fursona)? The comparison isn't motivated by \"haha look at how ridiculous these people are,\" it's specifically around reframing the following:\n\n&gt;Everyone has a gender identity, but most people are [cis by default](https://thingofthings.wordpress.com/2015/01/28/cis-by-default/)\n\nTo something more like:\n\n&gt;The genderqueer community is comprised of people who have gender identities, which may involve wearing clothing of their preferred gender... A small minority of them express a desire to become, or already see themselves as, their gender\n\nSince I've just committed analogy in the first degree, I expect the low-decouplers to be out in full force, so here are a few objections I foresee:\n\nPossible counter: \"Well, most people don't have a fursona but most people do have a gender identity\". Reply: I think both parts (before &amp; after the 'but') are potentially wrong:\n\n* Don't most people have a \"human by default\" fursona?\n* Do most people *actually* have a gender identity?\n\nTo expand on (2): the language around gender identity is maximally confusing. \n\nAs an example, I posed the question \"do you have a gender identity? what is it?\" to my dad and he said \"of course I'm a male.\" despite not knowing what LGBTQ activists really think about gender identity. If two people say \"my gender identity is man\" that **does not mean they are really saying the same thing.** A less confusing language would be to call gender identity a \"fnord\" and then my dad would realize that he has no idea what a \"fnord\" is, just that it is something controversial.\n\nPossible counter: \"this is not how people use the words 'fursona' and 'gender identity'\" to which I reply: this is missing the point. I am engaging in prescriptivism here, and I'm claiming that speaking as if normal people have gender identity \\[the way activists mean it\\] is misleading. That activists enthusiastically say it's OK that gender identity means different things to different people makes me think this confusing language is intentional.\n\nHow should I react to a furry telling me my fursona was a human? I would probably tell him I'm not a furry, sorry, not for me, but good for you. Should my reaction to activists asking me about my gender identity be any different? \"Sorry, not for me.\"",
    "permalink": "/r/TheMotte/comments/wda188/culture_war_roundup_for_the_week_of_august_01_2022/iijankv/"
  },
  {
    "kind": "t1",
    "id": "iii5pwd",
    "author": "TheCoachSpo",
    "score": 1,
    "createdUtc": 1659360001,
    "body": "The TPUSA conference tipped its hand about the cultural direction the American Right might be moving in. Tons of interviews, speeches, etc from prominent conservatives suggesting that it would be best for America to embrace Christian Nationalism. This raised some alarms; there is strong research connecting Evangelicals to conspiracies such as QAnon (among others) that could eventually lead to danger or even violence (ex: Jan 6th, the 26% of W. Evangelicals who \"agree that true American patriots might have to resort to violence in order to save our country.\" - PRRI).   \nMy question: How much of a threat does the Christian Right pose to American democracy and peace? A shrinking demographic who may believe they are losing their country, when paired with their renowned civic activism and news media that reinforces their increasingly conspiratorial beliefs, might just be the recipe for outbreaks of political violence. Needless to say, this trend of the Christian Right has me sincerely concerned.\n\nI also want to quickly get out there that [Gordon Wood](https://moodle2.units.it/pluginfile.php/366505/mod_resource/content/1/Conspiracy%20and%20the%20Paranoid%20Style.pdf) and [Richard Hofstadter](https://harpers.org/archive/1964/11/the-paranoid-style-in-american-politics/) did some pretty well-known work on American/Colonial paranoia, suggesting that the colonists (many of whom had strong religious ties) viewed history as moments caused by individual actors rather than a stream of events. This allows them to attribute moral responsibility to bad actors and in doing so reveals how the good deed/bad deed doctrine of many Christian denominations might make believers more susceptible to conspiracy theories. After all, conspiracies are based on an idea that a small cabal of people are plotting something nefarious, like the Hellish plot of #PizzaGate.  \nWoods suggested that this \"individual actor\" thinking still runs strong in American veins. If so, am I being overdramatic in [this short essay](https://coachspo.substack.com/p/an-american-conspiracy-movement-that) where I claim that Christian Right conspiracies pose a significant threat to American safety?  \nA helpful recap of my essay: \"I believe there are warning signs around us. The size of the Religious Right is perpetually underrated in America and they are adopting conspiracy theories at a startling pace. What’s more, these theories are dangerous precisely because they promote the idea that White Christians are losing their status and identity. As Professor Walter proposed, when this happens the chance that a nation falls into violence or a Civil War only increases. Perhaps it was no coincidence that during the Insurrection the “Heavenly Father” was prayed to on the senate floor.\"",
    "permalink": "/r/TheMotte/comments/wda188/culture_war_roundup_for_the_week_of_august_01_2022/iii5pwd/"
  },
  {
    "kind": "t1",
    "id": "iii2yg0",
    "author": "Tophattingson",
    "score": 1,
    "createdUtc": 1659358612,
    "body": "According to [a survey by YouGov](https://twitter.com/YouGov/status/1549692153365991424), over the past four years, and particularly over the last two, opinions on trans issues have moved rightward (for lack of a better term) in the UK. The few positions that didn't move rightward relate to needing doctor's approval to legally change gender, or not requiring living as your new gender to legally change gender. However, these are two that were already very unpopular, and remain very unpopular, just slightly less, so it may represent changes only within the segment of the population that is very pro trans rights becoming even more pro.\n\nI've long suspected (or had as a concern) that existing legislation and institutional support for trans people, changes largely done out of the public eye, is only sustainable via obscurantism. That is to say, if the wider public knew how far the UK had already gone on this topic, that they'd want to roll it back, and the only reason they're not rolling it back is because they don't know. Between high-profile trans people in sports, and the escalation of activism in general, they are now increasingly noticing and not liking it. The real nuclear button on this would be treating refusing to date trans people as transphobic, [because the overwhelming majority of people will refuse to date them.](https://www.researchgate.net/publication/325490626_Transgender_exclusion_from_the_world_of_dating_Patterns_of_acceptance_and_rejection_of_hypothetical_trans_dating_partners_as_a_function_of_sexual_and_gender_identity)\n\nThis survey result is certainly interesting. It also counters the idea that there's an ever-leftward drift on all social issues.\n\nAs a side not, I'd be interested if anyone can approximate \"what percent of the UK's population would be banned from twitter / other social media if they were to clearly state their views on trans\" from the full survey results.",
    "permalink": "/r/TheMotte/comments/wda188/culture_war_roundup_for_the_week_of_august_01_2022/iii2yg0/"
  },
  {
    "kind": "t1",
    "id": "iihvt0j",
    "author": "Athanasius_19",
    "score": 1,
    "createdUtc": 1659354536,
    "body": "Just recently learned about the 30x30 initiative, [which aims to increase female representation among police officers to 30%](https://30x30initiative.org/about-30x30/)\n\n&gt; The 30×30 Initiative is based on the importance of achieving at least 30% representation to empower a group to influence an organization’s culture. This 30% threshold is where change begins to happen, but it is not our end goal. 30×30 is working with policing agencies to improve recruiting practices and establish community partnerships so that agencies become truly representative of the jurisdictions they serve. While 30×30 is focused on advancing women in policing, these principles are applicable to all demographic diversity, not just gender.\n\nThe website claims that women are better suited for police work, since \"women officers use less force and less excessive force; are named in fewer complaints and lawsuits; are perceived by communities as being more honest and compassionate; see better outcomes for crime victims, especially in sexual assault cases; and make fewer discretionary arrests.\"\n\nThey cite intersectionality as a cornerstone of the project, and several big police departments are listed as participating in this initiative. There are a few companies and activist groups backing it, including Microsoft. There's also a \"steering committee\" with a bunch of names I don't recognize, and would've skipped over until I noticed that all of them are women.\n\nThoughts on how this would affect police relations and effectiveness? My prediction is that police work will slightly improve in safer communities, but that in more dangerous areas there will be a negative effect towards more crime, since crime rates aren't something the page mentions outright.",
    "permalink": "/r/TheMotte/comments/wda188/culture_war_roundup_for_the_week_of_august_01_2022/iihvt0j/"
  },
  {
    "kind": "t1",
    "id": "iihhuxc",
    "author": "thatnoisy",
    "score": 1,
    "createdUtc": 1659343691,
    "body": "There is a group of specialists in Germany that work on designing signage/Symbols that can communicate to people 1 million years from now. The reason for that is the government's requirement that radioactive waste must be stored securely for 1 million years at least. This seems silly to me. \n\nYes radioactive waste is no laughing matter but are we really so concerned about hypothetical people in the far future digging up some barrels of (by then) mildly radioactive debris? This is assuming that A Humans still exist and B They lost the ability to produce Geiger counters. Really what pushes this into hypocrisy territory to me is that we actively don't give a shit about real actual humans right now. We could feed and shelter homeless people with the money that we're using to pay these historians and linguists. I just don't get it.",
    "permalink": "/r/TheMotte/comments/wda188/culture_war_roundup_for_the_week_of_august_01_2022/iihhuxc/"
  }
]
