[
  {
    "kind": "t1",
    "id": "imu8nvt",
    "author": "DevonAndChris",
    "score": 1,
    "createdUtc": 1662148804,
    "body": "Income Based Repayment is totally insane.\n\nPeople had pointed out that it was a reasonable part of the loan forgiveness. I had agreed. Now I think it is the worst, building a time bomb on purpose and refusing to disarm it.\n\nMaybe I am wrong. God I hope so. I laid out a lot of math below. *Part of the reason I wrote this was that someone could tell me where I messed up.* \n\n**Current regime**\n\nThe [current IBR rules](https://www.financialrounds.com/everything-you-need-to-know-about-income-based-repayment-ibr/) are that you pay at most 10% of your discretionary income (which I abbreviate DI here). DI is your income past 150% of the [Federal Poverty Rate (FPR)](https://www.healthcare.gov/glossary/federal-poverty-level-fpl/).\n\nIf I am a single guy, 150% of FPR is $20,385. If I earn $100K, my DI is about 80K, meaning I never have to pay more than 8K a year. If this is not enough to cover interest, that interest goes away. Even if it were getting capitalized into the balance, [any remaining balance is forgiven after 20 years](https://www.financialrounds.com/everything-you-need-to-know-about-income-based-repayment-ibr/) so who cares.\n\n([It used to be 25 years under \"old IBR\" but now we are in \"new IBR\"](https://fcaa.org/student-loan-repayment-plans/income-based-repayment/) and I guess we are about to get \"new new IBR\".\n\n$8000 is a lot of post-tax spending, but what incentives does it make?\n\n(I am going to make up a 5% interest rate for loans; this should be checked and numbers below reviewed on it changing).\n\nIf I take out **$93,000 in loans**, standard amortization means I will spend $8000 a year over 20 years to pay it down to zero. That **is the break-even point**. Each aditional dollar I borrow means $1.08 that disappears at the end.\n\n$93,000 is a lot of debt. [Only 4% get over 56K](https://www.aplu.org/our-work/5-archived-projects/college-costs-tuition-and-financial-aid/publicuvalues/student-debt.html) and only 0.5% hit 100K. Average medical debt is $200,000 but my numbers were based on a salary of $100,000 which doctors will eclipse.\n\nWhat if I run a family of 4? At $100,000 my DI is $58,375. That drops all the above loan numbers by about 30%. **$68,000 is still a lot of loans** to take out.\n\nBut let us change the salary. Average salary for a college graduate is around $55,000. For the single guy, that is a DI of $35,000, meaning annual payments of $3500. This is a DI of 44% of the original value, meaning **the break-even is now $40,700**. About 20% of graduates hit this level, eyeballing the earlier aplu.org link. This is starting to become a serious moral hazard.\n\nFor a family of 4 the DI at $55,000 is only $13375. That **requires only $15,600 in debt**. I am not so much worried about financially supporting a family of 4 making $55,000 as I am in giving them a direct incentive to go as expensive as possible once loans hit $15,600.\n\n\n\n**Proposed Regime**\n\nThe [new program](https://www.peoplespolicyproject.org/2022/08/26/the-new-income-driven-repayment-system-could-cause-some-big-problems/) has these relevant changes:\n\n* Increase the amount of income not subject to IDR from 150 percent of the federal poverty line to 225 percent of the federal poverty line.\n\n* Eliminate any accrual of interest on IDR-enrolled loans.\n\n* For undergraduate debt, reduce the IDR rate from 10 percent of income beyond the threshold in (1) to 5 percent of income beyond the threshold in (1).\n\nItems 1 and 3 directly change my math. I will get back to item 2 later.\n\nSo now our fresh-college-graduate-single-guy-making-$100,000 has a DI of (100000 - 13590 * 2.2) or $70,000 and annual payments of $3500. This means **the break-even point is now $40,700.** If he has (or will soon have) a family of 4 his DI is now just $38,950 and will pay no more than $1,950 per year. **Just $22,600 in loans is the break-even**, meaning there is no difference to him between borrowing $22,600 and $93,000. Might as well go into luxury student housing, move the family in.\n\nThat average college grad making $55,000 with a family of 4? Your DI is *less than zero*. In fact, **any income up to $61,050 means you do not have to pay a single cent towards your loans**, as the balance stays flat and the 20-year timer ticks away.\n\nItem 2 is missing from my analysis. If I read it right, as long as your income is below the IBR threshold, no money gets added, but in a lot of my above analysis that did not matter because uncapitalized interest vanished.\n\nI guess it matters if you think you will have many years of salad days and then suddenly earn a lot of money. If you could get an extra dollar in financial aid and put it in a crummy retail bank savings account, that would still be a good idea. Either 20 years hits and you get to keep all the money, or your income goes up and you withdraw the money from the savings account to pay it back.\n\nI want to make up a web calculator that shows the break-even point for given circumstances, but first I need to figure out how many mistakes I made above.",
    "permalink": "/r/TheMotte/comments/x0hc17/culture_war_roundup_for_the_week_of_august_29_2022/imu8nvt/"
  },
  {
    "kind": "t1",
    "id": "imu7i4x",
    "author": "ymeskhout",
    "score": 1,
    "createdUtc": 1662148336,
    "body": "After Roe v. Wade was overturned, a common argument was to describe pro-life Republicans as \"the dog that caught the car\". There's some indication that this is true, as Republican political candidates are [slowly walking away from strict abortion bans](https://reason.com/2022/08/30/republicans-supported-abortion-bans-for-decades-now-theyve-gone-silent/).\n\nI was obviously aware of the conservative stance on this topic but truthfully I never took it seriously. Because *Roe* had been a question answered on constitutional grounds, it meant no one could do anything about it short of a constitutional amendment that had no chance of passing. Which meant that advocates could jawbone all they want about wanting to ban abortions without ever having to be made to call their bluff. Blake Masters, Senate candidate in Arizona, used to support a national ban on abortion. But recently, he accused his opponent of mischaracterizing his position, and claims that he's only opposed to \"very late-term and partial-birth abortion\". His campaign website was modified to reflect this new position. Bailey, meet Motte.\n\nI noticed a similar reaction when stories like the 10-year-old rape victim in Ohio popped up. If you said you wanted to ban all abortions no questions asked, you necessarily had to support legally forcing that 10-year-old girl to carry to term. That also necessarily means prosecuting anyone who hinders that prohibition (doctors, pharmacists, anyone who facilitates inter-state travel, etc.) [through the typical avenues](https://www.currentaffairs.org/2017/10/people-literally-do-not-understand-what-laws-are-or-how-they-work), which means people with guns and badges threatening to put people in cages.\n\nThere's an easy way to square this circle. If you genuinely believe that abortion is as immoral as murder (without exception) and that the law should reflect that, then you have to support forcing 10-year-old rape victims into carrying their pregnancy to term. This is plainly justified even by conceding that forcing a child to carry her rapist's baby is atrocious, because the rejoinder would be terminating that fetus' life is an even bigger atrocity. I disagree strongly with those premises (a position I suspect is widely shared), but I at least genuinely respect their consistency. Now that *Roe* is gone, we get to see how many people are willing to grab the dilemma bull by the horns.",
    "permalink": "/r/TheMotte/comments/x0hc17/culture_war_roundup_for_the_week_of_august_29_2022/imu7i4x/"
  },
  {
    "kind": "t1",
    "id": "imtooq6",
    "author": "Texas_Rockets",
    "score": 1,
    "createdUtc": 1662140796,
    "body": "I'm not sure I agree with the criticisms of Biden's speech. The speech essentially functioned to demonize maga republicans. I think his ultimate intent here was to say that a. not all republicans are bad. it's the maga republicans. and b. that they increasingly pose a serious threat to democracy. i think this also served to actually put a name to that group, because they were previously just regarded as the alt right and there wasn't much distinction made between republicans and 'maga republicans' \n\nWhen I read about his speech it seemed to me that he was careful to say that he is not condemning all republicans; it is not that you are a democrat or are evil. \n\nThe narrative surrounding this speech has been that it just fanned existing divisions. but i don't think that's the case at all. i think he was trying to alienate those on the far right and create a broader coalition and appeal to more moderate republicans. specifically, i don't think the intent was to broaden divisions, i think the intent was to frame existing divisions in a more precise light, by saying that it is not left v right it is sane people v maga republicans, which i support. \n\nand for the record i do agree that maga republicans pose an existential threat to this country. fascism, if you look into it, is actually an incredibly complex political ideology that doesn't really fit within the current framework of political ideology. so i don't really use that term. but trump's supporters are increasingly defined exclusively by the fact that they are loyal to one man and one man only. they increasingly don't have any platform or foundation outside of unwavering support for trump. just consider how much trump hammered Clinton for a comparatively mild (but still problematic) transgression of keeping classified information safe, and how his supporters were right there with him on that issue. the guy was so dug in on that issue that he actually increased the penalty for that sort of behavior. and he just did not only that exact thing but took it a step further. yet these people are still with him. he also has literally challenged the fundamental legitimacy of any democratic institution that challenged him or did anything but failed to support him. I mean this guy literally said an election was corrupted solely because he lost. his supporters have also demonstrated a willingness to back Trump's interest with violence. based on their stances, what underlying principles can possibly be said to undergird trump or his supporters' stances? at a certain point we have to b able to recognize something for what it is. and I've also heard that republicans are starting to distance themselves from trump after the revelations of the past month, so the timing of this could end up being fairly astute on biden's part.",
    "permalink": "/r/TheMotte/comments/x0hc17/culture_war_roundup_for_the_week_of_august_29_2022/imtooq6/"
  },
  {
    "kind": "t1",
    "id": "imtiik9",
    "author": "wear146",
    "score": 1,
    "createdUtc": 1662138387,
    "body": "This isn’t necessarily culture war but I wanted to share what I consider to be some unambiguously good news which defied all of my expectations, namely that California will be saving the Diablo Canyon Nuclear power plant (https://www.latimes.com/california/story/2022-09-01/lawmakers-approve-1-4-billion-loan-for-pg-e-to-keep-diablo-canyon-nuclear-plant-open?_amp=true ). This represents substantial progress as the plant is Californias biggest carbon neutral electric source and I wonder if it represents a turning point for environmentalists to start accepting nuclear energy. I really wish I knew why the political calculation has changed so dramatically! However climate change really starts to appear much more tractable  if this technology is adopted, especially if these attitudes extend to the sorts of small modular reactors which are starting to get regulatory approval (https://www.world-nuclear-news.org/Articles/US-regulator-to-issue-final-certification-for-NuSc )",
    "permalink": "/r/TheMotte/comments/x0hc17/culture_war_roundup_for_the_week_of_august_29_2022/imtiik9/"
  },
  {
    "kind": "t1",
    "id": "imse9ru",
    "author": "Arminio90",
    "score": 1,
    "createdUtc": 1662121809,
    "body": "A small observation based on the activities of the LOTRonPrime subreddit, that I followed from the beginning. regarding mood-switching after certain events.\n\nThis strange phenomena occured again, after seeing it on subreddit dedicated to Star Wars and Game of Thrones;\n\n&amp;#x200B;\n\n\\- New product reveal itself, everyone agrees that looks terrible, that it is against the spirit of the original product, it is too woke etc.\n\n\\- After some days all big media begin to blast how there have been racist menaces, death threats, accusation or whatever against the show, especially black actors or women.\n\n\\- The moderation on the subreddit begin to use power to limit comments and users, blasting how bigotry is not allowed.\n\n\\- The overral mood on the subreddit change from negativity to neutrality or positivity. There are still criticism around, but is still limited. \n\n\\- Dissenters from these subreddit go to new subreddit dedicated to criticism, creating the \"Witch Covens\" we know so well, that became the ideological target of the users of the main subreddits (\"See, the nazi exiled themselves! They were nazi all the time, not fans!\")\n\n\\- The product ships, it is (usually) terrible, there are review bombing around and new attack from media against the criticizers. \n\n\\- In the wake of the new product, the users of the subreddit are very very supportive of it, attacking everyone as an incel, a nazi, a traitor or a combination or both (it is always about politics or sex!), go check the LOTRonprime sub if you do not believe it.\n\n&amp;#x200B;\n\nAfteer seeing this happen many times, I am beginning to think that adoption of woke policies and terminologies by entertainment corporations are less of an ideological capture and more of a cynical plot to defend their products from every kind of criticism.\n\nI do not know how it is possible that the mood switch from negativity to positivity after the first media tornado (the purges are effective? The users follow the stream? They attract people that are here only to \"own the nazi?\" No idea)\n\nBut I know that they are very effective, basically controlling the discourse on a social influencial like reddit without any difficulties. Besides, it is not a surprise that there are discourses and discussion around on how the public vote on sites like Rottentomatoes and similars should be forbidden because it is an hotbed of political extremism. Because this position has been told by the same users on the same subreddits.\n\n&amp;#x200B;\n\nWhat do you think?",
    "permalink": "/r/TheMotte/comments/x0hc17/culture_war_roundup_for_the_week_of_august_29_2022/imse9ru/"
  },
  {
    "kind": "t1",
    "id": "imqxcae",
    "author": "rokosbasilica",
    "score": 1,
    "createdUtc": 1662086611,
    "body": "Biden gave [a speech](https://www.youtube.com/watch?v=wygovCnX8Uw) tonight.  There was some [interesting imagery](https://pbs.twimg.com/media/Fbnb-x5XwAA1LB2?format=jpg&amp;name=medium) from it, although I'm not really a fan of these sorts of photos.  Also somewhat hilariously CNN tried [edit the hue of the stream](https://twitter.com/MiaCathell/status/1565533698795208704) in the middle of the speech, apparently to make it look less sinister.\n\nMy thoughts on the speech: I like the *surface version* of some parts of what biden is saying here.  Or maybe a better way to say that is: I like the character he is pretending to play.\n\nWhere this goes off the rails for me is: he's basically saying that almost half of the country is a threat to not just his power, but to democracy *itself*.  He goes on and on about how incredible our nation is (something I agree with), how important our ideals of democracy and free speech are (something I also agree with), but then goes on to say that \"MAGA\" is a threat to all of this.  Of course this is probably a performance for his followers, and of course this likely isn't going to move anybody in the direction of supporting him.  Maybe this will rile up his base?\n\nMy frustration with everything is: where does this supposedly lead?  If Biden loses power in November, and is removed from office either on or before january 2025, will he \"go peacefully\"?  Will there be riots?  Will more cities burn?  What happens when he loses an election in 2024?  I certainly don't think any of his followers will simply accept it and congratulate Trump or Desantis or anybody else.\n\nMy other frustration is: what biden is pretending to say here is actually really important.  We actually, truly, need somebody to unite the nation.  Here is what I wish he would do, and think this would make him go down as one of the best presidents in our nations history:\n\n* Blanket pardon for anybody involved in January 6th\n\n* Blanket pardon for anybody involved in summer 2020 rioting\n\n* Blanket pardon for Donald Trump, his family, and anybody related to his campaign WRT anything tax or document related, or anything else that the democratic machine has been running for the last 5 years.\n\n* Support a \"MAGA republican\" led committee to spend as much time as they want chasing down every conspiracy theory related to election fraud that they want, and encourage the courts to cooperate.  Televise it.\n\nIf Biden did this, it would take most of the wind out of the sails of these MAGA republicans, and it would solidify his win in 2024.  The thing fueling those MAGA republicans *is* them feeling like they have absolutely no voice in government right now, and seeing a president that they feel is invalid get in front of a scary red brick background and give an angry speech about how they aren't really valid as Americans certainly doesn't make them feel any better.\n\nJust saying: \"okay, I'll listen to you.\" would go a long, long, long way to reestablishing some trust *and* I think it would give him what he wants.\n\nUnfortunately I doubt this will happen.  That scares me.",
    "permalink": "/r/TheMotte/comments/x0hc17/culture_war_roundup_for_the_week_of_august_29_2022/imqxcae/"
  },
  {
    "kind": "t1",
    "id": "imqd24j",
    "author": "Amadanb",
    "score": 28,
    "createdUtc": 1662077430,
    "body": "**Possibly the Last? Ban Report**\n\nAs ZorbaTHut [has posted](https://www.reddit.com/r/TheMotte/comments/wulqxp/comment/ilj878k/?utm_source=share&amp;utm_medium=web2x&amp;context=3), D-Day approaches. The move is a matter of when, not if. I don't think the exact date for pulling the switch has been set, but it's possible this will be the last ban report here. (Whether I'll continue doing these on the new site... eh. We'll see. Depends on how the mod tools work, how much modding there is to do, how active I am after the changeover, etc.)\n\nIncidentally, there have been 3 AEO actions since the last report. One was someone talking about the dreaded triple parentheses and the admins failing to comprehend the use-mention distinction. One was someone using the newly-verboten g-word. And one was someone making a pretty bad comment about trans women which had already been modded before the admins came by and nuked it.\n\n**The Bans**\n\n/u/DreadnoughtOverdrive - [1 day](https://www.reddit.com/r/TheMotte/comments/wtpaql/comment/ilsnek6/?utm_source=share&amp;utm_medium=web2x&amp;context=3) - /u/Amadanb\n\n/u/dragonslion - [permaban](https://www.reddit.com/r/TheMotte/comments/wulqxp/comment/ilskynx/?utm_source=share&amp;utm_medium=web2x&amp;context=3) - /u/Amadanb\n\n/u/bgaesop - [7 days](https://www.reddit.com/r/TheMotte/comments/wulqxp/comment/ilkpsob/?utm_source=share&amp;utm_medium=web2x&amp;context=3) - /u/naraburns\n\n/u/SlightlyLessHairyApe - [3 days](https://www.reddit.com/r/TheMotte/comments/wos3do/comment/il95nmf/?utm_source=share&amp;utm_medium=web2x&amp;context=3link) - /u/ZorbaTHut\n\n/u/darwin2500 - [7 days](https://www.reddit.com/r/TheMotte/comments/vr0t4v/comment/iezy5fl/) - /u/naraburns\n\n/u/Kerguidou - [permaban](https://www.reddit.com/r/TheMotte/comments/wj1cwt/comment/ik2flgc/?utm_source=share&amp;utm_medium=web2x&amp;context=3) - /u/Amadanb\n\n/u/dblackdrake - [5 days](https://www.reddit.com/r/TheMotte/comments/wj1cwt/comment/ijrgzyr/) - /u/Amadanb\n\n/u/jermleeds - [14 days](https://www.reddit.com/r/TheMotte/comments/wj1cwt/comment/ijmwq2y/) - /u/naraburns\n\n/u/JeanStealers - [permaban](https://www.reddit.com/r/TheMotte/comments/wj1cwt/comment/ijh5u1t/?utm_source=share&amp;utm_medium=web2x&amp;context=3) - /u/Amadanb\n\n/u/Wangushenpo - [permaban](https://www.reddit.com/r/TheMotte/comments/wda188/comment/ij27d4d/?utm_source=share&amp;utm_medium=web2x&amp;context=3) - /u/Amadanb\n\n/u/_Roark - [permaban](https://www.reddit.com/r/TheMotte/comments/vauj5h/comment/iiwmn1u/?utm_source=share&amp;utm_medium=web2x&amp;context=3) - /u/Amadanb\n\n/u/RichardRogers - [7 days](https://www.reddit.com/r/TheMotte/comments/wda188/comment/iikma5q/) - /u/Amadanb\n\n/u/erkelep - [30 days](https://www.reddit.com/r/TheMotte/comments/w7h8wa/comment/ihupq7l/) - /u/naraburns",
    "permalink": "/r/TheMotte/comments/x0hc17/culture_war_roundup_for_the_week_of_august_29_2022/imqd24j/"
  },
  {
    "kind": "t1",
    "id": "impovm0",
    "author": "Atherzon",
    "score": 13,
    "createdUtc": 1662067164,
    "body": "I just listened to an episode of the Freakonomics podcast with Roland Fryer, an economist from Harvard, that studies race, policing, and education.\n\nHe shares a lot of statistics that contradict popular narratives about the issues, but probably won’t surprise many frequenters of this sub.\n\nFor example,\n\nHe finds that when that POC (people of color, I think is the term he uses) are not killed by police more.\n\nThat black kids are doing worse in school and advocates closing bad schools. \n\nThe pay gap isn’t really 33% or whatever, but it is closer to 9%, and there are concrete things that he can point to that cause the pay gap that aren’t discrimination (in one example it is a difference in overtime worked due to when shifts were scheduled). \n\nBasically, he is using data to analyze a lot of culture war adjacent topics and looking for actual reasons for discrepancies in outcomes rather than just pointing to discrimination because he really wants to improve the lives of people.\n\nSorry for the short initial post, but I like to watch.  I’m a free riding, lurker because posting takes so much energy.",
    "permalink": "/r/TheMotte/comments/x0hc17/culture_war_roundup_for_the_week_of_august_29_2022/impovm0/"
  },
  {
    "kind": "t1",
    "id": "imp4pty",
    "author": "EngageInFisticuffs",
    "score": 12,
    "createdUtc": 1662059490,
    "body": "Metaphors are useful illustrations for understanding. They are harmful for arguments.\n\nI recently read a post that was about one subject, mentioned something else as a point of comparison, and resulted in a conversation that was dominated by the metaphorical comparison rather than the subject level issue.\n\nThe entire point of metaphors is comparison of two very different things that have certain similarities. In the case of contention, what those similarities are is also likely to come under contention. Many of the metaphors on here turn into argument over the technicalities of the metaphor rather than the object-level issue. \n\nThat has a lot to do with the type of audience you get here, but it still illustrates that metaphors themselves can conceal as much as they reveal. Or even just emphasize and deemphasize certain aspects of the subject. While this is great for rhetoric, it does no favors for clarity of argument.",
    "permalink": "/r/TheMotte/comments/x0hc17/culture_war_roundup_for_the_week_of_august_29_2022/imp4pty/"
  },
  {
    "kind": "t1",
    "id": "imo2yki",
    "author": "Lurking_Chronicler_2",
    "score": 11,
    "createdUtc": 1662044994,
    "body": "/u/Ilforte any thoughts on Ravil Maganov‘s death? Seems... dubious... to me, but I’ll admit I know little about Russian internal politics, and I was wondering if you might be more informed on the matter.\n\n(Sorry if this isn’t the right place, but I don’t see any small-scale threads up at the moment).",
    "permalink": "/r/TheMotte/comments/x0hc17/culture_war_roundup_for_the_week_of_august_29_2022/imo2yki/"
  },
  {
    "kind": "t1",
    "id": "immjz1o",
    "author": "AlternativeEvent2584",
    "score": 36,
    "createdUtc": 1662012020,
    "body": "If we had the technology to actually change genders where you couldn't tell the difference between a woman/man born the wrong gender and an actual person born of that gender would you support it?\n\nI think it would change my mind. I personally don't have a problem with the idea of people being transgender. My biggest problem with it is I think we don't have the technology to actually do what is being promised and the surgery/transitioning is cruel to vulnerable people. All you have to do is go on /b or /pol to see the results to see that this is not a settled scientific process. I know it sounds gross, but seeing the results of these surgeries just makes me sick to my stomach. And then you have the child side where kids who aren't even fully developed emotionally/physically getting life changing surgery that can't be reversed. This is what bothers me the most.\n\nI truly think we will look back on this time the same as we do with lobotomies. It feels like we are doing experimental surgery on vulnerable people who would be better off staying their assigned gender. That's my argument against this current (what I consider) madness.\n\nI feel that most people agree with me here. However, if transitioning was actually possible, would you change your mind? To me, it makes the debate over. If you can safely and effectively transition people, what is the downside?\n\nEdit: On the 4chan part, I was being glib there. The point I was trying to make is that we only see bad results. With how aggressive the trans lobby is, if they were actually the same in how they looked, people would be saying look it's indistinguishable. That fact that we don't see this shows they know it looks unnatural and would be off-putting to most people if they actually saw the results. I’ve never seen a trans person pass irl. If they can’t make a person pass, there’s no way they can make a passing sex organ. The only people I've seen pass (and only online) are people who didn't go through puberty as the opposite sex. But that would basically mean we'd have to transition children, which I am pretty skeptical of.",
    "permalink": "/r/TheMotte/comments/x0hc17/culture_war_roundup_for_the_week_of_august_29_2022/immjz1o/"
  },
  {
    "kind": "t1",
    "id": "imkqyve",
    "author": "Vorpa-Glavo",
    "score": 5,
    "createdUtc": 1661980885,
    "body": "**Biological Sex without Teleology**\n\nAre a bird's wings \"for\" flying?\n\nFrom a metaphysical naturalist understanding of modern biology, the answer has to be no. \"For\" implies a purpose, and purpose belongs to agents.\n\nAn airplane's wings are for flying - the intentions of engineers ensure that. But birds had no creator, no agent involved in their existence. We might be able to metaphorically talk about a bird being \"designed\" or \"built\" for flight, but it is only that: a metaphor.\n\nIf we want to limit our description to what can be described based on an physico-empirical view of reality, then a bird's wing's **make flight possible** or **allow them to fly**, but we can't speak about a bird's wings being \"for\" anything at all.\n\nSo too with the word \"need.\"\n\nDoes a seed \"need\" water and sunlight and nutrient rich soil? A metaphysical naturalist would say no. \"Need\" implies that there's some sort of goal, or right way for a seed to be, but the universe doesn't care if a seed dies or grows into a giant tree over many eons.\n\nHumans trying to grow seeds might \"need\" water, and fertilizer and a location with the right amount of sun in order to fulfill that goal, but regarding the seed itself we can only make predictions about the outcomes of different conditions on the seed.\n\nIf the seed experiences Scenario A (X units of water delivered at intervals Y, Z units of soil of composition W, V hours of average daily sun exposure, etc.) then it will grow into a big tree, but if the seed experiences Scenario B (no water, no sun, no soil) it will stay a seed and die, with a thousand possible predictions branching off from these two.\n\nSo what do we make of \"sex\" from this standpoint?\n\nI think the radical thing that this line of thinking implies is to stop thinking about \"man\" and \"woman\" as some sort of natural pairing.\n\nJust as there are seeds, and we can make predictions about what effects particular conditions will have on the seed, so too there are animals and we can make predictions about what effects particular conditions will have on those animals.\n\nIf the gamete of animal A finds its way to the gamete of animal B, we might get a zygote, or we might get nothing at all depending on the particular animals involved and the particular gametes.\n\nThings start to come down to categoricity and disciplined pattern formation.\n\nIs a penis \"for\" a vagina? Is an ovum \"for\" a sperm? Do men and women have some sort of complimentary relationship?\n\nIt is almost certain that humans come pre-installed with social hardware that predisposes them to think of human males and human females as belonging to one type or category in some sense - the human. But if we pull back the curtains, we can see an equally valid way of slicing up reality: men and women are different but \"related\" things.\n\nMen and women rely on each other to reproduce their own kind. Men can't make more of themselves without women, and women can't make more of themselves without men. But why think of them as part of one \"species\" or \"type\"? Sure, they share a lot of similarities, and can be contrasted against things like \"rabbits\" as a whole, even as one can draw parallels between \"human males\" and \"rabbit males.\"\n\nI believe it was Bret Weinstein who said that if alien biologists came down to Earth, they would rediscover the concept of sex every day. I don't exactly take issue with this claim, but I do wonder if the aliens would have the encyclopedia entry \"Humans\", or if there would be two encyclopedia entries \"[Human-Male]\" and \"[Human-Female].\"\n\nThere's one layer deeper to go here, though. Would the alien biologists even stop there? How would they deal with intersex individuals?\n\nI think a certain form of so-called \"binary\" thinking is to talk about there being men and women, with intersex individuals being deviations from the norm that can still be forced into one of those two boxes, or filed away into a \"freak of nature\" box (though we would never call it that with modern social mores.)\n\nBut I think this \"binary\" thinking has exactly the same problem that \"needs\"- or \"for\"-based thinking produces: it engages in teleological thinking.\n\nWe could imagine that instead of having abstractions at the level of \"man\" and woman\" that the alien biologists have a unique compound word for everything that basically contains every bit of information about that thing known to the aliens.\n\nAt this level, maybe the alien biologists could notice patterns between two things, which for us would become categories, but for them remain unabstracted, ungeneralized observations about the entirety of existing things. Maybe these aliens don't even have the concept of \"distinct things\" but instead build up observations from correlations of raw sensory data that doesn't get processed by modules in their brain into \"objects\" and \"animals\" and \"things\", but instead is dealt with as a Unity with sub-patterns within patterns that can be interacted with and about which predictions can be made.\n\nI think our brain modules do a lot of work in making certain \"categories\" seem more plausible than others, that is the source of the shadow of teleology projected back out into the world. However, once we see past the shadow, it might genuinely become impossible to pick a point to stop cutting reality at the joints.",
    "permalink": "/r/TheMotte/comments/x0hc17/culture_war_roundup_for_the_week_of_august_29_2022/imkqyve/"
  },
  {
    "kind": "t1",
    "id": "imknlnp",
    "author": "Atersed",
    "score": 82,
    "createdUtc": 1661979607,
    "body": "Cloudflare has put out a blog post in response to mounting pressure for them to drop Kiwi Farms. Cloudflare had previously terminated services to The Daily Stormer and 8chan, but this time the company says it will take no action, and even suggest the previous deplatformings were a mistake.\n\nSelected quotes:\n\n&gt;Some argue that we should terminate these services to content we find reprehensible so that others can launch attacks to knock it offline. That is the equivalent argument in the physical world that the fire department shouldn't respond to fires in the homes of people who do not possess sufficient moral character. Both in the physical world and online, that is a dangerous precedent, and one that is over the long term most likely to disproportionately harm vulnerable and marginalized communities.\n\n&gt;[...]\n\n&gt;Just as the telephone company doesn't terminate your line if you say awful, racist, bigoted things, we have concluded in consultation with politicians, policy makers, and experts that turning off security services because we think what you publish is despicable is the wrong policy. To be clear, just because we did it in a limited set of cases before doesn’t mean we were right when we did. Or that we will ever do it again.\n\n&gt;[...]\n\n&gt;We do, however, believe that in cases where our values are diametrically opposed to a paying customer that we should take further steps to not only not profit from the customer, but to use any proceeds to further our companies’ values and oppose theirs.\n\n&gt;For instance, when a site that opposed LGBTQ+ rights signed up for a paid version of DDoS mitigation service we worked with our Proudflare employee resource group to identify an organization that supported LGBTQ+ rights and donate 100 percent of the fees for our services to them. We don't and won't talk about these efforts publicly because we don't do them for marketing purposes; we do them because they are aligned with what we believe is morally correct.\n\n\n\nhttps://blog.cloudflare.com/cloudflares-abuse-policies-and-approach/",
    "permalink": "/r/TheMotte/comments/x0hc17/culture_war_roundup_for_the_week_of_august_29_2022/imknlnp/"
  },
  {
    "kind": "t1",
    "id": "imk54ww",
    "author": "Stefferi",
    "score": 43,
    "createdUtc": 1661972700,
    "body": "So, fellow Europoors, what's the status of the electricity/cost-of-living crisis in your hoods?\n\nFinland is getting hit less than Central Europe, but getting hit nevertheless. We haven't been \\*quite\\* as dependent on Russian power than many other countries - Russian gas was only 5 % of the energy supply, Russians cut the flow already back in May, and in general Russian electricity imports have formed 10 % of the Finnish electricity use. However, prices are still expected to rise very high in the winter, naturally the season when the society most needs electricity and has to import it.\n\nThe crisis is particularly - as everywhere else - hitting those living in detached housing. Even though district heating and, lately, geothermal are increasingly popular for heating, and an increasing amoung of air-source heat pumps have been installed there's still a lot of them relying on direct electric heating, which on current terms translates to \"pay up the nose\". Such houses might well see electricity bills hitting well over a thousand a month, unless nothing is done.\n\nAmong various issues:\n\n\\- Nordic electricity generation is reliant on water power, and though the Nordic countries haven't seen droughts on the Central European level, these are still affecting water power generation. Finland has imported electricity from Norway, and now the Norwegians are mulling restricting [electricity exports](https://www.helsinkitimes.fi/finland/finland-news/domestic/22095-lintilae-norway-restricting-electricity-exports-would-play-into-putin-s-hands.html).\n\n\\- There would still be a chance to avoid the worst of it - if the Olkiluoto 3 nuclear generator goes fully online before the schedule, or at least is not delayed any more. Olkiluoto 3 has been the white whale of nuclear projects for years now, incredibly delayed and costly project that is now in test use, with those tests also frequently facing unplanned downtimes. The current estimate for Olkiluoto 3 finally starting commercial use is December 2022, but we'll see. In particular having OL3 being online and without issues would lead to stability - less need to worry about whether winter's particularly cold and how windy/sunny it is for renewables.\n\n\\- While browsing Twitter, I've seen a fair amount of what can only be described as 'schadenfreude' by pro-Russian right-wingers in various countries mocking Europeans with high energy bills and Ukraine flags in the profile photo. There's next to none of that here, as the entire Finnish society continues to be broadly pro-Ukrainian. I haven't seen any major political actors suggesting trying to make nice with Russia as a solution, of course it would be hard to do that by our lonesome anyway as long as we're a part of the EU, and Russians might tell us to pound sand anyway.\n\n\\- The environmental aspect is, of course, a big local culture war, especially in a country where much (most?) of the culture war has been environmentalism-related for a long time. It's not an easy question, non-/anti-environmentalists say that of course when you do things to drive up the costs of polluting the prices of electricity (which cannot really be produced in any way without \\*some\\* pollution) environmentalists claim that without the environmental measures the situation would be worse, comparing us to Britain where the junking of \"green crap\" led to end to insulation efforts or to countries that are more dependent on fossil fuels than us.\n\n\\- There's a back-up power reserve including, among others, Finland's last electricity-generation-oriented coal plant (other coal plants mainly generate heat). It's pretty certain that if it comes to firing up the power reserve or rolling blackouts, the power reserve is going to be fired up - that's what reserves are for, after all - but there are calls to do this already at this point with the electric bills going up, and apparently there are difficulties related to this, such as the fact that the said coal plant would need some heavy maintenance to bring back up.\n\n\\- much of the price rise is caused by market issues, Finland being a part of the European electric grid and thus being affected by the comparatively larger issues of the other countries, the sheer uncertainty of the situation hiking up the futures, and so on. Of course, if nations like Norway restrict exports, there's just going to be a domino effect with it being easier and easier for other nations to do the same when necessity calls. It's hard to see these sorts of crises as anything less than further evidence in the breakdown of globalization, unless it alternatively finally becomes the crisis the European elites can use to enact the European federation.\n\nThe government is planning measures to alleviate the crisis. Currently, the news are reporting that they're considering a measure for a tax rebate on bills over 500€ / month and a cut on the electricity VAT, as well as some less defined measure to help the poorest families and some throw-ins like doubled child benefits etc.\n\nTo me, this seems counterproductive - like tailormade to help the most energy-consumptive housing and the least-well off, but leaving large urban middle classes living in flats or in less-consumptive detached housing with only the VAT benefit. If we want to actually avoid rolling blackouts, and unless there's some measures that will lead to a lot of new electricity fast, it would seem we'd need to find some ways to reduce electricity use while ensuring that this won't break family budgets. That might mean models like guaranteeing a certain fixed price for electricity use under some ceiling and leaving market prices in force above that.",
    "permalink": "/r/TheMotte/comments/x0hc17/culture_war_roundup_for_the_week_of_august_29_2022/imk54ww/"
  },
  {
    "kind": "t1",
    "id": "imk3g7h",
    "author": "ymeskhout",
    "score": 23,
    "createdUtc": 1661972069,
    "body": "After failing to uncover evidence of what has been alleged as the greatest electoral fraud in the history of the world, the back-up plan for some in that camp is to display a \"tough on election fraud\" approach. But in effect, it looks like they're taking out their frustrations on random nobodies. One of those guys was Hervis Rogers, who went viral during the 2020 election for waiting in line at a polling place for six hours and being the last person to vote. He eagerly spoke to and gave his name to a TV news crew that was on site, presumably proud to showcase to the public how committed he was to voting.\n\nBut, it turns out, [Rogers was a convicted felon](https://spectrumlocalnews.com/tx/south-texas-el-paso/politics/2021/07/14/the-arrest-of-hervis-rogers-brings-bail-reform-into-focus). Now 62 years old, he had been convicted of a burglary almost 3 decades prior, spent 9 years in prison, and was eventually released in 2004. But he remained on parole until June 2020, and Texas law makes it a felony for anyone to \"knowingly\" vote while still serving a parole sentence. The publicity of being broadcast as the face of the voting franchise is likely what prompted an investigation into his voting record. Although his voting rights were restored in time for the 2020 election, Rogers had somehow cast ballots on two separate occasions (in March 2020 and November 2018) while he was still on parole.\n\nTexas' Attorney General, Ken Paxton, [brought the hammer down on Rogers](https://www.texastribune.org/2021/07/11/texas-voter-arrested-parole/). Paxton had been one of the most enthusiastic boosters of Trump's stolen election theories, and he was responsible for filing the doomed [SCOTUS case](https://en.wikipedia.org/wiki/Texas_v._Pennsylvania) in this realm. Paxton [publicized Rogers' case](https://twitter.com/kenpaxtontx/status/1413642254598688774?lang=en) as a way to flex how seriously he takes allegations of election fraud (Note: Paxton has [ongoing criminal legal issues](https://en.wikipedia.org/wiki/Ken_Paxton#Legal_issues). He was indicted for securities fraud in 2015, and in 2020 several of his deputies had resigned in protest and accused him of bribery and corruption. It's likely that Paxton's enthusiasm in this area was leveraged for the purpose of seeking a presidential pardon). Rogers was arrested and held in jail on $100,000 bail. \n\nPretrial bail is [nominally intended to encourage good behavior](https://ymeskhout.substack.com/p/the-poverty-trap-of-monetary-bail) from the accused while they wait for their trial. And with that in mind, it's impossible for me to appreciate how someone accused of illegally voting is somehow such a dramatic danger to the community to warrant $100k bail (especially since by the time he was arrested, Rogers' voting rights had been restored for more than a year). Sky-high bail in this case appears to have been used as a way to impose punishment *now*, regardless of the presumption of innocence, and regardless of what ends up happening to his charges down the road.\n\nBecause the facts of Rogers' situation meant that pretrial detention was very likely the only thing they ever would've gotten out of his case. It's difficult to see how the prosecution could prove beyond a reasonable doubt that Rogers \"knew\" he was legally barred from voting. After all, he was able to cast ballots on two separate occasions with no issues, and he showed no hesitation about speaking to a camera crew.\n\nThe same thing is again playing out, but this time in Florida. Gov. Ron DeSantis has similarly jumped on the \"tough-on-fraud\" bandwagon and has endorsed several proposals, including advocating for a ballot signature match system [which likely would have disqualified his own voter registration](https://www.tampabay.com/news/florida-politics/2021/04/13/desantis-wants-voters-signatures-to-match-would-his-pass-the-test/). DeSantis recently held a press conference to announce that 20 people with felony convictions who voted in the 2020 election will be arrested and charged. This was showcased as the \"opening salvo\" for the newly minted \"Office of Election Crimes and Security\" that was created by DeSantis.\n\nBefore 2018, Florida had permanent felony disenfranchisement laws (one of only four states). The only way for a felon to regain their voting rights then was to petition the State Board of Executive Clemency. Gov. Charlie Crist had instituted a system of automatic restoration and approved 155,000 applications during his tenure. Gov. Rick Scott ended this system, and the number of approved applications plummeted to 3,000. Florida voters ended up overwhelmingly approving [Amendment 4 in 2018](https://en.wikipedia.org/wiki/2018_Florida_Amendment_4), which instituted automatic voting right restoration for felons \"after they complete all terms of their sentence\". That specific clause became the subject of intense litigation, and the Legislature codified that \"all terms\" included paying all outstanding fines.\n\nA persistent problem with this implementation is that nobody seems to have a good idea of when exactly \"complete all terms\" actually happens. State officials have [repeatedly admitted in court they have no good centralized system in place to make this determination](https://www.wlrn.org/news/2019-10-04/everything-you-need-to-know-about-floridas-amendment-4-lawsuit). Court records (many of which several decades old) are all over the place and poorly catalogued, with each local clerk's office using a different format. Sometimes fines are collected by multiple different government agencies, and there is no easy system in place to double-check the ledgers.\n\nThe 20 people whose arrests DeSantis touted so far appear to have been in the same situation: They were *[specifically told by election authorities that they could vote](https://www.politico.com/news/2022/08/26/desantis-voter-fraud-defendants-florida-00053788)*.\n\nGiven how messy Amendment 4's implementation has been, it's unclear how any normal person is expected to navigate to an answer on their own. Getting an assurance from the local election authority seems to be the best that anyone can expect. So if anyone should get into trouble, perhaps it's the local officials who messed up? That's the tack [some on the DeSantis camp](https://twitter.com/tarynfenske/status/1563261005303787521) are staking. Except... the director of the \"Office of Election Crimes and Security\", who was appointed by DeSantis, [explicitly told local officials they were not at fault](https://www.politico.com/news/2022/08/29/despite-public-blame-desantis-election-investigation-chief-told-local-officials-they-face-no-fault-for-felon-voting-00054089). Local officials do not have access to all the relevant state-wide data, and [they instead rely on the state](https://slate.com/news-and-politics/2022/08/florida-voter-fraud-election-police-desantis-entrapment.html) via Division of Elections for this information.\n\nTo summarize, state officials in charge of tabulating incomplete felony sentences messed up and gave faulty information to local election officials. Those local officials approved the voting registration of people with felony convictions who by any measure appear to believe they were eligible to vote. Those people voted. Almost two years later, they get publicly arrested and dragged to jail for being dumb enough to believe someone from the government. Anyone want to defend this move?",
    "permalink": "/r/TheMotte/comments/x0hc17/culture_war_roundup_for_the_week_of_august_29_2022/imk3g7h/"
  },
  {
    "kind": "t1",
    "id": "imjh3kz",
    "author": "puntifex",
    "score": 48,
    "createdUtc": 1661963489,
    "body": "I am kinda surprised that we haven't done the Duke/BYU volleyball yet.\n\nA few days ago, the Duke volleyball played a game at BYU.  The game was overshadowed by allegations of ugly racism when Duke's black starter, Rachel Richardson (I think there are several black women on the team, but only she is a starter) said that she heard someone racially abuse her throughout the match.  The player's ~~grandmother~~ godmother also took to twitter to say that the player was called the n-word \"every time she served\".\n\nThis story hit the national papers with the predictable headlines - strong denunciation against racism, praise for Rachel as a strong person standing up to adversity, denunciation of coaches and officials, athleticndepartments, the crowd at the game, and all Mormons.\n\nBYU's AD apologized profusely, and the school indefinitely banned a fan identified by Duke as the racist abuser. Rachel herself appeared on several national news stories, with the expected taking points and responses. \n\nA few days later, though, people stated asking questions.  Several students who were at the game came forward on the record to say that the racial slurs nevered happened.  Officials reviewed video of the crowd from the game, including when people claimed slurs were used - and AFAIK they've found... nothing. \n\nThere are other questions.  People started wondering why her teammates - whom one assumes both at least kinda like her (she certainly hasn't denounced any of her teammates as evil racists) , and, being 20 year old female athletes at an elite US institution are probably among the wokest people on the whole planet - haven't said anything,  as far as I've seen?\n\nDisclaimer - it's not like I've done extensive research.  But I've deen no articles writing anyone other than her or her family.   The Duke captain has an instagram that was updated two weeks ago - nothing.  All the quotes are from Richardson or her immediate family. \n\nAnd by the way - that ~~grandmother~~ godmother?  She happens to be a politician running for some office. \n\nI guess it would be hard for this story to be more unbelievable than the Duke lacrosse case (where the prosecutor was literally explicitly trying to frame some innocent kids of the right demographic, and was later disbarred),  and that was ~10 years ago, so I guess I shouldn't be surprised.\n\nEdit - someone asked for links.  Disclaimer - I have a day job.  I am not claiming to be an expert or to have done extensive research as honestly, is not worth it.  But I am being honest in saying what I haven't seen.  If someone can post links that credibly contradict what I said (for examples, her teammates reacting strongly on the night of the event), I will gladly reconsider.  It's also hard to prove a negative,  and I'm certainly not going to trawl through 30 college students' instagrams.  All my links were from google or twitter, so nothing hard to find.\n\nDuke volleyball captains instagrams are easily google-able, so I'm not linking them.\n\nThe original face-value sucks are also very easy to find (abc, espn, usatoday, etc etc etc)\n\nHere are some links calling the account into question\n\nhttps://www.sltrib.com/sports/2022/08/30/fan-who-was-banned-by-byu-does/\n\nI'd *really* rather not link turtleboy sports given their culrure war angle but if nobody else is gonna cover it (and tweets are now deleted), whatcha gonna do?\n\nhttps://tbdailynews.com/video-shows-that-duke-volleyball-player-and-her-politician-godmother-are-lying-about-being-called-n-word-during-byu-game/",
    "permalink": "/r/TheMotte/comments/x0hc17/culture_war_roundup_for_the_week_of_august_29_2022/imjh3kz/"
  },
  {
    "kind": "t1",
    "id": "imj4q5z",
    "author": "Atherzon",
    "score": 16,
    "createdUtc": 1661958718,
    "body": "For those not following Russia’s invasion of Ukraine closely, Ukraine has been projecting a counter offensive in the Kherson region for two months, and they initiated it two days ago.\n\nIt is still very early and the Fog of War is thick, but I think we are about a week until we will have a good idea of how the counter offensive is (or was) going and that will tell us a lot about the future of the conflict.",
    "permalink": "/r/TheMotte/comments/x0hc17/culture_war_roundup_for_the_week_of_august_29_2022/imj4q5z/"
  },
  {
    "kind": "t1",
    "id": "imhhqa5",
    "author": "huadpe",
    "score": 26,
    "createdUtc": 1661922463,
    "body": "The DoJ has filed [their response](https://int.nyt.com/data/documenttools/doj-response-to-trump-request-for-special-master/1b30feb331082a68/full.pdf) to Trump's request to appoint a special master.  It is quite long, has a number of attachments, and gives us a lot more insight into the investigation so far.\n\nMy highlights:\n\n1.  The filing includes a partially redacted photo of some of the documents seized during the search. *(Attachment F, last page of the pdf)*\n\n This photo will be the front page of basically every paper tomorrow, and was certainly a conscious choice to include as it looks extremely damning.  There are a bunch of documents with really blatant cover sheets and TOP SECRET // SCI printed in 36 point red font multiple times.\n\n2.  The filing also gives us a copy of the subpoena that was issued on May 11 of this year, and the response provided on June 3. *(attachments C and E)*\n\n The subpoena demanded:\n\n &gt;Any and all documents or writings in the custody or control of Donald J. Trump and/or the Office of\nDonald J. Trump bearing classification markings, including but not limited to the following: Top Secret,\nSecret , Confidential, Top Secret/ SI- G/NOFORN/ ORCON , Top Secret/ SI-G/NOFORN, Top Secret/HCS\nO /NOFORN/ ORCON, Top Secret/ HCS- /NOFORN, Top Secret/HCS- P/NOFORN/ ORCON,\nSecret/ HCS- P/NOFORN, Top Secret/ TK/ NOFORN/ ORCON, Top Secret/ TK/ NOFORN,\nSecret NOFORN, Confidential/ NOFORN, TS , TS / SAP , TS / SI-G/NF/OC , TS / SI- G/ NF, TS/ HCS\nO/ NF/ OC, TS/ HCS- O/NF, TS/ HCS- P/NF/ OC , TS / HCS-P/ NF, TS/ HCS- P/ SI- G, TS / HCS- P/ SI/ TK ,\nTS/ TK/NF/ OC , TS/ TK/NF, S/ NF, S / FRD , S /NATO, S / SI, C , and C /NF\n\n The response said:\n\n &gt;Based upon the information that has been provided to me ,I am authorized to certify , on\nbehalf of the Office of Donald J. Trump , the following :\n\n &gt;a. A diligent search was conducted of the boxes that were moved from the White\nHouse to Florida;\n\n &gt;b. This search was conducted after receipt of the subpoena, in order to locate any\nand all documents that are responsive to the subpoena;\n\n &gt;c. Any and all responsive documents accompany this certification; and\n\n &gt; d. No copy, written notation, or reproduction of any kind was retained as to any\nresponsive document.\n\n &gt;I swear or affirm that the above statements are true and correct to the best of my knowledge.\n\n The response to the subpoena was to produce a single envelope, double wrapped in tape, which contained 38 documents with different classification markings.\n\n3.  DoJ says they found classified documents in Trump's office desk in the drawer which contained his passports, *(p. 12)* which was the reason his passports were seized.  The warrant told them to seize all contents of any containers that have classified information.\n\n4. DoJ says multiple times *(p. 4 and 8)* that at no point prior to the execution of the search warrant execution did Trump claim he had declassified any of these documents despite numerous opportunities to do so.\n\n5. DoJ hints at some specific evidence about documents being moved around Mar-A-Lago beyond what's known so far.  In particular they say *(p. 10)*:\n\n &gt;Through further investigation, the FBI uncovered multiple sources of evidence\nindicating that the response to the May 11 grand jury subpoena was incomplete and that\nclassified documents remained at the Premises, notwithstanding the sworn certification made\nto the government on June 3. In particular, the government developed evidence that a search\nlimited to the Storage Room would not have uncovered all the classified documents at the\nPremises. The government also developed evidence that government records were likely\nconcealed and removed from the Storage Room and that efforts were likely taken to obstruct\nthe government’s investigation. ... This included evidence indicating that boxes formerly in the Storage Room\nwere not returned prior to counsel’s review.\n\n6. DoJ says they have finished their privilege review for attorney/client privilege already, and do not think executive privilege can possibly apply, and did not filter for it.",
    "permalink": "/r/TheMotte/comments/x0hc17/culture_war_roundup_for_the_week_of_august_29_2022/imhhqa5/"
  },
  {
    "kind": "t1",
    "id": "imgofrm",
    "author": "gardenofjew",
    "score": 19,
    "createdUtc": 1661907427,
    "body": "**Is \"Paperclipping\" a fringe idea?**\n\nLately, u/ilforte  has been banging the drum of [paraphrasing] \"worrying about alignment too much at the expense of a high-freedom future is terrible, Yud is deeply paranoid which colors everything else he writes about, etc.\" \"Here is some suggestive evidence that Ilforte is mistaken on AGI Doom being a fringe/LW-only/Yud!/etc. idea:\n\n1. DeepMind's alignment team [engaging](https://www.lesswrong.com/posts/qJgz2YapqpFEDTLKn/deepmind-alignment-team-opinions-on-agi-ruin-arguments) with Yud's List of Lethalities post. I don't detect much sneering, mostly specific disagreements with specific things.  \n\n2. Sam Altman (OpenAI) re-tweeting that list of lethalities post (would link but short on time rn, easily found if you scroll back far enough)\n\n3. Stability AI (of Stable Diffusion fame) is related to EleutherAI in some capacity. There's definitely a lot of personnel overlap. Emad (head of Stability AI, someone Ilforte has spoken very fondly of) has retweeted various LW posts ([1)](https://twitter.com/EMostaque/status/1563715319566409729) and has [retweeted this job ad](https://twitter.com/EMostaque/status/1512405527350943746) from Conjecture, the Alignment focused spin-off of EleutherAI, founded by Connor Leahy, seems to have alignment takes that are not far from Yud's, as you can tell if you either watch his interview on a [recent podcast](https://www.youtube.com/watch?v=Oz4G9zrlAGs&amp;ab_channel=TheInsideView) or simply read his feed. \n\nnote: These are three differnet organizations, all with relatively diverse views on AI, especially Stability AI vs the others. \n\n\n**What is the point of this post?**\n\nIlforte is an extremely eloquent writer. He is probably the most talented (certainly the most compelling! though IMO his prose is often far from lucid...) prose writer currently active on /themotte. And yet he seems to have a completely evidence-free view on the possible danger of AGI, has a deeply suspicious view of Yud, who, for all of his many flaws, is so bad at hiding his own views that he spends all of his weirdness points debating PR-toxic topics like baby qualia-- (you can accuse Yud of a few things, but a talented dissassembler for the sake of other goals he definitely is not...)\n\nIlforte seems to have decided to direct all of his immense verbal talent to deriding pessimistic takes on AGI, and I think this bad. I think a redteaming of paranoid takes on AI is great, but Ilforte has often made his arguments mostly through suspicion of AI-suspicious people.\n\nI think its time someone pointed at this argument directly and engaged with it. I'm not that person, unfortunately, because I'm drowning in work rn, but I'm planting a flag here and hoping Ilforte and others can debate productively about ways that [suspicious of AGI] and [suspicious of those who are suspicious of AGI] can productively disagree and understand the world better.",
    "permalink": "/r/TheMotte/comments/x0hc17/culture_war_roundup_for_the_week_of_august_29_2022/imgofrm/"
  },
  {
    "kind": "t1",
    "id": "imgejsp",
    "author": "DinoInNameOnly",
    "score": 52,
    "createdUtc": 1661902975,
    "body": "**There's Still a TJ Test, Actually**\n\nThe [Thomas Jefferson High School for Science and Technology](https://en.wikipedia.org/wiki/Thomas_Jefferson_High_School_for_Science_and_Technology) is a magnet STEM-focused high school in Northern Virginia established in 1985. The school has special facilities meant to provide opportunities for students who show achievement and passion for STEM and who will eventually pursue careers in science, engineering, or medicine. It has courses in things like artificial intelligence, quantum mechanics, DNA science, and machine learning. It also has several labs where students can do research projects. It was [ranked](https://www.usnews.com/education/best-high-schools/virginia/districts/fairfax-county-public-schools/thomas-jefferson-high-school-for-science-and-technology-20461) as the best school in the country in 2022. \n\nUntil recently, TJ admitted students through a competitive process similar to the college admissions process in which prior academic achievement, teacher recommendations, and an exam similar to the SAT played a major role. The school had a low proportion of black and Hispanic students who were admitted, and this was long a complaint of left-wing activists who advocate reforms to the admissions process so that more non-Asian minorities would be admitted. In particular, they blamed the admissions exam for eliminating most such students from consideration.\n\nIn 2020, those activists got their way. The school board voted to eliminate the admissions test in [October 2020](https://www.washingtonpost.com/local/education/thomas-jefferson-high-admissions-change/2020/10/07/0a1f8faa-08a7-11eb-9be6-cf25fb429f1a_story.html) and later that year made other reforms to the admissions process, including setting minimum quotas for admission at the middle school level and adding \"experience factors\" to the process. The [class of students](https://www.fcps.edu/news/tjhsst-offers-admission-550-students-broadens-access-students-who-have-aptitude-stem) admitted the next year went from being 4.52% black and Hispanic to 18.36%. \n\nAn advocacy group opposed to the 2020 changes [sued](https://en.wikipedia.org/wiki/Coalition_for_TJ_v._Fairfax_County_School_Board), alleging the changes discriminated against Asian Americans, whose share of admitted students decreased from 73.05% to 54.36%. The case is currently pending before the appeals court.\n\nOne thing I realized while I was researching this is that there actually still is a test that influences your probability of admission to TJ. One of the \"experience factors\" that increases a student's odds of being admitted in the [new admissions process](https://www.fcps.edu/registration/thomas-jefferson-high-school-science-and-technology-admissions/tjhsst-freshman) is whether they are an English Language Learner (ELL). An [ELL is a student](https://wida.wisc.edu/sites/default/files/resource/explaining-ell-status-english.pdf) who has extra support learning English in school. How do schools identify which students need extra support learning English?\n\nWell, there's a test. Schools administer an English skills test and students who perform poorly on it are identified as ELL and offered extra instruction in special classes for ELLs. \n\nWhat this means for TJ is that a student's chance of being admitted to an elite school for the academically excellent is *increased* if they perform *poorly* enough on evaluations of their language skills.\n\nThe reason the school board added this consideration is obvious: The [large majority (78%)](https://www2.ed.gov/datastory/el-characteristics/index.html#four) of ELLs are Hispanic, so preferring ELLs in the admissions process is a way to increase the proportion of Hispanics admitted without needing to add race to the admissions process explicitly (which would be more easily challenged legally). Asians make up 11% of ELLs too, but it's notable that Hispanics outnumber Asians among ELLs by 7:1 but only by about 3:1 in the general population ([6.1% vs. 18.9%](https://www.census.gov/quickfacts/fact/table/US/PST045221)). A lot of Asian kids speak two languages but their parents made sure they were good enough with English that they don't need any special instruction.\n\nThis is just... so backwards. I don't think it would be fair to prefer students who speak more than one language in admission to TJ. But I could see an argument for it: Students who successfully learned a second language and succeeded enough to be equally or almost equally academically impressive as students who speak English natively have done something really impressive, now that they've mastered the lingua franca, they'll probably shine even brighter. In fact, this describes a large proportion of the students admitted to TJ under the old process. But that's not what they're doing with this new process. They're specifically preferring the students who were *least* successful at learning the new language, the ones who struggled the *most* with it. \n\nOn top of that, immigrant families who were responsible and ~~paid off their student loans~~ taught their kids English fluency and saved the taxpayer-funded school system the extra burden of dealing with kids who don't know English are punished, while the ones who depended on the government for that are rewarded.\n\nWell, expect an increase in enrollment in ELL programs in Fairfax County of kids who seem to be speak pretty good English most of the time.",
    "permalink": "/r/TheMotte/comments/x0hc17/culture_war_roundup_for_the_week_of_august_29_2022/imgejsp/"
  },
  {
    "kind": "t1",
    "id": "imfp7ja",
    "author": "Evinceo",
    "score": 5,
    "createdUtc": 1661892439,
    "body": "**Is data truth?**\n\nSince I owed a reply to /u/Im_not_JB here: https://www.reddit.com/r/TheMotte/comments/wulqxp/comment/ilvutba/\n\nI'm gonna try and figure out where we are with WikiLeaks.\n\nWikileaks has come from the perspective that information wants to be free, that leaks hold people accountable, and that releasing all available data is the best way to do so.\n\nI think that this came from the same place of Aaron Schwartz, Jimbo Whales techno-utopian anti-state idealism that was in the air around the mid to late aughts. Compare the [Declaration Of Independence Of Cyberspace](https://www.eff.org/cyberspace-independence).\n\nWe now live in that world, where it's easy to disseminate vast dumps of data. It's available to anyone. But now that we have it, I wonder if it's really the best approach. Because what we end up getting is just data. It doesn't come with the tools to analyze it, and in the absence of analysts by competent folks, we get The Internet doing its own sleuthing. From misidentifying the Boston Bomber to pizzagate, I can think of examples of information overload harming rather than helping.\n\nAnd that makes me lean back towards the journalistic approach of combining data with analysis and responsibility. I can think of plenty of hard hitting stories like the Panama papers that _did_ work out.\n\nI think the profession of journalism won. I don't think it can or should be replaced by blindly dumping any data you can get your hands on and calling it journalism.",
    "permalink": "/r/TheMotte/comments/x0hc17/culture_war_roundup_for_the_week_of_august_29_2022/imfp7ja/"
  },
  {
    "kind": "t1",
    "id": "ime3y6y",
    "author": "roolb",
    "score": 48,
    "createdUtc": 1661870338,
    "body": "News from an old corner of the culture war: Oberlin is [denied an appeal](https://legalinsurrection.com/2022/08/gibsons-bakery-wins-ohio-supreme-court-refuses-to-hear-oberlin-college-appeal/) to the Ohio Supreme Court in its loss to Gibson's Bakery. This is the end of the appellate road in the state, but I don't know if federal court is an option.",
    "permalink": "/r/TheMotte/comments/x0hc17/culture_war_roundup_for_the_week_of_august_29_2022/ime3y6y/"
  },
  {
    "kind": "t1",
    "id": "ime085j",
    "author": "deadpantroglodytes",
    "score": 41,
    "createdUtc": 1661868803,
    "body": "**More on Student Loan Relief**\n\nThis week, the New York Times published [Why Student Debt Relief Isn’t Elitist](https://www.nytimes.com/2022/08/29/opinion/student-debt-relief.html) by Paul Krugman and [Why I Changed My Mind on Student Debt Forgiveness](https://www.nytimes.com/2022/08/30/opinion/student-loan-debt-relief-biden.html) (by Susan Dynarski, a Harvard economist). Krugman's mostly calling out Republican hypocrisy in one form or another (fine as far as it goes), but the substantive part follows:\n\n&gt;The Biden administration says that its plan will provide relief to as many as 43 million Americans. That’s a lot of people, not a small, cosseted elite.  \n&gt;  \n&gt;even if you subscribe to the Trump diner theory of politics — according to which the only voters who matter are blue-collar guys wearing baseball caps — you should be aware that some of those guys probably took out loans to attend trade schools or community colleges, all too often getting nothing but debt in return. Even among those who didn’t take out student loans, many probably have children, siblings, cousins or friends who did. So the Biden plan will touch many people.\n\nDynarski's article focuses on the borrowers hardest hit.\n\n&gt;Defaults and financial distress are concentrated among the millions of students who drop out without a degree. The financial prospects for college dropouts are poor; they earn little more than do workers with no college education ...  \n&gt;  \n&gt;And dropout is not at all rare. A bit less than half of college students don’t earn a bachelor’s degree. Some people earn a shorter, two-year associate degree. But more than a quarter of those who start college hoping to earn a degree drop out with no credential.\n\nIf we take those articles at face value \\[0\\], we're talking about a program that provides relief to about 13 million Americans that fit a very sympathetic profile and badly need it - and a bonanza for another 30 million people, most of whom do not need that relief. \\[1\\]\n\n**Would Anyone Support Country Club Loan Relief?**\n\nLet's pretend for a moment that a Republican administration instituted a program subsidizing country club membership. After all, a lot of businesses are built and supported by the informal networks around country clubs, plus people that belong to country clubs tend to be successful.\n\nSo picture that: 60-70% of the borrowers do pretty well for themselves. Their businesses improve and they get richer. However, a substantial minority of the loan recipients don't have access to high-quality country clubs with their impressive facilities and wealthy cohorts. 30-40% take out loans to join municipal clubs or some strange off-brand variation called into being by the amount of money pumped into the system. The people do not flourish, their businesses do not succeed.\n\nI don't think many people would stand for a country club relief program for both groups, and I don't think the New York Times would publish multiple defenses of the program in the space of a week.\n\nThis comparison might not sound fair, especially if you went to community college or commuter school (to say nothing of a for-profit college), but I promise it is directionally accurate.\\[2\\]\n\nAt liberal arts colleges, most private universities, and flagship state schools (at least), you get unbelievable amenities for your money. It's not just the oft-ridiculed climbing walls and lazy rivers - I'm talking about the basics, the features of college that predate the crazy expansion of the last thirty (?) years: access to first-rate facilities, people paid to serve you, people paid to do your dishes, and on top of all that, excellent event programming so that, if your studies ever bore you, you'll still be stimulated.\n\nUltimately, I'm shocked that so many early reactions to this involve a shrug, or (worse) approval of the policy, seemingly based on the sympathetic profile of a minority of beneficiaries, though maybe that's my naivete. Another writer here (responding to Trace's post, I think) wrote convincingly that people probably just conceive of this as \"free college\" rather than debt. That's an idea that's probably more popular than \"free country clubs\" (and definitely more popular than \"free country clubs for the rich\"), but I'm not sure it deserves the support.\n\n\\[0\\] People that have some college but no degree already do moderately better than people with a high-school diploma, [per the US Bureau of Labor Statistics](https://www.bls.gov/emp/chart-unemployment-earnings-education.htm), or [this Northeastern University study](https://www.northeastern.edu/bachelors-completion/news/average-salary-by-education-level), or any of the dozens of links that pop up when you start to research education and income.\n\n\\[1\\] \"More than a quarter\" = 30% \\* Krugman's \"43 million Americans\", then round it up.\n\n\\[2\\] Apart from, of course, the educational experience. But I must say, this is easy to overstate, especially if you've been [Fred-pilled](https://substack.com/profile/12666725-freddie-deboer).",
    "permalink": "/r/TheMotte/comments/x0hc17/culture_war_roundup_for_the_week_of_august_29_2022/ime085j/"
  }
]
