[
  {
    "kind": "t1",
    "id": "ifs4qa3",
    "author": "[deleted]",
    "score": 1,
    "createdUtc": 1657577920,
    "body": "[deleted]",
    "permalink": "/r/TheMotte/comments/vwbj4s/culture_war_roundup_for_the_week_of_july_11_2022/ifs4qa3/"
  },
  {
    "kind": "t1",
    "id": "ifrq463",
    "author": "Sinity",
    "score": 1,
    "createdUtc": 1657572172,
    "body": "In Poland, government decided to create a new school subject for high schools, \"History and Present [time]\". It is kinda CW-related.\n\n[Core curriculum](https://pastebin.com/56ftUTbw)\n===\n\n(I've translated it and dumped onto pastebin); some excerpts below:\n\nObjectives\n\n&gt; 1. In the aspect of attitude to the truth: the acquisition of reliable knowledge of the most important cultural, political, social and economic changes in Poland and the world after 1945 up to the present - and in this context obtaining an understanding of the main issues of social life, politics and law, as well as knowledge of the immediate origins and nature of the great problems of the modern world.\n&gt;  \n&gt; 2. in the aspect of attitude towards the good: to prepare the student for an independent and fair assessment of the said changes taking place in Poland and in the world since the end of World War II in terms of continuity and change (or rupture) in relation to the foundations from which our Homeland grows, understood as a community shaped according to specific cultural norms and visions of man, family and society dating back to the classical Greco-Roman civilization and Christianity.\n&gt;  \n&gt; 3. in the aspect of attitude to life: acquiring an inquisitive interest in collective life, readiness to personally undertake social tasks and civic involvement in the spirit of patriotism as a wise love of the homeland formed in the tradition of the Republic, through the practice of individual and social virtues, as well as through the discovery of the harmony of rights and duties, freedom and responsibility, human happiness and the development of human communities, and the importance of just laws and prudent policies.\n\nSome specific requirements\n\n&gt; I.\tKnowledge of the fundamentals of social life. The student:\n==\n&gt; 2) explains how the concept of \"social contract\" developed in modernity differs from the traditional understanding of the naturalness of social ties;\n&gt; \n&gt; 6) can explain the process of nation-building and the variety of contexts of meaning of this concept; explains what patriotism is and how it differs from chauvinism and cosmopolitanism;\n&gt; \n&gt; 10) can list and characterize the basic attributes of the state and explains what the raison d'etre of the state is;\n&gt; \n&gt; 11) can explain the various models of the relationship of churches and religious associations with the state, especially those present in the tradition of the First and Second Commonwealths;\n&gt; \n&gt; 15) explains the basis and content of \"human rights\" and their relationship to the heritage of Western civilization (inspiration coming from Christianity and from the science of natural law dating back to Greco-Roman times);\n\n(This last one is _interesting_ given beliefs of our current Minister of Education. See section \"Czarnek\" below.)\n\n\n&gt; II.\tThe world and Poland in 1945-1956. Student:\n==\n&gt; 4) can explain where the term \"Cold War\" and \"Iron Curtain\" came from and in what sense it was used, and presents the main areas of Cold War confrontation;\n&gt; \n&gt; 5) explains the significance of the establishment of NATO and the Warsaw Pact;\n&gt; \n&gt; 8) can apply his knowledge of the relationship of states and the kinship of nations to characterize the beginnings of European integration in the economic and political fields (until 1957), indicating its ideological reasons (the Christian worldview of the \"Founding Fathers\"), cultural reasons (the proximity of European nations) and political reasons (fear of Soviet expansion, preparing to receive American aid under the so-called Marshall Plan, solving the \"German problem\" by integrating the German economy with other Western economies);\n&gt; \n&gt; 10) characterizes the significance of the seizure of power in China by the Communists in 1949 and Mao Zedong's rule (the greatest genocide after 1945 during the \"Great Leap Forward\", persecution of religion);\n&gt; \n&gt; 11) explains the significance of the creation of the state of Israel for the situation in the Middle East and for international politics;\n&gt; \n&gt; 12) **characterizes the origins and principles of Zionism and Islamism;**\n&gt; \n&gt; 21) characterizes the 1952 constitution of the People's Republic of Poland, its definition of the sovereign (\"working people\"), as well as its propaganda nature and façade in relation to the real rule of the PZPR.\n\n\n&gt; III. The world and Poland from 1956 to 1970. Student:\n==\n&gt; 8) characterizes the principles of the social market economy and the \"welfare state\", presents examples of them in relation to the world of the early 1960s;\n&gt; \n&gt; **9) characterizes the social and moral transformations known as the \"1968 revolution\" (including the \"sexual revolution\") and their intellectual inspirations (neo-Marxism, \"new left\");**\n\n&gt; 10) characterizes pacifist ideas and movements; **can identify the difference between ecology and ecologism;**\n&gt; \n&gt; \n&gt; 15) explains the concept of \"cultural revolution\", pointing to its different contexts of meaning (what is the difference between the Chinese \"cultural revolution\" and that in the West);\n&gt; \n&gt; \n&gt; 17) characterizes the ways of struggle of the regime of the Polish People's Republic against the Church in the 60s and 70s (including the relegation of religious people to the status of second-class citizens);\n&gt; \n&gt; 18) is able to apply his knowledge of various models of relations between religious associations and the state to explain **the communist policy of \"separation of church and state\"; explains the terms: secularism, secularism, indifferentism;**\n&gt; \n&gt; \n&gt; IV.\tThe world and Poland in 1970-1980 The student:\n==\n&gt; 1) characterizes the reasons for the weakening of the position of the United States of America in the world in the early 1970s and the growth of the influence of the global communist camp (defeat in Vietnam, the Watergate affair, the energy crisis);\n&gt; \n&gt; 7) characterizes the way in which Germany settles its accounts with the legacy of Nazi rule (positive and negative examples: the activities of the Center for the Prosecution of Nazi Crimes in Ludwigsburg, the career of Heinz Reinefarth, the issue of reparations and restitution of the works of art seized in Poland);\n&gt; \n&gt; 9) characterizes the rule of Edward Gierek (prosperity on credit, submission to the USSR, changes in the Constitution of the People's Republic of Poland in 1976);\n&gt; \n&gt; 10) characterizes the main manifestations of the opposition in Poland in the 1970s: The Catholic Church and the birth of the so-called democratic opposition after the 1976 workers' protests;\n&gt; \n&gt; 11) explains the significance for Poland and the world of the election of Cardinal Karol Wojtyla as Pope.\n&gt; \n&gt; \n&gt; V. The world and Poland in 1980-1991 The student:\n==\n&gt; 1) characterizes the changes in the programs of Western left and right-wing parties evident in the 1970s and 1980s, and the rise in popularity of free-market and conservative-liberal programs (\"new right,\" neoliberalism);\n&gt; \n&gt; 2) explains the significance of the victory of Margaret Thatcher in Great Britain (1979) and Ronald Reagan in the United States of America (1980) for East-West relations;\n&gt; \n&gt; 3) characterizes the main causes of the erosion of the communist system in the 1980s (internal flaws in the system, the \"revolution of the spirit\" behind the \"Iron Curtain\", the tough attitude of the West);\n&gt; \n&gt; 4) characterizes the changes taking place in China after the death of Mao Zedong (the rule of Deng Xiaoping and the beginning of \"state capitalism\");\n&gt; \n&gt; 6) presents the circumstances and consequences of the introduction of martial law by the authorities on December 13, 1981, the forms of struggle of the regime of the People's Republic of Poland against the freedom aspirations of the Poles (censorship, \"unknown perpetrators\", \"Wujek\" Coal Mine, Lubin 1982, the murder of Grzegorz Przemyk) and the forms of resistance of Poles against the martial law regime;\n&gt; \n&gt; 7) characterizes the role of the Catholic Church in Poland in the period after the introduction of martial law (help for all the persecuted, culture without censorship, masses in support of the homeland, the person of Blessed Fr. Jerzy Popiełuszko, the pilgrimage of St. John Paul II to Poland in 1983 and 1987);\n&gt; \n&gt; 8) characterizes the manifestations of the crisis of the communist system in Poland in the 1980s (economic inefficiency) and its consequences combined with the repressive policy of \"martial law\" (emigration of many educated and socially engaged Poles);\n&gt; \n&gt; 10) explains the concept of \"enfranchisement of the nomenklatura\" using the policy of Mieczyslaw Rakowski's government (1988-1989) as an example;\n&gt; \n&gt; 16) indicates what the \"transformation\" implemented in Poland after 1989 consisted of, using the example of the assumptions and implementation of the Sachs-Balcerowicz plan;\n&gt; \n&gt; \n&gt; VI. The world and Poland in 1991-2001 The student:\n==\n&gt; **1) characterizes the concept of the \"new world order\" (\"New World Order\") and gives examples of its functioning (the First Gulf War in 1990);**\n\n&gt; **4) explains the concept and various contexts of globalization;**\n&gt; \n&gt; 8) characterizes the main provisions of the Constitution of the Republic of Poland of April 2, 1997 (the preamble, the relationship between the most important organs of power, **the independence of the courts and the tri-division of power,** the rights and duties of a citizen of the Republic of Poland, **the Constitution concerning marriage and the family**);\n\n(that's pretty rich coming from the current government; [link](https://en.wikipedia.org/wiki/Polish_constitutional_crisis))\n\nautomod_multipart_lockme",
    "permalink": "/r/TheMotte/comments/vwbj4s/culture_war_roundup_for_the_week_of_july_11_2022/ifrq463/"
  },
  {
    "kind": "t1",
    "id": "ifqh42h",
    "author": "DuplexFields",
    "score": 1,
    "createdUtc": 1657554554,
    "body": "#My body, my choice\n\nThe left and the right have both recently used this slogan, and interestingly enough, have argued their points in almost exactly the same way down four levels of argument.\n\n**Abortion**\n\n- Left: When it comes to abortion, my body my choice. The government must respect my bodily autonomy and my right to make choices about my own body.\n- Right: But it’s not just about your body. There is a child developing inside of you who also has rights, and the government must respect their bodily autonomy too.\n- Left: It's not a real child, it doesn’t substantially have the ability to experience or think. Even ignoring my right to privacy, I have the right to avoid a life-changing nine month pregnancy which could see me dead or disabled because of it, and I would also be consenting to the onerous duty of having to raise and support the child for at least eighteen years, and in the case of an otherwise healthy child with Down Syndrome, in perpetuity.\n- Right: Well, how about adoption instead?\n\n**Vaccine**\n\n- Right: When it comes to the vaccine, my body my choice. The government must respect my bodily autonomy and my right to make choices about my own body.\n- Left: But it’s not just about your body. There is a community of people breathing around you who also have rights, and the government must respect their bodily autonomy too.\n- Right: It's not a real vaccine, it doesn’t substantially prevent transmission. Even ignoring my right to privacy, I have the right to avoid a life-changing shot which could see me dead or disabled because of it, and I would be consenting to the onerous duty of having to show the government and private companies my vaccine cards with all required boosters in perpetuity.\n- Left: Well, how about lockdowns instead?\n\nEDIT: Well, it looks like I found a nigh-perfect [scissor statement](https://slatestarcodex.com/2018/10/30/sort-by-controversial/). Although I have opinions on both topics, I was inspired to post this simply by how closely the arguments are mirrored.",
    "permalink": "/r/TheMotte/comments/vwbj4s/culture_war_roundup_for_the_week_of_july_11_2022/ifqh42h/"
  },
  {
    "kind": "t1",
    "id": "ifpphsh",
    "author": "Walterodim79",
    "score": 1,
    "createdUtc": 1657542002,
    "body": "We talked quite a bit about the quality of information in the media ecosystem and how that has intersected with science of questionable quality in the Covid universe, but today I want to highlight an example that's generally a bit further from the culture war. Over the weekend, my NYT digest pinged me with the now one year old wellness article *[Do We Really Need to Take 10,000 Steps a Day for Our Health?](https://archive.ph/Xq0Fv#selection-319.0-322.0)*. As someone that's immediately triggered by people looking for excuses to justify their sedentary lifestyles, I naturally clicked through for a quick rage-read (put aside for a moment how unhealthy *that* behavior is). So, what's the origin of the claim that fewer steps is actually fine?\n\n&gt;A 2019 study by Dr. Lee and her colleagues found that women in their 70s who managed as few as 4,400 steps a day reduced their risk of premature death by about 40 percent, compared to women completing 2,700 or fewer steps a day. The risks for early death continued to drop among the women walking more than 5,000 steps a day, but benefits plateaued at about 7,500 daily steps. In other words, older women who completed fewer than half of the mythic 10,000 daily steps tended to live substantially longer than those who covered even less ground.\n\nWait, *what*? How does this causal inference chain work? If you showed me [that study](https://archive.ph/3Xcuo), I'd think it's fine as far as it goes, but that the only thing that it really tells us is that elderly women that have dropped to as few as 2,700 steps are often pretty well on death's door, which is what I would have already expected. There's pretty much nothing I can draw from that regarding the value of moving more for young and middle-aged people. There definitely isn't anything strong enough to move me off the prior that moving more is almost always a good thing. I suppose I agree that there's no magic number and if there was, it'd be a hell of a coincidence that it happened to line up with a shiny, round number, but that's never really been the point anyway. Oh well though, she's not done citing evidence:\n\n&gt;Another, more expansive study last year of almost 5,000 middle-aged men and women of various ethnicities likewise found that 10,000 steps a day are not a requirement for longevity. In that study, people who walked for about 8,000 steps a day were half as likely to die prematurely from heart disease or any other cause as those who accumulated 4,000 steps a day. The statistical benefits of additional steps were slight, meaning it did not hurt people to amass more daily steps, up to and beyond the 10,000-steps mark. But the extra steps did not provide much additional protection against dying young, either.\n\nWell, that's a bit more encouraging, so [what does that study say](https://jamanetwork.com/journals/jama/article-abstract/2763292)? \n\n&gt;A total of 4840 participants (mean age, 56.8 years; 2435 [54%] women; 1732 [36%] individuals with obesity) wore accelerometers for a mean of 5.7 days for a mean of 14.4 hours per day. The mean number of steps per day was 9124. There were 1165 deaths over a mean 10.1 years of follow-up, including 406 CVD and 283 cancer deaths. The unadjusted incidence density for all-cause mortality was 76.7 per 1000 person-years (419 deaths) for the 655 individuals who took less than 4000 steps per day; 21.4 per 1000 person-years (488 deaths) for the 1727 individuals who took 4000 to 7999 steps per day; 6.9 per 1000 person-years (176 deaths) for the 1539 individuals who took 8000 to 11 999 steps per day; and 4.8 per 1000 person-years (82 deaths) for the 919 individuals who took at least 12 000 steps per day. Compared with taking 4000 steps per day, taking 8000 steps per day was associated with significantly lower all-cause mortality (HR, 0.49 [95% CI, 0.44-0.55]), as was taking 12 000 steps per day (HR, 0.35 [95% CI, 0.28-0.45]). Unadjusted incidence density for all-cause mortality by peak 30 cadence was 32.9 per 1000 person-years (406 deaths) for the 1080 individuals who took 18.5 to 56.0 steps per minute; 12.6 per 1000 person-years (207 deaths) for the 1153 individuals who took 56.1 to 69.2 steps per minute; 6.8 per 1000 person-years (124 deaths) for the 1074 individuals who took 69.3 to 82.8 steps per minute; and 5.3 per 1000 person-years (108 deaths) for the 1037 individuals who took 82.9 to 149.5 steps per minute. Greater step intensity was not significantly associated with lower mortality after adjustment for total steps per day (eg, highest vs lowest quartile of peak 30 cadence: HR, 0.90 [95% CI, 0.65-1.27]; P value for trend = .34).\n\nOK, this is actually pretty good. It's still more in the direction of predictive data than advice (IMO), but those differences are *really* large. We should be looking at that and describing dropping to 4,000 steps per day in middle age as an emergency, a strong predictor of impending doom. This doesn't necessarily provide advice for the young, but we can probably start drawing some inferences about just how bad it is to not move around much. Of note, the 12,000 step group actually did a decent bit better than the 8,000 step group; they have overlapping confidence intervals, so that's a weak conclusion, but I'd personally be inclined to take it as a suggestion that we don't really have any cap on the \"more is better\" line of thinking. What's the conclusion from our intrepid NYT reporter?\n\n&gt;The good news is that upping our current step counts by even a few thousand additional strides most days could be a reasonable, sufficient — and achievable — goal, Dr. Lee said. The formal physical activity guidelines issued by the United States and other governments use time, not steps, as a recommendation, and suggest we exercise for at least 150 minutes a week, or a half-hour most days, in addition to any moving around we do as part of our normal, daily lives. Translated into step counts, Dr. Lee said, that total would work out to a little more than 16,000 steps a week of exercise for most people, or about 2,000 to 3,000 steps most days. (Two thousand steps equal approximately a mile.) If, like many people, we currently take about 5,000 steps a day during the course of everyday activities like shopping and housework, adding the extra 2,000 to 3,000 steps would take us to a total of between 7,000 and 8,000 steps most days, which, Dr. Lee said, seems to be the step-count sweet spot.\n\nWait, *what*? How is that the \"sweet spot\"? Is this based on the idea that it's some unbearable suffering to go for a long walk? I'm just absolutely blown away that anyone would treat 10,000 steps as (implied above) unreasonable and unachievable. Just how low of a bar are we setting and why is that the tone that a NYT blogger wants to set for people?\n\nOn one level, I know I'm being petty, but I actually do think misunderstanding causality and failing to actually look at the data in a couple pretty simple papers highlights just how bad science and medical journalism is. It's not just politically charged topics like Covid and environmentalism, it's something as simple as, \"should people be advised to take more than 8,000 steps?\". When the writing is this bad on something that I wouldn't expect bias to creep in, I find that I'm unsurprised that it goes completely off the rails on topics where there's a tribal affiliation with morally good conclusions.",
    "permalink": "/r/TheMotte/comments/vwbj4s/culture_war_roundup_for_the_week_of_july_11_2022/ifpphsh/"
  }
]
