[
  {
    "kind": "t1",
    "id": "ib5guzz",
    "author": "Difficult_Ad_3879",
    "score": 1,
    "createdUtc": 1654354775,
    "body": "\nI came across a [news story](https://www.khou.com/article/news/crime/tomball-isd-family-killed-in-centerville-texas/285-ad1274ed-db15-4c2e-b2d0-54948156479c) that made me more upset than usual. An escaped convict, a cartel member, murdered five members of a family in Texas. Reasoning why this story hit me hard, I concluded that the crime I find significant is not the crime that is measured in graphs and figures. I think we’re measuring crime incorrectly and should be fighting crime differently. \n\nIn terms of the betterment of society, a criminal killing a well-adjusted citizen is worse than a criminal killing another criminal. Much crime in America is criminal-on-criminal. This should be modified a bit, because criminality is a spectrum, not a matter of violating the letter of the law. The person who spends his time hanging out with gang members, boosting their posts on social media, and egging on his friends to commit violence is less innocent than the well-adjusted citizen, and is also more *oriented* toward criminality, despite never violating the letter of the law. \n\nThe moral person endures pain and sacrifice to work towards the betterment of society, and the criminal does the opposite. The moral person feels the sting of long hours at work, the pangs of unfulfilled desire, and love for neighbor as he navigates life to make the world better. The criminal chooses violence and hate. A criminal killing an innocent moral person is worse for society than a criminal killing a criminal. And a criminal killing the criminally-inclined is better for society than a criminal killing the morally-inclined. Criminals are not the kinds of people we want in society to begin with.\n\nAnd so a criminal killing five members of a moral family is an egregious crime against society that we’re not able to really quantify and measure. We have no idea how prevalent the phenomena of “crime against innocents” is, whether this is increasing or decreasing. And we probably have disagreements over exactly how significant the life of an innocent is relative to that of a criminal. For instance, is a criminal killing an innocent *twice* as bad as criminal-on-criminal? Is it ten times as bad? 100? \n\nI want to propose a new value scheme for thinking about crime. The scheme is this:\n\n(1) the only crime worth caring about and deterring is criminal-on-innocent crime. The more innocent the victim, the worse the crime.\n\n(2) The criminally-inclined killing the criminally-inclined is not merely *less bad*, it’s actually *good*. We should be increasing the amount of criminals killing each other in society, other things being equally. \n\nWhile this last point comes off as edgy, I believe it would make the world better with limited drawback. There are ways to encourage criminals to kill each other without negative consequences. \n\nThe first way is an area of a city cordoned off, where criminals can commit violence with no legal repercussion. We already have de facto areas of cities like this, where police don’t patrol and where the solved homicide rate is perhaps 10%. I simply think this should be a legally-recognized expanded practice.\n\nThe second way is a national “battle royale” event for 16+ men with a prize pool of $40,000, something low enough to deter good and intelligent people, but high enough to encourage would-be criminals. In order to deter any accidental reinforcement of criminality in society, the event would be held without recordings. It can be advertised in high crime areas of the country.\n\nCriminality is a natural variation of human biodiversity. We will always have criminals, no matter the policies we instantiate. In the past, the violent-prone would be enjoying a life of killing in war parties, becoming state-sponsored pirates, dueling each other to the death and killing each other outside taverns.\n\nOur greatest hope should be to remove criminals from society as quickly as possible, with the least harm inflicted on innocents. Putting criminals behind bars is needlessly expensive, when we can simply permit them to kill each other in specified contexts. Who are we to say criminals shouldn’t live out their destiny anyway? [Hundreds of species](https://www.theatlantic.com/science/archive/2021/07/mammal-adulticide/619512/) kill each other, from bears and lions to primates and walruses. We would not suppose to hold court over nature, or presume that these animals should be barred from inflicting violence. So it is with violent humans. It makes sense to allow them to commit violence against each other, which cancels out the problem in a cost-efficient and self-selecting way. \n\nWhile the above is the most palatable version of my idea, I actually think we should go a step beyond and raise the battle royale prize pool while publicly televising the event. This would have the effect that, over consecutive generations, those who are the most *inherently deterred* from violence will be selected for in society. Those who want to commit violence, and who cannot reason about longterm gain, will be gradually filtered out of society. All of this would occur in a way that respects a person’s freedom and right to self-determination, so I don’t really see anything wrong with it morally.",
    "permalink": "/r/TheMotte/comments/v0trau/culture_war_roundup_for_the_week_of_may_30_2022/ib5guzz/"
  },
  {
    "kind": "t1",
    "id": "ib3mvbv",
    "author": "Doglatine",
    "score": 1,
    "createdUtc": 1654304385,
    "body": "**Some quick thoughts on value change**\n\nHi all, apologies for the absence etc., but just had a quick social observation I wanted to share. This evening I sent out invites to my birthday party to a bunch of friends. One of my friends (the wife of a barrister pal) asked me if we were enjoying the jubilee. I commented that my wife (from the Philippines) had eaten a bunch of scones already, to which my friend's wife replied \"oh, she's gone native!\"\n\nAt this point, my cheeks flushed a little. Why? After all, this was a wholly innocuous comment, and was in no way indicative of any colonialist feelings on the part of my friend's wife. It was entirely a matter of using a figure of speech in its appropriate context. And yet... the fact that my wife is from a South-Eastern Asian country, one that is often seen as \"primitive\" - this was why my cheeks had flushed. There was absolutely nothing wrong with the comment. However, I realised that ***I would never have said it myself***, lest I be seen as tacitly endorsing a worldview in which people like my wife were more appropriately accorded the label \"native\".\n\nI realise that in a certain normative sense, my cheeks \\*shouldn't\\* have flushed. But nonetheless they did, in much the same way they flush when I hear a colleague use the word \"niggardly\". It's irrational, but it reflects a realisation that there's an (unreasonable!) norm that I follow that my friend or colleague is violating. And that in itself is slightly damning for my friend or colleague, like failing to realise that the Port is passed to the Left these days, chum, or that the preferred term for the differently abled is \"differently abled\" rather than \"disabled\".\n\nAll of which gave me a clue into how norms-on-the-ground create... well, NORM-norms. Actual norms we feel we're bound by. I may not have thought there was anything untoward about what my friend's wife said, but I felt like she should have realised there might be, so shouldn't have said it; there was a subtle status-test there which she failed.\n\nI *hate* this, and genuinely wish I could choose not to impose on others norms which I repudiate myself, but I increasingly think it's not so easy or simple. Once we abide by a norm, and recognise that others are abiding or failing to abide by it, judgement inevitably follows. That judgement may initially be of the form \"oh, X failed to use the appropriate terminology\", but that quickly turns into \"X is low-status in this regard\" and in turn to \"X *shouldn't say that at all*.\"\n\nThis makes me more cautious about adopting norms-on-the-ground for the sake of politeness, insofar as it shows me how they can quickly turn into norms-of-society and thence into Norms full stop. Curious as to other's thoughts, though!",
    "permalink": "/r/TheMotte/comments/v0trau/culture_war_roundup_for_the_week_of_may_30_2022/ib3mvbv/"
  },
  {
    "kind": "t1",
    "id": "ib2espe",
    "author": "Vorpa-Glavo",
    "score": 14,
    "createdUtc": 1654281367,
    "body": "Recently, I've been listening to interviews with Alok Vaid-Menon, a non-binary advocate for the LGBT community. The two that are relevant here are [this one](https://www.aclu.org/bio/alok-vaid-menon) from the ACLU, and [this one](https://podcasts.apple.com/sn/podcast/alok-vaid-menon-does-your-soul-have-a-gender/id1566052074?i=1000545615735&amp;l=fr) from Metaphysical Milkshake.\n\nNow, throughout these interviews Alok makes a number of specific claims about the history of ideas surrounding gender non-conformity, as well as some arm-chair psychologizing of their opponents that I could pick apart or steelman, but I don't think there's as much value in that as tackling what I consider the central point of their advocacy: that the \"Western gender binary\" restricts people's freedom and autonomy, perpetuates unjust hierarchies, squashes people's natural spontaneity and playfulness around gender, and reduces people's self-expression, and that a world without gender (as well as other \"binary\" forms of thinking) would be better.\n\nI think the minimal, steelmanned description of \"the Western gender binary\" is something like: the set of societal expectations and rules that coerce or at least push men and women to act, dress and think in certain ways in places in the cultural sphere of the West.\n\nPut this minimal way, I think even if someone has issues with the whole concept of \"gender\" or thinks this discussion is poisoned by post-modernism and cloudy thinking, they could probably agree that the phrase has a real referrent. Even if the \"Western gender binary\" is far weaker than it was, say, 100 years ago, it's still considered notable and \"strange\" when men wear dresses and put on make up, and there are still particular ways both sexes are expected to act in certain contexts.\n\nI think it is trivially true that people would act in different ways in a society without a \"Western gender binary\", and that the \"Western gender binary\" restricts self-expression. However, are all form of societal coercion that \"restrict self-expression\" bad?\n\nI can think of several examples of arbitrary societal rules that only survive because some minimal level of coercion happens interpersonally that don't seem that bad to me.\n\n**Rules of etiquette**: Many etiquette rules are essentially arbitrary. There's no practical explanation for why walking through the mall flipping off people is bad, but going through the mall showing my pinky to people is just a bit strange and eccentric. Within the lingusitic-symbolic community of the anglophone West we decided that flipping someone off is a sign of anger and disrespect. Does this limit self-expression? Sort of. It limits the particular ways you can convey your ideas, the same way that the arbitrary decision to make the symbols \"dog\" refer to a specific animal limits the particular ways you can refer to things. But within these arbitrary limitations, a world of self-expression is still open to people. You just have to \"learn the language\" or accept that people are going to be confused when you try to use your middle finger to mean \"good day, sir\" and you use \"dog\" to mean \"rainbow.\"\n\n**\"Neutral\" Clothing Rules**: If I wear a robot costume in my day-to-day life, it is considered, at the very least, eccentric. Heck, I would probably have a lot of judgements and opinions of a stranger I met who always wore a robot costume in their everyday life. It is likely that a person who always wore robot costumes would be passed over for certain jobs, and might have trouble getting bank loans and the like. In a certain sense, it seems to me that society coercively punishes robot-costume-guy to a degree similar to many trans or gender non-conforming people, and yet my intuition says that the kind of societal coercion that robot-costume-guy is subjected to isn't \"unjust\", even if it is essentially arbitrary.\n\nOne reason to treat robot-costume-guy differently than GNC people might be some belief that gender non-conformance might be taken to generally be a deep expression of a person's identity, while few people in society consider it reasonable to treat the propensity to wear robot costumes this way. Liberal democracies already carve out a space for certain kinds of religious expression, out of a belief that a person's deep philosophical convictions are easier to \"work around\" than directly confront. The amish want to not be part of social security because of their deeply held religious beliefs? Sure, why not? We can make that compromise and avoid the headache of trying to coerce them to participate.\n\nPerhaps a similar argument could be made about gender non-conformity. It's too much of a headache trying to force everyone to dress and act in certain ways (be they legal or merely social and interpersonal.) So having a legal and social policy of \"tolerance\" and non-violence against non-conformists might represent a compromise for the sake of the experiment of Enlightenment philosophy and liberal society.\n\nI'll stop at those two examples for now.\n\nOverall, my main objections don't come from a specific place of defense of the \"Western gender binary.\" My main objection is more practical and pragmatic.\n\nI don't think it is possible to create a society where there is no arbitrary \"coercion\" of any kind, broadly defined. Humans are tribal animals, and there will always be people making in-group and out-group judgements based on arbitrary distinctions like clothing, behavior, and use of particular linguistic-symbolic signifiers within a culture.\n\nEven if we succesfully removed the \"Western gender binary\", we would still be driven to socially coerce people towards and away from particular lifestyles, hobbies, professions and forms of self-expression. I think that is fine as long as people aren't punished beyond some limit of violence.\n\nAs long as the coercion is in the form of \"softer\" persuassion and not direct violence or harm, I don't think it is bad or undesirable to have essentially arbitrary rules enforced by society.\n\nIf hypothetically corsets were as bad as Hollywood and pop culture said they were, and women were expected to wear them, that would be worth changing. But if women are expected to, say, wear the color pink, then I don't think that's necessarily a norm worth tearing down the gender binary for. How is it any different from the restriction against flipping off everyone around you?",
    "permalink": "/r/TheMotte/comments/v0trau/culture_war_roundup_for_the_week_of_may_30_2022/ib2espe/"
  },
  {
    "kind": "t1",
    "id": "ib0mxet",
    "author": "abb038c0-d21a",
    "score": 17,
    "createdUtc": 1654247742,
    "body": "*What do we really know about nurture?*\n\nSo modern social science tends to presume a blank slate hypothesis, that we know does not and can not hold in general. Thus, much research regarding nature vs nurture mistakenly concludes environmental factors (or even specific types of factors) as the cause of whatever correlations are observed, without considering the alternative hypothesis (inheritance).\n\nTo me, that such an elementary mistake is so common is sufficient to render the entire field suspect. Still, I think the issues studied are incredibly important, and I'm curious about how much of the 'commonly accepted wisdom' regarding nurture can actually be trusted. \n\nSome nurture-related hypotheses intuitively seem plausible to me, while some don't, but I really have no idea which ones we have solid evidence for (i.e. evidence obtained via twin studies or other experimental designs that control for inheritance).\n\nDoes anybody here know what the state of our knowledge is for the following hypotheses?\n\n- Do childhood traumatic experiences cause behavioral/emotional problems, or are both the experiences and problems caused by genetics (in parents and in children, respectively)?\n- Does fatherlessness cause behavioral/emotional problems, or are both the experiences and problems caused by genetics (in the father and child, respectively)?\n- Does bullying cause behavioral/emotional problems, or are both the bullying and emotional problems caused by genetics (in the person being bullied)?\n- Are children's home environments important for outcomes, or does genetics cause both nice home environments and good outcomes?\n- Does trauma cause behavioral/emotional problems in adults? All trauma and all adults, or in specific circumstances?\n- Do socioeconomic factors affect outcomes, or are both the outcomes and the socioeconomic factors causes by genetics?\n- Does education policy matter, or is a student's success determined by genetics? Which educational interventions work?\n- Does welfare lead to better outcomes (in general, and specifically lower crime rates)? Does it continue to do so once abject poverty has been eliminated?\n- Do non-welfare social programs (counseling, extra money to schools with problems, \"ex-con\" programs, etc) lead to better outcomes? If so, which programs and under which circumstances?\n- Do rehabilitation programs and softer sentencing reduce the recidivism rate? If so, under which circumstances?\n- Do integration policies (welfare, funding for civil society; especially for immigrants' religious/cultural practices) produce better outcomes for immigrants? Under which circumstances?\n\nI'm curious to hear if anybody here has any insight into any of these questions. Perhaps there's some common nurture-related wisdom I missed, for or against which against we have solid evidence?",
    "permalink": "/r/TheMotte/comments/v0trau/culture_war_roundup_for_the_week_of_may_30_2022/ib0mxet/"
  },
  {
    "kind": "t1",
    "id": "iazpa56",
    "author": "QuantumFreakonomics",
    "score": 33,
    "createdUtc": 1654224073,
    "body": "The long-awaited verdict in the Johnny Depp - Amber Heard defamation trial is in. Depp nets [8.3 million dollars](https://www.cnn.com/2022/06/01/entertainment/johnny-depp-amber-heard-verdict/index.html) in the final verdict.\n\nHere are the 3 statements from Amber Heard's [2018 Washington Post op-ed](https://www.washingtonpost.com/opinions/ive-seen-how-institutions-protect-men-accused-of-abuse-heres-what-we-can-do/2018/12/18/71fd876a-02ed-11e9-b5df-5d3874f1ac36_story.html) found to be defamatory:\n\n* *\"I spoke up against sexual violence – and faced our culture's wrath. That has to change.\"*\n\n* *“Then two years ago, I became a public figure representing domestic abuse, and I felt the full force of our culture’s wrath for women who speak out.”* (for context, [Heard first accused Depp of domestic violence in 2016](https://www.usatoday.com/story/life/people/2016/05/27/amber-heard-files-restraining-order-against-johnny-depp/85037132/))\n\n* *“I had the rare vantage point of seeing, in real time, how institutions protect men accused of abuse.”*\n\nNotice anything peculiar about these statements? They're all true. In fact, they're true even if Johnny Depp never abused Amber Heard at all. She did in fact \"speak out\" against sexual violence; she accused Depp of abuse in a court of law and got a restraining order. She was in fact a [\"public figure representing domestic abuse\"](https://www.tmz.com/2016/05/27/amber-heard-domestic-violence-johnny-depp-restraining-order/); there were tabloids with her [bruised face plastered on the cover.](https://images-na.ssl-images-amazon.com/images/I/719QfQuWVSL.jpg) She did in fact \"see how institutions protect men accused of abuse\"; Depp wasn't removed from the Fantastic Beasts series until [2020](https://variety.com/2020/film/news/johnny-depp-exhits-fantastic-beasts-franchise-1234824564/). Its as if the op-ed was written by a lawyer specifically to avoid making any false claims that could be considered defamatory if the allegations against Depp don't hold up, (probably because [it was](https://www.abajournal.com/news/article/aclu-lawyers-reviewed-op-ed-that-led-to-johnny-depp-defamation-claim-its-gc-testifies)). Its fascinating then that a judge let this case go to trial and a jury found Heard liable. \n\nA lot of this comes down to just how terribly Amber Heard came off on the stand. Frankly I would have expected a professional actress to do better. She lied about things like donating her divorce settlement to charity and leaking info to TMZ that don't actually matter much to the material facts of the case, but do make her seem like a pathological liar. I think the lesson to be learned from all this is that in the legal system, it matters a great deal how much the general public hates you. Precedent can not be relied upon across large changes in public opinion. You best start believing in kangaroo courts, [you're in one.](https://www.youtube.com/watch?v=4iOGeCLpAY0)",
    "permalink": "/r/TheMotte/comments/v0trau/culture_war_roundup_for_the_week_of_may_30_2022/iazpa56/"
  },
  {
    "kind": "t1",
    "id": "iay9ey3",
    "author": "[deleted]",
    "score": -22,
    "createdUtc": 1654199932,
    "body": "[removed]",
    "permalink": "/r/TheMotte/comments/v0trau/culture_war_roundup_for_the_week_of_may_30_2022/iay9ey3/"
  },
  {
    "kind": "t1",
    "id": "iaxlpgm",
    "author": "Lost_Martian_Expat",
    "score": -55,
    "createdUtc": 1654189852,
    "body": "The Modern Transgender Phenomenon and its Function\n\nMany people ask themselves how and why has a castration cult managed to gain so much power in the last decade?\n\nAfter gay marriage was legalized in the States, in the mid 2010s, all the progressive machinery needed a new cause to champion or the money, and purpose, dried up and they found a replacement for gays with transgenders and moved all the cultural infrastructure accordingly. \n\nThat's the how, but I believe the why is more important and interesting.\n\nI see the trans-debate as a way for power to differentiate between loyalists and dissenters: [\"Calling a deer a horse.\"](https://laowai-dawei.com/calling-a-deer-a-horse-%E6%8C%87%E9%B9%BF%E4%B8%BA%E9%A9%AC/)\n\n&gt;The second Qin emperor, Qin Er Shi who reigned from 221 to 206 B.C., had a prime minister named Zhao Gao.   \n\n&gt;Zhao Gao was very ambitious and had treasonous ambitions.   He wanted to attempt a coup of Qin Er Shi but didn’t know who in the Emperor’s court would go along with his plans.\n\n&gt;One day Zhao Gao presented the Emperor with a deer, but said it was a swift horse.\n\n&gt;“Prime Minister, you are clearly mistaken.  That is a deer.’\n\n&gt;Zhao Gao, prepared for this response replied, “If that is the case, Your Majesty, ask the member of your court what it is.”\n\n&gt;Some of the court remained quiet.   Some, knowing how treacherous Zhao Gao was, went along with his claim.   Others, called a spade a spade and told the Emperor it was a deer.\n\n&gt;Knowing who his allies were, those royal courtiers who said the animal was a deer were executed.  The cunning Zhao Gao knew who his allies were.\n\nThe idiom is used to describe a situation where “black” is called “white” and vice versa for the purpose of manipulating people to advance one’s evil agenda. \n\nThe greater [plain-faced lie](https://imgur.com/a/XUAJkGe) you repeat show just how willing you are to toe the party line.\n\nDoesn't the above all sound familiar? \n\nAnyone remember when Twitch elevated some insane troon named FerociouslySteph into a censorship csar position? Not only did he think he was a woman, he also [LARP as a deer](https://youtu.be/FVzE6ulTtck?t=83). \n\nTime is a flat fucking circle.",
    "permalink": "/r/TheMotte/comments/v0trau/culture_war_roundup_for_the_week_of_may_30_2022/iaxlpgm/"
  },
  {
    "kind": "t1",
    "id": "iaxhjqq",
    "author": "BenjaminHarvey",
    "score": 36,
    "createdUtc": 1654188104,
    "body": "[https://www.theguardian.com/world/2022/may/14/protests-nigeria-arrests-blasphemy-killing-female-student-sokoto](https://www.theguardian.com/world/2022/may/14/protests-nigeria-arrests-blasphemy-killing-female-student-sokoto)\n\nA young christian woman was lynched by muslim students at the college she went to, supposedly right before she was about to be taken into police protection. There are conflicting reports on what she was killed for, but it seems to be a social media post of some kind. In response, the Nigerian government has declared that the college she attended will be closed.\n\nAccording to this article there are dozens of lawyers rushing to defend the men accused of murdering her.\n\n[https://thenationonlineng.net/dozens-of-lawyers-to-the-defence-of-sokoto-killers/](https://thenationonlineng.net/dozens-of-lawyers-to-the-defence-of-sokoto-killers/)\n\nSome public figures in the country are supporting the murder. I don't understand the governmental structure of Nigeria, but I think the Imam in the article below might hold an official government position in Nigeria and not just a religious one.\n\nhttps://thenewsnigeria.com.ng/2022/05/22/the-apostate-grand-imam-maqari-must-be-removed-from-office-and-tried-soyinka/\n\nBesides improving the competency of the police tasked with protecting potential victims of mob violence, what would you do if you were a high-ranking Nigerian politician to fix your society? The only solution I can think of is to give up on multiculturalism and divorce the country. Or let Nigerian christians have their own cities with borders that they control. Neither solution seems that great to me.\n\nThe standard progressive response is to try to educate people, but I am pessimistic about such techniques. Propaganda campaigns of that sort are useful but I think people over-estimate them. I could go into why but I don't feel like it right now. I think most of you probably agree with me that those sorts of solutions are not super powerful.\n\nSo I ask you: what would you do?",
    "permalink": "/r/TheMotte/comments/v0trau/culture_war_roundup_for_the_week_of_may_30_2022/iaxhjqq/"
  },
  {
    "kind": "t1",
    "id": "iaxepcr",
    "author": "Stefferi",
    "score": 50,
    "createdUtc": 1654186899,
    "body": "I am not sure if this is CW Roundup material, but it did not feel like it should go elsewhere, so here it goes.\n\nHow many have been following the #Swedengate thing? It started with someone posting on Reddit (and this subsequently [screenshotted on Twitter](https://twitter.com/SamQari/status/1529868644846641153)) about how, as a child, they were not offered dinner when playing at their Swedish friend's place. This was then confirmed as a Swedish (and, to some degree, a general Nordic) custom by other posters. Much bewilderment and condemnation of the Swedish culture as a child-starving horror show has followed, by other Europeans as well as non-Europeans.\n\nI recognize the no-dinner custom from my own Finnish childhood, I do not recollect ever being offered dinner when at one of my friend's place or vice versa, or ever asking for it. Now, there is some confusion about the specific nature of \"dinner\". Even if there is no dinner, I do not remember like there is no food offered to guests \\*at all\\*, when people visit each other, there is going to be snacks or cake or whatever, even copious amounts of it. Perhaps the Swedes are different? In certain ways the Swedes are the most “Nordic” of all Nordics. At least if you consider how many non-Nordics see Nordics as prim, proper and quietly smugly arrogant, well, that’s how other Nordics see the Swedes.\n\nIt is obvious that at other places of the world, if there was a child of some other family playing at your place, they will get invited for dinner as a matter of course. Like with all “social norms,” it is not like they are uniformly observed by the entire society. Looking at local discussions, I have seen many people claim amazement over idea. It should be noted that within Finland, there seems to be an internal division between Eastern Finland and Western Finland, perhaps the main cultural regions of Finland (this division even shows in [Finnish genetics](https://www.fimm.fi/en/research/projects/finnpopgen)). I’m firmly from Eastern Finland, which is less like Sweden and more like the rest of the world, so maybe Westerners are more firm about not serving food to those outside family?\n\nIn the end, it all goes back to one of the strongest, yet often conscious, norms of Nordic life: it is shameful for an adult individual to be dependent on another individual, and it is shameful to make another adult individual dependent on you.\n\nThis norm leads to the peculiar Nordic idea of individualism meeting collectivism. Of course, the “individualism” part of this is obvious, one can fundamentally obviously see how this norm creates a society of strong individuals (and families). However, the collectivism aspect is that the same norm is a major building block of the welfare state. It is not OK to depend on another \\*individual\\* or make them dependent on you… but impersonal institutions are a whole another thing!\n\nEveryone needs a helping hand at times, and it is completely different, in this thinking, if the helping hand is provided by a community that you are a part of and contribute to, not a specific person. In the old times, the community would of course usually be your local village/town, or parish (often the same thing), and later strong societies were created around trade unions, which used to function in a manner not unlike a guild in the pre-welfare-state times, with extensive networks of mutual services, ranging from mutual funds to sports to newspapers and such.\n\nNowadays, the welfare state, usually conceptualized as an entire nation forming a similar community, serves the same role. The expectation is precisely that there is a social contract; when you can work and at your prime, you work hard, and in exchange the state provides the “safety net” for the times when you cannot do this. Debates on where the line goes between something being a legit utilization of this social contract and when it becomes mooching off the society – a cardinal sin – are extremely common in local political debates, and grist for the press.\n\nNow, I specifically mentioned “adults” here, and obviously children need adults to sustain them, and there is nothing wrong with it. However, the idea is then that it is specifically a family’s job to sustain their child. This then creates the second-order effects that are noted here; the other family feels uncomfortable giving a dinner to the child, since it might make the child’s parents feel like the other family is making them moochers. Likewise, the child themselves might refuse dinner, if offered – if they have already internalized the unconscious social norms behind all this.\n\nOnce one realizes that this is the norm, it is easy to see why certain other things separating the Nordic countries from others exist. For instance, when people go to bars, they buy their own drinks; buying rounds is rare, unless there is a special event (or you are drunk enough for norms to not matter). People on dates buy their own dinners. Tipping is almost non-existent. Domestic services are not utilized as much as they could be cleaning companies put up little notices on their home pages that you do not need to clean up before the cleaning person comes in.\n\nAdult children leave their parents’ homes as soon as they can after adulthood, and the adults practically push them out the nest. It’s probably also one of the reasons why feminism made such fast headway in the North – Nordic feminism has always been very much a movement oriented around getting women to work so they don’t have to be dependent on their husbands and other men. And so on.\n\nOf course, put it this way and it sounds like total moon logic, considering that the easiest thing to do would be just, you know, feeding the child. This all works out on an unconscious level, and that is one of the reasons these habits are on their way out. Other reasons would be the general “Europeanization” of Nordic cultures, as the EU has a habit of slowly grinding away the edges of all national cultures towards an undefined, bland and gray “European” ideal). Immigration also probably plays a role, my feeling from Twitter comments is that it is immigrant-background Swedes who feel the most strongly the tradition does not exist or that they have not encountered it.",
    "permalink": "/r/TheMotte/comments/v0trau/culture_war_roundup_for_the_week_of_may_30_2022/iaxepcr/"
  },
  {
    "kind": "t1",
    "id": "iax4pkx",
    "author": "Spectale",
    "score": 12,
    "createdUtc": 1654182621,
    "body": "I’m skeptical the court will actually overturn Roe. Now that the shock of the leak has passed, ruminating on it bit has dampened my expectations. The rather lackluster response by the left thus far also gives me the feeling I'll wake up one day and merely shrug at the news that the court didn't go so far as to break precedent for a social conservative cause. I can't bring myself to believe social conservatives have or can win until they actually do win.",
    "permalink": "/r/TheMotte/comments/v0trau/culture_war_roundup_for_the_week_of_may_30_2022/iax4pkx/"
  },
  {
    "kind": "t1",
    "id": "iatwl2r",
    "author": "mirror_truth",
    "score": 38,
    "createdUtc": 1654115666,
    "body": "We've all heard of shadow-banning, but have you heard of Reddit's new policy called \"Heaven Banning\"? Here's a screenshot of an article from the [NYT](https://pbs.twimg.com/media/FUMHLLxWYAM6xLe?format=jpg&amp;name=900x900) with some details. I hadn't heard about it till today.\n\nThat's unsurprising though, since if you look at the article's publication date, it won't be written for another 2 years. Here's the [source](https://twitter.com/nearcyan/status/1532076277947330561) for the image - a tweet with some more context.\n\nIn the current context of the recent mass-shootings in the US, this concept of 'heaven-banning' felt especially relevant. It's been noted by many people that one of the ways that young men are radicalized to the point they shoot up a school, or a church, or a shop it through online discussion forums. These forums offer young men a community of like-minded people that reinforce and enforce a cycle of despair and hate that can take root in some young men. Any voices that argue against it get drowned out and either leave the toxic community or get subsumed by it, until only the worst most toxic men remain to wallow in each other's pity. Until one decided to take out their rage on innocents. Then, if the community is located on a site with strong moderation, it gets sent to the shadowrealm, its constituent members presumably separated from each other. Until they, or others like them, gather somewhere else to begin the cycle again.\n\nBut what if instead of simply dispersing them, there were a way to quarantine them - without them even realizing it? Each member presented with their own slice of reality, filled with helpful 'friends' that could steer them back onto the straight and narrow? And without having to subject any real people to the toxicity inherent in those communities to do it.\n\nA few years ago, there was much handwringing over internet bubbles - the fragmentation of communities that could span a nation into fractal subgroups facilitated by the internet, where every time you looked closer, the more subdivisions you found. At least those bubbles were all filled with humans, however twisted they might be. The coming internet bubbles will come preloaded with zombies, ready to trap their unwitting victims into a fantasy in which they are the star.\n\nThen it's just a hop, skip and a jump to get to Samantha from Her and Joi from Blade Runner 2049. Made to order, a new pacifier for the next generation of male incels and losers - and maybe a solution to mass shootings. The zombies won't feel a thing, but their companions will.",
    "permalink": "/r/TheMotte/comments/v0trau/culture_war_roundup_for_the_week_of_may_30_2022/iatwl2r/"
  },
  {
    "kind": "t1",
    "id": "iasy9yh",
    "author": "Caseiopa5",
    "score": 25,
    "createdUtc": 1654101449,
    "body": "Might as well discuss this NYT article:\n\nhttps://www.nytimes.com/2022/06/01/technology/fringe-mainstream-social-media.html\n\nDiscusses the Buffalo shooter, but the main thesis, and the part we'll focus on, has to do with the great replacement theory:\n\n***\n\nAt the center of the shooting, like others before it, was a false conviction that an international Jewish conspiracy intends to supplant white voters with immigrants who will gradually take over political power in America.\n\nThe conspiracy, known as the “great replacement theory,” has roots reaching back at least to the czarist Russian antisemitic hoax called “The Protocols of the Elders of Zion,” which purported to be a Jewish plot to overtake Christianity in Europe.\n\nIt resurfaced more recently in the works of two French novelists, Jean Raspail and Renaud Camus, who, four decades apart, imagined waves of immigrants taking power in France. It was Mr. Camus, a socialist turned far-right populist, who popularized the term “le grand remplacement” in a novel by that name in 2011.\n\nMr. Gendron, according to the documents he posted, seemed to have read none of those; instead he attributed the “great replacement” notion to the online writings posted by the gunman who murdered 51 Muslims at two mosques in Christchurch, New Zealand, in 2019.\n\nAfter that attack, New Zealand’s prime minister, Jacinda Ardern, spearheaded an international pact, called the Christchurch Call, that saw government and major tech companies commit to eliminate terrorist and extremist content online. Though the agreement carried no legal penalties, the Trump administration refused to sign, citing the principle of free speech.\n\nMr. Gendron’s experience online shows that the writings and video clips associated with the Christchurch shooting remain available to inspire other acts of racially motivated violence. He referred to both repeatedly.\n\nThe Anti-Defamation League warned last year that the “great replacement” had moved from the fringes of white supremacist beliefs toward the mainstream, pointing to the chants of protesters at the 2017 “Unite the Right” rally in Charlottesville, Va., that erupted in violence and the commentaries of Tucker Carlson on Fox News.\n\n“Most of us don’t know the original story,” Mr. Ward of the Southern Poverty Law Center said. “What we know is the narrative, and the narrative of the great replacement theory has been credentialized by elected officials and personalities to such an extent that the origins of the story no longer need to be told. People are beginning to just understand it as if they might understand conventional wisdom. And that’s what is frightening.”\n\nFor all the efforts some major social media platforms have made to moderate content online, the algorithms they use — often meant to show users posts that they will read, watch and click — can accelerate the spread of disinformation and other harmful content.\n\nMedia Matters for America, a liberal-leaning nonprofit, said last month that its researchers found at least 50 ads on Facebook over the last two years promoting aspects of the “great replacement” and related themes. Many of the ads came from candidates for political office, even though the company, now known as Meta, announced in 2019 that it would bar white nationalist and white separatist content from Facebook and Instagram.\n\nThe organization’s researchers also found that 907 posts on the same themes on right-wing sites drew more 1.5 million engagements, far more than posts intended to debunk them.\n\nAlthough Mr. Gendron’s video of the shooting was removed from Twitch, it resurfaced on 4chan, even while he was still at the scene of the crime. The video has since spread to other fringe platforms like Gab and ultimately mainstream platforms like Twitter, Reddit and Facebook.\n\nThe advent of social media has in a fairly short period of time enabled nefarious ideas and conspiracies that once simmered in relative isolation to proliferate through society, bringing together people animated by hate, said Angelo Carusone, the president of Media Matters for America.\n\n“They’re not isolated anymore,” he said. “They’ve been connected.”\n\n***\n\nA couple points of interest:\n\n1. They paint it as a conspiracy theory, and repeatedly refer to it as such, by defining it as being attributed to the jews. This was not, for example, how tarrant (new zealand shooter) framed it, and is otherwise not a neccessary part of such theories. The attribution might be to a variety of things, and might not be a conspiracy theory at all. They track the propagation of adjacent theories to mainstream politicians on facebook. They fail to mention the exact rhetoric used  in facebook ads, but one suspects such ads avoid naming the jew. So the version used by these politicians might not have the part that makes it a conspiracy theory, or even false, at all. So point one is a discussion of the way the media uses dishonesty to reframe issues. And we might also reflect on how this leads to radicalization etc.\n\n2. Such theories are referred to here as being \"white supremacist\" and \"white nationalist\". This is more likely to be true of such theories in general. To what degree does that make them evil? We know, for example, that members of most ethnicities prefer to see the propagation of their ethnicity. We know, furthermore, that when an ethnicity is prevented from propagating itself, this is called genocide, and is one of the worst crimes imaginable. So, clearly we will accept white supremacy adjacent rhetoric in some cases. What specifically about use of such rhetoric by white people makes it evil? Point two thus discusses whether we should allow such rhetoric to exist, or ban it from major platforms.\n\n3. We might go a step farther, and question whether we should *necessarily* agree with such ideas. If, after all, every race (here defined in the old sense, as not being merely skin color) throughout history has been interested in its survival and success, shouldn't we take the hint that this is a good thing to care about? On the other hand, we modernists seem to be hedonists in the nth degree. What does it matter to us if we achieve anything besides pleasure and pain while living? Or perhaps we care about our \"race\", but we define our \"race\" as *american* (or whatever country you happen to be from). If white americans die out, but brown americans live on, this is hardly a concern for us. But how is the latter reasoning any more valid? Caring about people who happen to be citizens in the same territory as us is hardly more worthwhile than caring about people who happen to share our skin color. Thus, the third point concerns whether we ought to be white supremacists too.\n\n4. Perhaps the problem is specifically that without being a conspiracy theory, such theories are quite meaningless. After all, if the blame for the white race dying is... white people, then we can hardly claim that something evil is happening. Some people are choosing not to reproduce. Others are still having children. Killing a bunch of black people does nothing when the problem is white people. Killing white people would be... counter-productive. There are a slim few policy proposals for raising fertility rates, but none that I'm aware of have been shown effective. Mass shooter rarely propose them anyways. So this white supremacy, good or bad, is merely a dying breath, a swan song. The fourth point questions whether this specifically is why white supremacy is evil. \n\n5. To wrap things up, we might question the degree to which the media itself is complicit in the decline of white fertility. If the problem were well known, and furthermore was well established as *a problem*, people might reasonably choose to have more children to make up for the slack. Instead, organizations like the NYT choose to publish articles pretending it isn't happening at all, and arguing that anyone complaining about it is a white supremacist and thus evil. It seems like a major organization like the NYT could choose to turn the issue around, and yet they don't. So the fifth point concerns the role of the media and broader culture in producing this outcome.",
    "permalink": "/r/TheMotte/comments/v0trau/culture_war_roundup_for_the_week_of_may_30_2022/iasy9yh/"
  },
  {
    "kind": "t1",
    "id": "iaqq15l",
    "author": "kreuzguy",
    "score": 20,
    "createdUtc": 1654051872,
    "body": "Are we about to see another disastrous reaction to a potential epidemic? Monkeypox at this point looks very similar to covid at early stages, and instead of preparing to manufacture vaccines (which fortunately we already have) and offer them to populations at risk, health specialist seem to think that it can be controlled with \"safe sex\" measures. I mean, how naive can you be for putting the progress of a disease in the hands of horny people? God.",
    "permalink": "/r/TheMotte/comments/v0trau/culture_war_roundup_for_the_week_of_may_30_2022/iaqq15l/"
  },
  {
    "kind": "t1",
    "id": "iapfnja",
    "author": "i_like_big_mottes",
    "score": 49,
    "createdUtc": 1654030038,
    "body": "One subject that comes up frequently is the philosophy of r/fuckcars. This is a facet of the culture war that I find fascinating, and that also hits close to home. \n\nI have some unique insight, as I’ve spent the last four years traveling full-time with my family of six, essentially as a family of digital nomads. I've had the chance to experience everything from giant cities to tiny rural towns, and just about everything in between. I’ve lived in both the United States and Europe, and  I’ve spent a decent amount of time in each place we’ve experienced - meaning a month or more, beyond just living as a tourist for a week. We’ve had to buy groceries, do laundry, and get around using either a car or public transportation, just like we would if we lived there permanently.\n\nWe’re not going to be nomadic forever, so I’ve spent a lot of time thinking about what I’d like my future lifestyle to look like. Here are some things I think are important:\n\n* I’d like to get groceries for my family once or twice a week.\n* I’d like my kids to be able to go outside to play on their own terms, not when mom or dad can take the time away from their obligations to give them specially supervised outdoor time.\n* I’d like to visit my out-of-state siblings once or twice a year.\n* I’d like to get into nature 4-5 times per year, whether that’s hiking or camping or both. Some of these trips will involve bringing my kids.\n\nThese don’t come off to me as unreasonable or excessive, but they seem to be totally impossible in the ideal r/fuckcars world. Grocery shopping becomes wildly inconvenient, taking several times as long. Kids can’t go outside as they please. Long travel becomes extremely difficult, and long travel into nature becomes nearly impossible. \n\nI understand that having kids meant taking on extra work, and I made that trade willingly (and would do it again). I don’t expect society to bend over backwards to make my life easier, but any society that goes out of its way to make life more difficult for parents is only hurting itself in the long run.\n\nThere are a lot of use cases that fit cleanly into an ideal r/fuckcars world. If you’re a young white collar worker in a big city with lots of nightlife, or if you’re visiting one of those temporarily, that world would be amazing. But there are other use cases beyond parenting that don’t seem to have much of a place. What about people with physical disabilities? First responders? Ambulances? Fire trucks? Delivery trucks? Do those not exist in the r/fuckcars world? \n\nI think they do exist in that world, which means we’ll still need the exact same amount of infrastructure to support them. Maybe we can take a four line highway down to two lanes, or maybe we can get rid of a few parking lots (and granted, there's a lot of r/fuckcars hate for parking lots). But we’ll still need just as many miles of road, with every house accessible by car. And at that point, aren’t we really just determining who is and isn’t allowed to use that infrastructure?\n\nThe whole thing feels very much like a motte-and-bailey, with the motte being “Cars are loud and dirty and dangerous, fuck them” and the bailey being “Cars are loud and dirty and dangerous, fuck them, also everyone who has a different lifestyle than me.”",
    "permalink": "/r/TheMotte/comments/v0trau/culture_war_roundup_for_the_week_of_may_30_2022/iapfnja/"
  },
  {
    "kind": "t1",
    "id": "iaodwqd",
    "author": "Haroldbkny",
    "score": 24,
    "createdUtc": 1654013395,
    "body": "I was looking back at this old SSC article titled [Why Are Transgender People Immune To Optical Illusions](https://slatestarcodex.com/2017/06/28/why-are-transgender-people-immune-to-optical-illusions/), and I want to make sure I understand it. Is Scott saying that hormone therapy is a treatment for any disorder involving feelings of disassociation, or just those caused by gender dysphoria? Or is it simply not known?\n\nI'm wondering if the implication is that trans people have feelings of disassociation, and getting hormone injections help them feel better about that, simply because hormones help anyone have less feelings of disassociation. And then some people in the medical establishment took that and ran with it and said \"this proves that the trans person was really in the wrong body!\", even if it really just proves that hormones are a good treatment for feelings of disassociation. \n\nI think that Scott's article could read as indicating that (at least some) trans people simply have weird bodily feelings more often than other people, and then they get suggested or they come to the conclusion that it's because they're really born into the wrong sex, and they latch onto that idea, and then it just so happens that hormones also help cure that, so that reaffirms their conclusion. Am I reading that correctly, or are my own biases coming into play to draw certain conclusions?\n\nMy knowledge on this subject is next to zero. Could someone with better medical knowledge help me understand?",
    "permalink": "/r/TheMotte/comments/v0trau/culture_war_roundup_for_the_week_of_may_30_2022/iaodwqd/"
  },
  {
    "kind": "t1",
    "id": "iao602x",
    "author": "gamedori3",
    "score": 33,
    "createdUtc": 1654010014,
    "body": "Our Korean medical institution just posted an announcement informing staff of precautions to take (and symptoms to look for) related to monkeypox infection, and I would like to reflect on it here as it brought back very strong memories of the early days of Covid. \n\nFirst, about monkeypox. Monkeypox is a poxvirus (same family as smallpox, chickenpox) which is known to be transmissible by contact with bodily fluids and by contact with contaminated fabrics. The memorandum sent by my institution says that it is *suspected* to be transmissible by droplets. In this context, droplets are airborne particles larger than aerosols. While an N95 mask is generally required to control airborne infections, a paper surgical mask is generally sufficient when handling droplet infections. So, what does our institution recommend? \n\nThe official policy of our institution in the case of a verified case of monkeypox is patients who test positive for monkeypox to be kept in a negative-pressure room *with full airborne disease precautions*, and requires the attending medical staff to wear a **Level D suit with PAPR** (red underlined text in the original memo): a big white balloon suit, complete with air tank.\n\nMeanwhile, the CDC (in the US) has some recommendations of its own. The CDC's guide for [\"Infection Control: Healthcare Settings | Monkeypox\"](https://www.cdc.gov/poxvirus/monkeypox/clinicians/infection-control-healthcare.html) reads \n\n&gt; Activities that could resuspend dried material from lesions, e.g., use of portable fans, dry dusting, sweeping, or vacuuming should be avoided. ... A patient with suspected or confirmed monkeypox infection should be placed in a single-person room; special air handling is not required. The door should be kept closed (if safe to do so). The patient should have a dedicated bathroom. Transport and movement of the patient outside of the room should be limited to medically essential purposes. If the patient is transported outside of their room, they should use well-fitting source control  (e.g., medical mask) and have any exposed skin lesions covered with a sheet or gown.\n\nSo we have a tale of two responses. The US CDC gives an \"evidence-based\" response: poxviruses are not known to be transmissible in the air, and are known to be transmissible by bodily fluids. The US CDC would have us worry about contamination from skin lesions. Meanwhile, the Korean response is to apply the precautionary principle: droplet transmission has not been ruled out, so patients go in the negative pressure ward and doctors wear full biohazard suits.\n\nI think there's a cultural difference in this response to monkeypox. Part of this is that I remember the exact same dynamics in the our response to Covid: while public health professionals in the US were wringing their hands over how medical professionals wearing masks would cause patients to be irrationally afraid, our institution was sending out memos recommending that *all* staff wear N95 masks, even non-medical staff, and mandating Level D precautions for treatment of Covid patients (white paper biohazard suit with facemask and N95 but without the PAPR). I think this culture of precaution regarding emerging diseases was probably a major part of the reason that Seoul was able to control spread early in the Covid outbreak. The hospital response probably bought time to organize the testing-and-tracing program which was so successful (until Omicron and full vaccination shifted the cost/benefit ratio. The tracing program has now been wound down.)\n\nThe origin of this cultural difference was probably the [2015 outbreak of Middle East respiratory syndrome](https://en.wikipedia.org/wiki/2015_Middle_East_respiratory_syndrome_outbreak_in_South_Korea). During that outbreak 186 patients were infected, mostly via transmission within a few Seoul hospitals which were sloppy with infection control. Of these patients, 38 died. The response was a public outcry and renewed procedures for early outbreak response.\n\nI guess the moral of the story is that from 2015 to 2019, South Korea was able to form a rigorous epidemic response policy, whereas from 2019 to 2022 the US CDC seems to be sticking to strategies which cover their ass (\"evidence-based\"), but which are taking a gamble in the case that the disease is actually airborne.",
    "permalink": "/r/TheMotte/comments/v0trau/culture_war_roundup_for_the_week_of_may_30_2022/iao602x/"
  },
  {
    "kind": "t1",
    "id": "iamdvj4",
    "author": "FiveHourMarathon",
    "score": 43,
    "createdUtc": 1653966983,
    "body": "In honor of Memorial Day, and because I just finished Tooze's *The Deluge*, let's jump back to one of the great moments of \"Donald Trump get's in trouble for telling the truth.\"\n\n[Trump Faces Fallout From Report He Calls Military 'Suckers'](https://www.npr.org/2020/09/04/909599762/trump-faces-fallout-from-report-he-calls-military-losers-and-suckers)\n\nMerriam Webster defines a Sucker as (among other irrelevant things):\n\n&gt;: a person easily cheated or deceived\n\nBut there's an absent actor in the definition, who was the one who cheated them, who took advantage of their gullibility?\n\nThe reason the usual neoliberal suspects were offended by WWI war dead being called suckers wasn't the implication that the soldiers were stupid, it was the implication that their man Woodrow Wilson was the Con-Man in the exchange.  Which is just, objectively true. Woodrow Wilson really did con the country into a bad war, which lead to a worse peace, and an even worse war after that.\n\n[Wilson's slogan for the November 1916 Election was \"He Kept Us Out of War\"](https://www.whitehouse.gov/about-the-white-house/presidents/woodrow-wilson/). Wilson would lead the country *into* the war just five months later. If you assume that soldiers have a sacred duty to serve in a democracy because their actions represent the will of the people, well the people voted as close to a referendum against the war as we'd ever get, and we still got the war. Sounds like they got sold a bill of goods.\n\nBut ok, it was necessary for Wilson to go to war to \"make the world safe for Democracy.\" Well, just to look at some particular cases, [400,000 Black soldiers served in WWI](https://www.washingtonpost.com/news/retropolis/wp/2017/09/22/african-american-world-war-i-soldiers-served-at-a-time-racism-was-rampant-in-the-u-s/), and [225,000 Jewish Soldiers including 4 Medal of Honor recipients](https://nmajmh.org/stories/over-there-profiles-of-american-jews-in-world-wwi/) served as well. Well, after the war, when the League of Nations was being hammered out, [Japan proposed a Racial Equality Clause](https://en.wikipedia.org/wiki/Racial_Equality_Proposal), which the USA shot down for even *implying* that the races might be equal. It's not clear that Japan meant *all* the races, but the USA blanched at language that might even hint that they would need to treat Blacks as equal citizens. Black Americans would continue to be denied their right to vote in the democracy of their birth for years to come. Jews would face formal and informal discrimination throughout American society, and it wouldn't go so hot for them in Europe either. Sure seems like that's 600,000 soldiers who didn't get what they paid (some, the ultimate price) for.\n\nBut even giving him credit for what he was trying to do, Wilson lied to the American people, especially to those soldiers, because he never had the power to deliver a victory that would be worth the effort. [One of the great fifth grade English class works of American literature, *Where the Red Fern Grows*](https://docs.google.com/viewer?a=v&amp;pid=sites&amp;srcid=Z3JlZW52aWxsZXNjaG9vbHMudXN8bXItZXxneDo3ZTQ2YWQyZDFhZDBmYjUw) has a great scene where the protagonist's young hunting dogs get a raccoon up an enormous tree, and he despairs of being able to cut it down, and the dogs look at him as if to say:\n\n&gt;\"You told us to put one in a tree and you would do the rest.\"\n\nEven though his hands bleed from the ax, he cuts that enormous tree down and they get the raccoon. That's the bond between leader and follower: you do your part and I'll do mine. You put in the effort and make the sacrifices, and trust that I have a plan that will work.\n\nWell, the American Marines laying in Belleau Wood treed the German raccoon, and Wilson very much failed to do the rest. I'm sure we all know the sad story of Wilson being outmaneuvered by Clemenceau and George at Versailles, and winding up with a punitive treaty that destroyed the German state. Then with that pathetic treaty in hand, he couldn't get that obvious bad idea ratified by the Senate, leaving America with nothing. The net result of WWI, of the immense sacrifices made by thousands of American soldiers, was to set the stage for their sons to go back and fight an even more destructive war so they could hand half of Europe to Stalin. Because Wilson couldn't follow through, he couldn't do his part after the soldiers had secured victory and secure a durable, workable peace. That was the promise he made, implicitly, to American soldiers, and he didn't deliver; he defrauded them.\n\nSo this Memorial Day, let's recognize that so many of the brave men who thought they were dying for America were being fleeced out of their sacrifice, and let's recognize who the people doing the fleecing were, and let's recognize when their intellectual descendants are trying to fleece us again.",
    "permalink": "/r/TheMotte/comments/v0trau/culture_war_roundup_for_the_week_of_may_30_2022/iamdvj4/"
  },
  {
    "kind": "t1",
    "id": "iakxg59",
    "author": "Veqq",
    "score": 16,
    "createdUtc": 1653940435,
    "body": "A few months ago, there was a post in a roundup thread, about a conservative summit of different Latin American and European conservative parties. Could someone please guide me to it?\n\nedit: I found it: https://reddit.com/r/TheMotte/comments/qp8df4/culture_war_roundup_for_the_week_of_november_08/hkcpdw7/?context=999",
    "permalink": "/r/TheMotte/comments/v0trau/culture_war_roundup_for_the_week_of_may_30_2022/iakxg59/"
  },
  {
    "kind": "t1",
    "id": "iajkoec",
    "author": "f3zinker",
    "score": 22,
    "createdUtc": 1653918030,
    "body": "**Metastasizing Memes**. \n\n*Assumptions*: *The phenomenon I am talking about actually exists in sufficient levels and has the potential to materialize into some sort of cultural change.* \n\nI don't know if a specific term exists for this phenomenon. The phenomenon I am describing is when some event has some kind of primary meme but there are other supporting ideas/narratives/memes to prop up the primary meme as well. However, when the event is well and done with, sometimes the secondary memes can stay around and have the potential to 'metastasize' into malignant cultural notions.\n\nFor example the covid restrictions edifying meta-narrative had a lot of novel supportive ideas such as 'masks work','closing economies is a viable tool when handling disease outbreaks' or 'states mandating vaccines is well within the western social contract'. A few orders removed from covid one of them is '***[children are resilient](https://www.medscape.com/viewarticle/969604)***'. \n\nI am writing this because I think that one is one of the more underhanded the ideas that I see sticking around and am surprised that it caught on at all. I have recently seen this sentiment across multiple reddit threads on the topic of children and on top of this phrase being used explicitly, people just seem to have a less protective attitude towards children's mental health.\n\nI find this phrase especially irritating because its so nonsensical. Children are the least resilient of all classes of humans. They might be resilient on an absolute scale relative to how fragile we think they are, but saying 'X is Y' actually implies 'X is Y relative to Z' which is absolutely not the case. It seems to be a total 180 from which I see as the more correct analysis which happens to be the opposite of this statement, and was the majority sentiment in modern western culture pre-2020. Why not just say \"children are more resilient than we think\" if that was the intent?. The fact its a quip three word phrase with maximum ambiguity tells me its that way by design/memetics. \n\nNow one can argue that the prevalence and potential growth of this sentiment is a positive recorrection given that children are overly coddled in western and in particular American culture. \n\nHowever, I don't think it would pan out in the way most around these parts would want it to unfold. The usage of the phrase is used in cases where the mental health of children worsening is a tradeoff, not their physical health. \n\nIt's plenty evident that covid is a non physical threat for children but there was still plenty of sentiment to 'protect' children from covid, their mental health on the other hand was thrown on the wayside on policy considerations. \n\nOne can say society giving less credence to children's mental health is still a good thing because [too much of that gave us 'snowflakes'](https://www.thecoddling.com/) and there are a thousand other trends showing more care is given to children's mental health. Firstly I would say I don't think more care is actually given to mental health, a lot of it is just plain culture warring (hormone blockers, etc). However, that's a dead horse and popular sentiment around here, I won't flesh that out any further.\n\nSecondly, it would be amazing that if we could take people at their word for it but I don't think there is some sort of cultural awakening to the notion that you can over-coddle children, I think its a sign of something much more sinister. That when you need to REALLY engage in the culture war, the wellness of children can be given lesser weight as a potential tradeoff, it's not sacred, it's just another tradeoff you have to make or a tradeoff that you can collectively ignore.",
    "permalink": "/r/TheMotte/comments/v0trau/culture_war_roundup_for_the_week_of_may_30_2022/iajkoec/"
  },
  {
    "kind": "t1",
    "id": "iajjmfp",
    "author": "Amadanb",
    "score": 24,
    "createdUtc": 1653917467,
    "body": "**Semi-regular Ban Report**\n\nThree posts have been removed by AEO since the last report. Their methods and triggers remain opaque to us.\n\n**The Bans**\n\nMany ban evaders who subsequently deleted their accounts and drive-by brigaders and trolls are not included below. These usually get permabanned without ever unscreening their posts.\n\n/u/I_Dream_of_Outremer - [7 days](https://www.reddit.com/r/TheMotte/comments/uvtrc9/comment/ia6q8uq/?utm_source=share&amp;utm_medium=web2x&amp;context=3) - /u/Amadanb\n\n/u/Ame_Damnee - [1 day](https://www.reddit.com/r/TheMotte/comments/uvtrc9/comment/iafjphk/?utm_source=share&amp;utm_medium=web2x&amp;context=3) - /u/Amadanb\n\n/u/viking_ - [3 days](https://www.reddit.com/r/TheMotte/comments/uvtrc9/comment/i9w18sv/?utm_source=share&amp;utm_medium=web2x&amp;context=3) - /u/naraburns\n\n/u/motteposting - [7 days](https://www.reddit.com/r/TheMotte/comments/uvtrc9/comment/i9u3se7/?utm_source=share&amp;utm_medium=web2x&amp;context=3) - /u/naraburns\n\n/u/RedditDeservesNoHero - [permaban](https://www.reddit.com/r/TheMotte/comments/uvtrc9/comment/i9xiuoq/?utm_source=share&amp;utm_medium=web2x&amp;context=3) - /u/naraburns\n\n/u/forporn2021 - [permaban](https://www.reddit.com/r/TheMotte/comments/uvtrc9/comment/i9wle07/?utm_source=share&amp;utm_medium=web2x&amp;context=3) - /u/naraburns\n\n/u/solarity52 - [30 days](https://www.reddit.com/r/TheMotte/comments/uvtrc9/comment/i9tj3rd/?utm_source=share&amp;utm_medium=web2x&amp;context=3) - /u/naraburns\n\n/u/UMM_THATS_A_YIKES - [permaban](https://www.reddit.com/r/TheMotte/comments/uqp7z6/comment/i98c27p/?utm_source=share&amp;utm_medium=web2x&amp;context=3) - /u/Amadanb\n\n/u/tricksandcandlewicks - [30 days](https://www.reddit.com/r/TheMotte/comments/ulkqt8/comment/i8qvdpj/?utm_source=share&amp;utm_medium=web2x&amp;context=3) - /u/Amadanb\n\n/u/AndOnTheNthDay - [3 days](https://www.reddit.com/r/TheMotte/comments/ugj4f4/comment/i7veu8t/?utm_source=share&amp;utm_medium=web2x&amp;context=3) - /u/naraburns\n\n/u/doxylaminator/ - [90 days](https://www.reddit.com/r/TheMotte/comments/uim886/comment/i7vvp1m/?utm_source=share&amp;utm_medium=web2x&amp;context=3) - /u/naraburns",
    "permalink": "/r/TheMotte/comments/v0trau/culture_war_roundup_for_the_week_of_may_30_2022/iajjmfp/"
  },
  {
    "kind": "t1",
    "id": "iajark1",
    "author": "Smirking_Basilisk",
    "score": 45,
    "createdUtc": 1653912208,
    "body": "I found [these](https://old.reddit.com/r/TheMotte/comments/uqp7z6/culture_war_roundup_for_the_week_of_may_16_2022/i9sngso/) comments interesting, it seems some people have a hard time imagining tolerance or support without celebration.\n\nPerversion is like smoking tobacco. Not in every way (it might be partially innate, etc.) but in terms of how society should treat it. It's not without its charms, people should be free to do it in peace, to make art that depicts it positively, etc. and those that give smokers or perverts too much shit should be treated like the assholes, hypocrites and zealots that they are.\n\nOn the other hand, imagine if there were mandatory smoker's pride quasi-religious celebrations every other month, if movies required at least one chain smoker in the main cast and studies showing it to be bad for the lungs were taboo, if you couldn't speak in public without keeping up with smoker language and kids were groomed into it by preferentially hired smokers, if you were made to feel bad whenever you had a visceral reaction to smoke in your face or if smart, allegedly empathetic people told you that you're \"morally flawed\" for refusing to wear their flag.\n\nI suspect that those who view lack of celebration as hatred have a big overlap with those that want tobacco banned from movies or public places, and I wonder how do such people think about themselves? Do they think that everything they are is worthy of evangelism and celebration? Flip between that and scrupulosity?",
    "permalink": "/r/TheMotte/comments/v0trau/culture_war_roundup_for_the_week_of_may_30_2022/iajark1/"
  }
]
