[
  {
    "kind": "t1",
    "id": "ijidq33",
    "author": "rokosbasilica",
    "score": 1,
    "createdUtc": 1660002038,
    "body": "The FBI just [raided Mar A Lago](https://www.cnn.com/2022/08/08/politics/mar-a-lago-search-warrant-fbi-donald-trump/index.html) (Trump's home).\n\nThis doesn't seem quite *unbelievably* stupid, since, there is a lot of very stupid things that have already happened, so I can believe it, but...man this just seems like a really dumb thing to do.\n\nThere's no way this isn't a major step on an escalatory spiral.  What will the Republicans do to Biden when they regain power?",
    "permalink": "/r/TheMotte/comments/wj1cwt/culture_war_roundup_for_the_week_of_august_08_2022/ijidq33/"
  },
  {
    "kind": "t1",
    "id": "iji0yyw",
    "author": "SensitiveRaccoon7371",
    "score": 1,
    "createdUtc": 1659996696,
    "body": "A [new piece](https://www.newyorker.com/magazine/2022/08/15/inside-the-war-between-trump-and-his-generals) is making the rounds today on the war between Trump and his generals. Besides offering amusing vignettes such as:\n\n&gt;The President’s loud complaint to John Kelly one day was typical: “You fucking generals, why can’t you be like the German generals?”\n\n&gt;“Which generals?” Kelly asked.\n\n&gt;“The German generals in World War II,” Trump responded.\n\n&gt;“You do know that they tried to kill Hitler three times and almost pulled it off?” Kelly said.\n\n&gt;But, of course, Trump did not know that. “No, no, no, they were totally loyal to him,” the President replied. In his version of history, the generals of the Third Reich had been completely subservient to Hitler; this was the model he wanted for his military. Kelly told Trump that there were no such American generals, but the President was determined to test the proposition.\n\nand\n\n&gt;Milley had already spoken out publicly against the banning of transgender troops, which Trump was insisting on.\n\n&gt;“Mattis tells me you are weak on transgender,” Trump said.\n\n&gt;“No, I am not weak on transgender,” Milley replied. “I just don’t care who sleeps with who.”\n\nthe piece also raises all kinds of troubling questions on civil-military relations, the deep state and the extent to which elected officials (like Trump) can be constrained by unelected bureaucrats. According to it, Chairman of the Joint Chiefs Marc Milley led the \"Resistance\" (TM) inside the Pentagon:\n\n&gt;“Fuck that shit,” Milley told his staff. “I’ll just fight him.” The challenge, as he saw it, was to stop Trump from doing any more damage, while also acting in a way that was consistent with his obligation to carry out the orders of his Commander-in-Chief. Yet the Constitution offered no practical guide for a general faced with a rogue President. Never before since the position had been created, in 1949—or at least since Richard Nixon’s final days, in 1974—had a chairman of the Joint Chiefs encountered such a situation. “If they want to court-martial me, or put me in prison, have at it,” Milley told his staff. “But I will fight from the inside.”\n\nThe piece further outlines Milley's efforts to stymie any attempt by Trump to order the military to \"start an unnecessary war overseas\" or \"be used in the streets against the American people for the purpose of keeping Trump in power\". In particular, it refers to discussions about attacking Iran:\n\n&gt;Miller’s behavior did not look intentional so much as unhelpful to Milley, as Trump kept asking for alternatives, including an attack inside Iran on its ballistic-weapons sites. Milley explained that this would be an illegal preëmptive act: “If you attack the mainland of Iran, you will be starting a war.” During another clash with Trump’s more militant advisers, when Trump was not present, Milley was even more explicit. “If we do what you’re saying,” he said, “we are all going to be tried as war criminals in The Hague.”\n\n&gt;Trump often seemed more bluster than bite, and the Pentagon brass still believed that he did not want an all-out war, yet he continued pushing for a missile strike on Iran even after that November meeting. If Trump said it once, Milley told his staff, he said it a thousand times. “The thing he was most worried about was Iran,” a senior Biden adviser who spoke with Milley recalled. “Milley had had the experience more than once of having to walk the President off the ledge when it came to retaliating.”\n\n&gt;The biggest fear was that Iran would provoke Trump, and, using an array of diplomatic and military channels, American officials warned the Iranians not to exploit the volatile domestic situation in the U.S. \n\nSeems quite shocking that American officials would engage in back-channel communications with the Iranians to frustrate their own commander-in-chief. The piece details other efforts by Milley to slow-walk Trump's orders and while the authors justify it by saying he considered them unlawful it seems more appropriate to say that he considered them ill-thought-through and disagreed with them. Which raises the question of whether he should've resigned if he felt unable to carry out his duties due to differences of opinion with the president. But the piece explains that he considered resigning but instead chose to stay on the inside to \"fight back\" against the president. When presented in such a way, his behavior may be viewed troubling, bordering on insubordinate.\n\nAnother question raised is the role of the process. The article alleges that Trump ordered an immediate withdrawal from Afghanistan and Somalia without consulting the chairman of the joint chiefs. Milley refused to carry out the order and instead assembled like-minded advisors and went to the White House to convince Trump to walk it back. Are the POTUS' orders legitimate because they come from the president or because they went through the institutionalized process of formulating them? Even though abstractly it's the former, in the real world it is the process that seems to legitimize the orders. This has interesting implications in all kinds of areas, from democratic governance (is it enough to disrupt the process as on Jan 6 to stop democracy from functioning?) to medical treatments (can we short-circuit the FDA approval process to bring drugs into use faster?).",
    "permalink": "/r/TheMotte/comments/wj1cwt/culture_war_roundup_for_the_week_of_august_08_2022/iji0yyw/"
  },
  {
    "kind": "t1",
    "id": "ijh7epp",
    "author": "Sorie_K",
    "score": 1,
    "createdUtc": 1659985011,
    "body": "This is an entry in the Collaborative Analysis of the Inflation Reduction Act, where u/xablor, u/_netstack and I all picked a different section of the bill to drill into in depth. We’re posting everything as top levels here so everyone sees them, but later you can also see all of the fleshed out entries together at the bottom of [this thread](https://old.reddit.com/r/TheMotte/comments/wc7x7s/collaborative_analysis_of_the_inflation_reduction/). Thanks to u/xablor for coming up with the idea to do this and for setting up the whole collaborative analysis.  My section is taxes.\n\n**PART 1—CORPORATE TAX REFORM**\n\nThe corporate tax in the Inflation Reduction Act announces a new tax of 15% on book income, so your earnings prior to taxes, deductions, etc.  Basically, if the 15% tax on book income is higher than what they a corporation owes on their normal taxes, then that corporation has to add the difference between the two amounts on their tax bill and pay the total sum.  The idea here is to target corporations which are paying little to no taxes because of loopholes.\n\nHowever, this only applies to corporations that have had $1 billion in taxabale income (averaged across the previous three years, unless the company has existed for less than three years, then averaged across however long they have been around).  These corporations can almost be exempt if they are experiencing a change in ownership, or if they had a certain number of (as yet undetermined) consecutive years earning below $1 billion, or if the Secretary of the Treasury feels like it.  Taxes are also levied on global income, so as to account for base erosion, the process of shifting profits from your high tax home country to a subsidiary or parent in a low tax foreign country. This is similar-ish to the way Trump’s Base Erosion and Tax proposal implemented an alternative minimum tax on global income.\n\nFor a [critical perspective](https://taxfoundation.org/inflation-reduction-act/), the conservative Tax Foundation argues “The proposed 15 percent minimum tax on corporate book income is the most economically damaging provision in the bill, reducing GDP by 0.1 percent and costing about 23,000 jobs\".  Another [article of theirs](https://taxfoundation.org/biden-corporate-income-tax-rate/) gives a good explanation of the problems of taxing book income.  There might be good reasons why taxable income is lower (or higher) than book income, because of depreciation of tangible investments, because of stock options, because of net operating losses being carried forward – all of which might actually be reasonable and shouldn’t be penalized. The Tax Foundation [offers a more specific breakdown](https://taxfoundation.org/book-minimum-tax-analysis/) of which industries would be affected the most.  Supposedly real estate is number one followed by minining, mostly because they make significant use of depreciation.\n\nAll of this makes sense but again, though, this is only a tax on (certain) corporations making over a billion dollars.  In other words, at its most inefficient this tax will only affect at most 135 of the over 6 million companies registered in the US.  Even if all of their caveats are correct, will the tax really have such wide-ranging distortionary affects for the whole economy when its targeted at such a tiny minority of extremely profitable companies?  Would those negative effects outweigh the $313 billion in new revenue and deficit reduction?\n\nOne reason to justify being a little nervous is that the liberal Tax Policy Center [is also skeptical](https://www.taxpolicycenter.org/taxvox/book-minimum-tax-may-discourage-investment-more-rate-hike) about taxing book income rather just raising the ordinary corporate tax for the same reasons. They also point out that while the tax would only hit 300 companies (double my findings but who’s counting), those companies account for about 60% of all capital so if the tax disincentivizes investment the effects could be large.\n\nHowever, [they take issue](https://www.taxpolicycenter.org/taxvox/putting-jcts-score-inflation-reduction-act-context) with the Tax Foundation's broad analysis and projections of the IRA, arguing that their assessment fails to take into the ameliorative affects of other tax credits.  As for the corporate tax, the point to a substantial body of research indicating that now up to 60% of corporate profits are estimated to be “supernormal,” ie profits beyond what you would normally expect that are made possible by rent seeking, patents, specialized expertise, economies of scale, luck, etc. ([1](https://home.treasury.gov/system/files/131/WP-116.pdf), [2](https://www.journals.uchicago.edu/doi/abs/10.17310/ntj.2016.4.05), [3](https://www.journals.uchicago.edu/doi/abs/10.17310/ntj.2013.1.09) \\- note that the the sources here are the US Treasury and researchers from the famously non-leftist U Chicago). As long as the new tax is lower than 100% of excess profit, it shouldn’t really impact investment and hiring, at least according to the [Congressional Research Service](https://sgp.fas.org/crs/misc/RL34229.pdf) and my understanding of mainstream thinking on the issue (it’s possible I totally misunderstand this).  Furthermore, they [point to growing evidence](https://www.taxpolicycenter.org/taxvox/rethinking-incidence-corporate-income-tax) that the corporate tax is more progressive than once thought, landing more on the capitalists than on the laborers.\n\nThe Tax Foundation seems to basically agree with this – they don’t use the most liberal estimates you can find but they assume that 75% of the burden will fall on capitalists and 25% on laborers.  Tax Policy Center counsels further that the “laborer” category still hides significant progressivity because significant research ([1](https://www.taxpolicycenter.org/publications/rethinking-corporate-income-tax-role-rent-sharing/full), [2](https://www.piie.com/publications/working-papers/slower-productivity-and-higher-inequality-are-they-related), [3](https://www.jstor.org/stable/2586870), [4](https://www.aeaweb.org/articles?id=10.1257/089533003769204362)) shows that growing shares of profits are now shared as income with top managers and executives, who are still counted as laborers in this context.  The corollary is that the incidence of the corporate tax that lands on labor is still fairly progressive, landing the highest on these high earners.  For more specific numbers on how this affects the tax incidence you can check these sources ([1](https://ericohrn.sites.grinnell.edu/files/exec_comp/ohrn_tax_breaks_exec_comp_2021_2.pdf%20%20https://www.federalreserve.gov/econres/feds/corporate-taxes-and-the-earnings-distribution-effects-of-the-domestic-production-activities-deduction.htm), [2](https://www.sciencedirect.com/science/article/pii/S0047272721002139), [3](https://academic.oup.com/qje/article-abstract/134/3/1343/5420483?redirectedFrom=fulltext), [4](https://www.nber.org/system/files/working_papers/w24598/w24598.pdf)):\n\n&gt;“A study by Eric Ohrn of Grinnell College shows that the five highest-paid executives at the studied firms reaped between 17 and 25 percent of some recent corporate income tax cuts – including changes in depreciation rules and subsidies for domestic production.  \n&gt;  \n&gt;Economists at the Federal Reserve Board and the congressional Joint Committee on Taxation found the highest-paid 1 percent of employees reaped 40 percent of the benefits of a corporate tax cut. An additional 19 percent of the benefits of that tax cut went to the highest paid 2 percent to 10 percent of employees.”\n\nAfter you adjust for executive compensation being counted in the labor category, and for them bearing a vastly disproportionate amount of labor tax incidence, it upturns the Tax Foundation’s assessment that this would “raise taxes on all brackets” and confines the hike to the upper end of the scale.\n\nWhere I think this leaves us is that there’s general agreement that a normal corporate tax raise would be preferable than a book income tax in terms of efficiency and distortion.  However, given that this will target a small number of firms receiving excess profits from rent seeking, it’s hard to say how much this will really impact investment and hiring, if at all, and the tax incidence is almost certain to be progressive and to be born mostly by capitalists and the C suite.\n\nautomod\\_multipart\\_lockme",
    "permalink": "/r/TheMotte/comments/wj1cwt/culture_war_roundup_for_the_week_of_august_08_2022/ijh7epp/"
  },
  {
    "kind": "t1",
    "id": "ijh79rt",
    "author": "gattsuru",
    "score": 1,
    "createdUtc": 1659984959,
    "body": "Minecraft's 1.19 patch has released, and among the normal fun of programmer hell that is the Forge/Fabric/Quilt updates, there's also been a more [conventional culture war aspect](https://www.pcgamer.com/minecraft-players-are-in-an-uproar-over-its-new-reporting-system-but-mojang-wont-back-down/): \n\n&gt; Minecraft players have been up in arms about the new player reporting system since it was announced a month ago, but it was finally implemented as part of yesterday's 1.19.1 update. It allows players on both private and Mojang-hosted multiplayer servers to flag inappropriate messages in chat for review by Mojang investigators, potentially resulting in suspensions and bans for players that violate Minecraft's community guidelines even on self-hosted servers. Fans are worried that the system will result in player bans for messages taken out of context, and more broadly that it gives Microsoft too much power to dictate the content of discussions on its platform.\n\nMore details from Mojang (aka Microsoft) [here](https://help.minecraft.net/hc/en-us/articles/7317376541197), or a more technical breakdown of an earlier implementation from the weekly builds [here](http://web.archive.org/web/20220630085634/https://blog.bithole.dev/mc-report.html).\n\nFor those unfamiliar with the game's online mode, Minecraft (way back in 2009) originally focused on privately-run servers, and while there's a subscription service for company-run Realms servers (starting in 2013, before the Microsoft buyout), and a small industry of third-party management tools, some [better](https://chs.gg/) and some worse, but either way, the majority of servers are effectively managed by non-Mojang and non-Microsoft employees.  People playing on such machines only interface directly with Microsoft services to login and to download updates (and, uh, for everything in Windows).\n\nMost of these servers are _small_.  It's theoretically possible to run a 'large' server or server cluster -- [HyPixel's count is famously high](https://hypixel.krashnz.com/) -- but this usually involves some combination of throwing obscene amounts of RAM at the problem, using an extremely customized version of the server, and/or [clustering approaches](https://velocitypowered.com/wiki).  For a single dedicated server machine or even mid-end cloud instance, it's very hard to scale past ~200 simultaneous users: modded environments tend to struggle badly in the [~100](https://twitter.com/CuriousCalamari/status/1535364691488395266) users range, and the most recent BlanketCon (a modder convention server focused on a higher-performance culture war split called Quilt that derived from the high-performance internal-frustration split called Fabric) [managed to get a workable server to 170 concurrent players](https://hackmd.io/@LemmaEOF/blanketcon-22-postmortem#Performance-Performance-Performance) by live-patching out stuff like Achievements.  Most servers more likely run 5-40 concurrent players, usually favoring the low end.\n\nRunning a server is balancing act beyond the technical aspects.  Even without mods or PvP, it's trivially easy for a bad actor to grief other players at least some of the time, and even well-meaning players can unintentionally create lag bombs or overflow NBT.  And people are people, for better or worse.  In turn, server operators are dictators by nature; there is little appeal past whoever controls the electrical bill or the file system, and it's historically be constrained to the sort of thing that involve the FBI.\n\nWhich runs into some complications, when you're talking about a game a) is at least somewhat marketed toward kids, b) [that supports chat and a nearly-unfettered voxel sandbox](https://twitter.com/glassbottommeg/status/604411327583375361), c) has or had prominent cultural trends toward [anti-censorship](https://www.uncensoredlibrary.com/en).  Not _new_ problems -- kids wandering unobserved into the wrong IRC channel, PHPbb or USENET/BBC are stories nearly as old as the internet themselves, and [inspirations behind federal legislation](https://en.wikipedia.org/wiki/Children%27s_Online_Privacy_Protection_Act) older than Java 1.2 -- but ones somewhat more prominent when the majority of the children in the country play the game.So there's [definitely](https://twitter.com/politicalmath/status/1391282599046238208) a [problem](https://twitter.com/mattcarriere/status/1391290583486922757) that this is [pointed](https://twitter.com/gigaherz/status/1553076537179660288) at solving, or at least helping solve.\n\nBut there are some tradeoffs.  There are some technical efforts built into the system to avoid or at least reduce manipulation, but ultimately this is a field where not just one client, but also the server and the other client may be in the hands of the enemy -- early attempts to manipulate it are [allegedly failed](https://twitter.com/Minecraft/status/1553077938639085568), but I'm somewhat skeptical that it's totally bulletproof and the rapid release of a couple patches hasn't encouraged people.  Even with the system working perfectly at a mechanical and code level, there's also just a more fundamental problem when moderation runs into culture: \"\"Is Queer A Slur\" - the greatest thread in the history of forums, locked by a moderator after 12,239 pages of heated debate,\".    There's also not a lot of trust of Microsoft, here.  The migration from Mojang to Microsoft accounts famously, in the modded community, [booted one Forge dev out for over four months](https://twitter.com/voxcpw/status/1489695958925463555).  Xbox's general moderation capabilities are not exactly held in high regard, either, and it's pretty easy to imagine that the typical server maintainer does a better job.\n\nWorse, there's reason to think it may not stop at this particular limit.  The [ADL](https://www.adl.org/resources/report/breaking-building-blocks-hate-case-study-minecraft-servers) has a oft-linked study on Minecraft moderation on the largest server clusters, and somewhat interestingly there's not very much overlap between what it's worried about, and what the new reporting system focuses on.  That [glassbottommeg](https://twitter.com/glassbottommeg/status/604411327583375361) thread wondering how Minecraft hasn't resulted in a bunch of lawsuits?  It's also about content that isn't reportable, here.  The central example where a server op might be an abuser?  Possibly handled... if the victim realizes it, and reports something that's obvious enough.  It's not clear how well this fixes or even seriously slows the underlying motivations and concerns, in the long run, in short.\n\nWorse, this handles the _difficult_ technical problems: while not a perfect solution to the questions of authenticity of messages only viewed by three untrusted parties, it's a good enough one for Microsoft to have shipped it.  Expanding this system to upload different data, or without user intervention, isn't as simple as a boolean tweak, but it's not deeply complicated.\n\nThat's not to say it _will_ go wrong, or go further.  I'm hope I'm just being paranoid, and outside a small number of cases for stuff that would otherwise end up involving the FBI we never hear about it again.  But that's a hope.\n\nThere's a temptation to label this by the normal Culture War assumptions, where _obviously_ Red Tribers would oppose the new system, and Blue Tribers would support it.  And you can find _some_ of that, whether genuine or primed by the coverage, and whether pogger-faced unverifiable claims on YouTube or hyperbolic comparisons to Gamergate (yes, really) on Discord.\n\nBut there's also people on the Quilt Discord, a place defined in no small part by its Culture War split from a different modloader, pondering about the ramifications when someone reports certain feelings about the international status of Hong Kong.  Or that, given the weaponization of concerns about child abuse applied to even the most of LGBT-related topics, that perhaps this is not a great tool to be passing to the XBox Live Moderation Staff.  Which isn't a _huge_ surprise; I've posted before about tech censorship [aimed at VioletBlue](https://www.reddit.com/r/CultureWarRoundup/comments/b7ycv5/offtopic_and_loweffort_cw_thread_for_the_week_of/ejwyhxf/?context=999) who then used that [as examples of what should be aimed at her _opponents_](https://twitter.com/violetblue/status/1112878491588939776), but it's worth pointing out none-the-less.((And, on the other side, it's not like PoliticalMath is going to share VioletBlue's perspective on what is acceptable discussion matter [when young adults are in the room](https://twitter.com/politicalmath/status/1523840050122870789).  There are people with principles, but you'd give Diogenes a run for his money looking for 'em.))\n\nSo... I dunno.\n\nThe deeper melancholy is more about the general case.  Minecraft hits particularly had because it's Microsoft's Mojang (2 billion served!) on one side and Your Personal Server (2/10 active players) on the other, but that isn't exactly unique.  Everyone knows that anything happening on Discord is between you, everyone else on the server, Discord Inc, and [the inevitable leaks](https://twitter.com/hradzka/status/1116502891689172993), but it's not like the motivations for Minecraft here will care that you're running your own RocketChat or Matrix instance; they're just smaller and haven't gotten the same attention.\n\nFor now.\n\nIt's not like this is new grounds in a framework where private or small-community utterances can end up sliced and diced by faceless team of reviewers by metrics you can't understand or contest.  It's not even particularly extreme as such goes.  But now it feels increasingly like the result people want, rather than some accidental end-point.",
    "permalink": "/r/TheMotte/comments/wj1cwt/culture_war_roundup_for_the_week_of_august_08_2022/ijh79rt/"
  },
  {
    "kind": "t1",
    "id": "ijgvwjj",
    "author": "dblackdrake",
    "score": 1,
    "createdUtc": 1659980674,
    "body": "Ukraine Update time: Shit's still pretty much the same as last week, no major movement. \n\nUkraine continues to do really well with HIMARS shoot and scoot, but they are feeling that 227mm, and we (the US) are laggin with the 610mm ATACMS, apparently because it can reach pretty deep into Russia and we don't want to hear about Ukraine doing a little whoopsy and atomizing a square block of Kursk or something.\n\nThe pocket from before is getting worse and more secure at the same time, with lots and lots of dudes there now (unconfirmed reports of 25000 with one unchallenged route out and in); this is scary if you are  a troop and need to eat, but also means that Ukraine can't just muscle their way in, so ???\n\nFrom the russian end:\n\nA whole bunch of Russian command has been returned to the earth, and a bunch more were recently dismissed for being fucking idiots; this is causing some problems in the short run but might be good for them in the long run, these dudes were obviously not performing super well. It depends if they have anyone competent waiting in the wings who was being help back by office politics. \n\nRussia is not decreasing their tempo on missile attacks as people have predicted, but are ramping down their use of the good shit. Iskander  and kalibr attacks are down but still exceed rate of replacement, and attacks using soviet era missiles are way up, probably to retain a strategic stockpile of modern missiles incase anything does wrong/ they need them elsewhere.\n\nFinally, Russians are playing a fun game where they park artillery near nuclear plants/ Shell near nuclear plants. This isn't world ending shit and it won't effect anyone outside the immediate radius of the plants (and probably not even them), but it is happening and it is like 50 degrees off from the plot of a shitty techno thriller, so that's exciting!",
    "permalink": "/r/TheMotte/comments/wj1cwt/culture_war_roundup_for_the_week_of_august_08_2022/ijgvwjj/"
  },
  {
    "kind": "t1",
    "id": "ijghq0p",
    "author": "crushedoranges",
    "score": 1,
    "createdUtc": 1659975340,
    "body": "I play a game called Final Fantasy 14. I've been wanting to write a post about the latest expansion, Endwalker, but in the interests of avoiding spoilers I've been keeping it off, but at the eight-month mark I feel safe enough to write about it. \n\n(Warning: this contains copious amounts of spoilers. If you have any desire to actually play the game, I'd skip this post.) \n\nIn the setting of the game, there exists a precursor civilization known as the Amaurotines (named after the titular city of Amaurot). The inhabitants specialize in the magic of creation: and not only that, their souls are so strong in the energy of aether that their capacity could be said to be godlike. \n\nNeedless to say, a species of human beings that can create anything with a thought can be said to be firmly in the post-scarcity side of the civilization tree. \n\nBut not only can they create material possessions, like clothing, but they can also create life. It is treated as a serious enough matter to be somewhat centralized. Concepts of life must be throughly audited and assessed by your peers before their publication to the population at large.\n\nThe lives of these people are endless and death is something they chose. When they have tired of life, they return themselves to the star by dissolving their constituent anther, and return to the planet seeking a new, unclouded perspective.  \n\nAnd from the textual evidence, the society is both egalitarian and meritocratic. There is no material inequality, and the leadership is chosen by respect and ability. But being a precursor society, their downfall is already written into the story. What sort of cataclysm could cause this perfect society to be destroyed? \n\nThe root cause, as the game suggests, is their society's indifference to death and their ignorance of suffering. Not that they are naive, or thoughtless, but the society as a whole lacks the ability to cope with such things. Having the ability to create life, they do not hold it in such religious sacredness as we might be accustomed to, not even their own. \n\nAnd in them, I see reflections of certain strands of rationalist thought. (Certainly, I would not mind living in Amaurot. But it is not a healthy society). It is not exactly the same, but the same ambivalence towards the human experience and a desire to transcend death and suffering is still there. [This](https://www.youtube.com/watch?v=cZYNADOHhVY) would sum up the position I feel discomfort for. It's hard to say why exactly I don't like it, but I'll try my best.\n\nThe stubborn refusal to accept death, I think, comes from a secular worldview devoid of spiritual comforts. If you truly believe that there is no afterlife you would want to live as long as possible! But I can't help but see those who hold on to hope of eternal uploaded robot-bodies as the highest form of delusion, even more so than the religiously-minded people they hold with contempt. \n\nSo I can't help but think of them as coddled scions of a advanced society, much like the Amaurotians. Such utopic dreams of a world without suffering or loss can only be sustained in soap bubbles, in glistening morning dew. Those who seek worldly paradise to escape their own problems will invariably suffer the most.\n\nThe game text has a lot to say about existentialism and nihilism, but I think I'll leave it unspoiled. (I found it kinda preachy, actually, even if I agreed with it.) Does anyone else share my feelings on this?",
    "permalink": "/r/TheMotte/comments/wj1cwt/culture_war_roundup_for_the_week_of_august_08_2022/ijghq0p/"
  },
  {
    "kind": "t1",
    "id": "ijfqhxx",
    "author": "VeevaHon",
    "score": 1,
    "createdUtc": 1659964078,
    "body": "This is not an opinion based on statistical data, scientific papers or writings from a sociologist or psychologist. It is admittedly based on my own observations, with my very biased samples, so please take it with a grain of salt.\n\nAs a woman from a south american country who migrated to a Nordic country, I had expectations about what it would be like to live in a more progressive society when it comes to gender roles. Nordic countries are well known for their advances in gender equality, with men and women playing very similar roles in parenting, the work environment, politics, and so on.\n\nAnd I was not disappointed. To my experience, this is true. However it surprised me to find out there are aspects in which people seem to spontaneously segregate themselves with a strong gender bias, much more than in comparatively more sexist countries such as my homeland.\n\nOne of them is in the STEM work field. I have noticed an even lower percentage of women working in this area. And even among those who work in the field, there seems to be a tendency for them to work more in management and other \"people oriented\" roles instead of pure technical tasks. Similarly, nurses are in their vast majority women. Bus drivers, more mixed than in other countries. And so so on.\n\nWhen I asked nordic people about the reasons of that phenomenon, many shared the same opinion. With a small pay gap between different work fields, more symmetrical parenting roles at home and similar work-life balance across industries, there is less of an incentive for people to seek jobs that will fit their financial aspirations or parenting schedules. And when people are more free to choose their careers based on their tastes, then the gender imbalance in some fields is just an organic manifestation of the biological vocational differences.\n\nNow, it is hard for me to imagine that the implications of this hypothesis are true. Well, if you are to believe that the nordic gender/professional roles distribution is at least closer to the baseline biologically oriented distribution, then what cultural pressures are driving proportionally more developing countries women towards STEM? An overwhelming societal pressure to be well succeeded financially? Does not seem to be the case. And more developing countries men towards, say, nursing?\n\nMaybe to understand this matter we should look at another social phenomenon. Again, something that I empirically observe and have no data to support. But I feel there is a strong gender segregation that starts much earlier, at school and familiar circles.\n\nIt is common to see groups of girls or boys in the street, hardly ever gender mixed. Even in kindergarten hangouts - a common view in nordic streets - isles of pink or blue little dots, no noticeable intersections.\n\nI can't help comparing that to my own developing country middle class childhood. We were not struck by poverty, by all means. But let's say my parents had greater concerns than surrounding their little girl with pink and unicorns. My and my peers' reality was wearing oversized hand-me-down clothes and toys from our elder siblings - more numerous than in most families nowadays.\n\nWhat I observe in families here is more intensive parenting, both in techniques and financial resources. Parents shower their children with pink or blue, reinforcing visual differences. Leisure activities will more often be tailored to each child's tastes - or at least to what the parents believe their children will like, with a very strong gender bias. Fewer children per family will also mean less chances of having a sibling of the opposite sex. Even play dates will probably be more segregated as parents (unconsciously?) again stimulate same gender interactions.\n\nAll in all, I believe that in a similar way that poverty and lack of education drives gender segregation by imposing gender segregated responsibilities from a young age - such as imposition of house chores, different access to education, etc - so does excessively resourceful parenting - by manufacturing worlds of sweet princesses or brave cowboys that are but a reflection of the cultural concept that boys and girls are inherently different in their tastes.\n\nThis is not to claim there are no biological differences in men's and women's brains that, at least partially, explain some tendencies. There mostly likely are. However I do not believe that it is possible to say that scandinavian or any other \"egalitarian\" countries are closer to an environmental neutrality that allows these biological differences to be expressed into societal tendencies in a purely organic way. Nor do I claim that a - maybe impossible - gender neutrality in childhood would lead to better outcomes by any metric. But I believe this \"segregation by excessive resources\" phenomenon should be accounted for when studying gender inequality.",
    "permalink": "/r/TheMotte/comments/wj1cwt/culture_war_roundup_for_the_week_of_august_08_2022/ijfqhxx/"
  },
  {
    "kind": "t1",
    "id": "ijffy0l",
    "author": "FtttG",
    "score": 1,
    "createdUtc": 1659958306,
    "body": "I've just published the [fourth post](https://firsttoilthenthegrave.substack.com/p/pay-no-attention-to-that-opinion) on my blog ([first](https://firsttoilthenthegrave.substack.com/p/the-blacks-of-ireland-the-blacks-of-america), [second](https://firsttoilthenthegrave.substack.com/p/unfalsifiable-aesthetics), [third](https://firsttoilthenthegrave.substack.com/p/an-open-letter-to-orla-obrien-chief)). It's a dissection of a minor controversy which erupted last weekend at an Irish music festival. I use the controversy as a jumping-off point to describe a style of journalism I really can't stand, in which the journalist describes Person X as holding Bad Opinions without giving their readers any indication about the actual content of those opinions (other than that they are Bad).",
    "permalink": "/r/TheMotte/comments/wj1cwt/culture_war_roundup_for_the_week_of_august_08_2022/ijffy0l/"
  }
]
