[
  {
    "kind": "t1",
    "id": "igzkw9e",
    "author": "productiveaccount1",
    "score": 1,
    "createdUtc": 1658363812,
    "body": " A post from u/buttfaceszn put into words something I've been processing for a long time. This has nothing to do with incels, sexism, or anything else in comment made by u/buttfaceszn. It's about how the evolution of our language has played a huge role in our division as a society. I'm only speaking to my experience as an American but I'm sure this isn't unique to us. \n\nTL;DR: We need to stop using extremist language and start defining our terms.\n\nFrom u/buttfaceszn:\n\n&gt;I’ve noticed that the term incel has begun to be used as more of a catchall pejorative for sexism of any kind (at least on the internet) which strikes me as odd. I don’t really like when people use the term incel as an insult to people who bring up redpill/PUA/manosphere-type things, since I suspect there’s a lot of non-incels who find these things interesting and I personally think some of it has value.\n\nu/buttfaceszn is right: Using extreme, specific language to describe tamer things is annoying at best and destructive at worst. To illustrate, let's change the subject of this comment to reflect how each American party often characterizes each other's views:\n\n&gt;I’ve noticed that the term (Fascism/Wokeism) has begun to be used as more of a catchall pejorative for (Conservatism/Liberalism) of any kind (at least on the internet) which strikes me as odd. I don’t really like when people use the term (Fascism/Wokeism) as an insult to people who bring up (Right-wing/Left wing) things, since I suspect there’s a lot of non-(Fascists/Wokies) who find these things interesting and I personally think some of it has value.\n\nYou get the idea - you could throw pretty much any culture war issue into this statement and it would work pretty well. For some reason, we've started to use the most extreme, niche, and damaging words to describe anything that could remotely fall under its umbrella. Trump is a white supremacist, AOC is a literal communist, Gwyneth Paltrow is a scamming, elitist narcissist (unless...). The reasons as to why this is bad are obvious and I think we all agree that we shouldn't do it. But even in this sub people fling out loaded political buzzwords as if they're nothing all the time. Is our divisive language simply a sign of the division in our minds? Or does language start to create that barrier in the first place? Is there any way to fix this, even on a smaller scale (like in this sub)?",
    "permalink": "/r/TheMotte/comments/w1s5b7/culture_war_roundup_for_the_week_of_july_18_2022/igzkw9e/"
  },
  {
    "kind": "t1",
    "id": "igyr7zl",
    "author": "Hailanathema",
    "score": 1,
    "createdUtc": 1658350215,
    "body": "How about a post on some recent Congressional legislation?\n\n---\n\nThe House of Representatives has now passed two bills aimed at protecting abortion rights. \n\nThe first is the [Women's Health Protection Act](https://www.congress.gov/bill/117th-congress/house-bill/3755/text). This bill basically sets out a list of reasons why abortions may not be restricted and creates a test for what future reasons will be prohibited by the law. It targets pretty directly laws various Republican states passed when *Roe* was still in effect to limit abortion. It empowers both the US Attorney General and private parties (including those seeking abortions and those providing them) to sue to enforce the law.\n\nThe second of these is the [Ensuring Women’s Right to Reproductive Freedom Act](https://www.congress.gov/bill/117th-congress/house-bill/8297/text?r=1&amp;s=1). This law creates liability (enforced by either the Attorney General or private citizens) for anyone acting under color of State law who tries to prevent someone from traveling interstate for the purpose of getting an abortion that would be legal in the state they are going to have it done in.\n\nBoth bills passed the House with all but one Democrat in favor and all Republicans against.\n\nBoth bills are most likely dead on arrival in the Senate.\n\n---\n\nOn Tuesday the House of Representatives also passed the [Respect For Marriage Act](https://www.congress.gov/bill/117th-congress/house-bill/8404/text) which enshrines, not [*Obergefell v. Hodges*](https://en.wikipedia.org/wiki/Obergefell_v._Hodges) but rather [*United States v. Windsor*](https://en.wikipedia.org/wiki/United_States_v._Windsor) into federal law. The law does not require that states perform either same sex or interracial marriages but it does require they recognize those marriages if performed in other states where they are legal. It is also enforceable by either the Attorney General or a private right of action. The law also clarifies that the federal definition of marriage includes both interracial and same sex marriages.\n\nInterestingly 47 Republicans (~one-fourth of the caucus) joined the Democrats in passing the bill. If a similar fraction of Senate Republicans support the bill that would be sufficient to invoke cloture and pass it.\n\n---\n\nFinally, introduced today by a bipartisan group of Senators (but not passed anywhere) is the [Electoral Count Reform and Presidential Transition Improvement Act of 2022](https://www.democracydocket.com/wp-content/uploads/2022/07/electoral_count_reform_and_presidential_transition_improvement_act_of_2022.pdf). Exploitation of some ambiguity in the 12th amendment and Electoral Count Act (USC 3) were key to John Eastman's plan for Trump to retain the presidency even after losing the 2020 election. This act is an attempt to remove that ambiguity. The Act does so first by clarifying that state electors are determined by the laws of the state *prior to election day*. This is to prevent state legislatures from changing who the electors are after the vote has happened (unless they delegated themselves that power in advance). The Act also raises the threshold necessary to trigger a vote on an objection from one Senator and one Representative to one-fifth of Senators and Representatives. It also clarifies the grounds on which electors may be objected to. Finally it clarifies that the role of the President of the Senate is ministerial only and sets up an expedited legal process (three judge panel, then SCOTUS) for hearing challenges to election certification.",
    "permalink": "/r/TheMotte/comments/w1s5b7/culture_war_roundup_for_the_week_of_july_18_2022/igyr7zl/"
  },
  {
    "kind": "t1",
    "id": "igy93di",
    "author": "DinoInNameOnly",
    "score": 1,
    "createdUtc": 1658342658,
    "body": "Merriam-Webster recently updated the definition of the word \"female\": The first one:\n\n&gt;of, relating to, or being the sex that typically has the capacity to bear young or produce eggs\n\nThe second one is different:\n\n&gt;having a gender identity that is the opposite of male\n\nThe definitions for male are similar. First:\n\n&gt;of, relating to, or being the sex that typically has the capacity to produce relatively small, usually motile gametes which fertilize the eggs of a female\n\nSecond:\n\n&gt;having a gender identity that is the opposite of female\n\nThere are more definitions provided, but all of them use the words \"woman,\" \"girl,\" or \"female\" (or are defining about the word in a different sense, like a female rhyme or a female connector) so they don't tell us anything about what it actually means to be female, since the definitions of \"woman\" and \"girl\" both use the word \"female.\"\n\nThe definition of gender identity is \n\n&gt;a person's internal sense of being male, female, some combination of male and female, or neither male nor female\n\nThe first definitions are obviously hateful and transphobic, so let's throw those out. If someone who didn't know what male, female, and gender identity were wanted to use the definitions to figure out what female meant, they would learn that being female means \"having an internal sense of being that is the opposite of the opposite of female.\" \n\nThat's basically a long way to say that \"female\" means female. We learn from these definitions that male and female are gender identities that are opposed to each other, but we learn nothing about what the difference between them actually is or even what gender identity really means other than that it's an \"internal sense\" of some kind. The concepts are connected to each other while floating in the ether, unconnected to physical reality or to any non-gender concepts. This is the form gender ideology always takes when you scratch it even a little bit, circular definitions with no connection to reality. Merriam-Webster avoided the simplest one (\"A woman is someone who identifies as someone who identifies...\") by adding more steps but the result, ultimately, is the same.\n\nThe only way to give these any kind of meaning is if you sometimes use the second definition and sometimes the first. If you interpret female as meaning \"having a gender identity that is the sex that typically has the capacity to bear young or produce eggs\", then you've come to something sort of like the understanding of the meaning of the word that progressives actually use. But to get to this definition, female has to mean *both* the second definition *and* the first definition at the *same time*, in the context of the *same statement*, even though these definitions contradict each other (e.g. Lia Thomas is only female by the second definition). \n\nThis contradiction takes other forms, like how trans activists simultaneously insist that having a penis has nothing at all to do with being male at the same time that they insist that surgeries to fabricate a fake penis for someone who doesn't have a real penis are absolutely vital for some males in order to truly live out their gender identity. Penises are simultaneously completely irrelevant and absolutely vital to male identity. \n\nTo believe in gender identity you have to simultaneously believe two contradictory things (that penises make someone male and that they don't). It's trite, but I don't know what to compare this to other than Orwell's doublethink.",
    "permalink": "/r/TheMotte/comments/w1s5b7/culture_war_roundup_for_the_week_of_july_18_2022/igy93di/"
  },
  {
    "kind": "t1",
    "id": "igy0k3k",
    "author": "Amadanb",
    "score": 1,
    "createdUtc": 1658339209,
    "body": "**Semi-regular Ban Report**\n\nNo AEO actions since the last report.\n\n/u/GrandBurdensomeCount - [180 days](https://www.reddit.com/r/TheMotte/comments/w1s5b7/comment/igteigl/) - /u/naraburns\n\n/u/sp8der - [60 days](https://www.reddit.com/r/TheMotte/comments/w1s5b7/comment/igtg87h/?utm_source=share&amp;utm_medium=web2x&amp;context=3) - /u/naraburns\n\n/u/jermleeds - [3 days](https://www.reddit.com/r/TheMotte/comments/w1s5b7/comment/igqq0fm/?utm_source=share&amp;utm_medium=web2x&amp;context=3) - /u/naraburns\n\nu/HlynkaCG - [7 days](https://www.reddit.com/r/TheMotte/comments/vwbj4s/comment/igctwkk/?utm_source=share&amp;utm_medium=web2x&amp;context=3) - /u/Amadanb\n\n/u/JeanStealers - [7 days](https://www.reddit.com/r/TheMotte/comments/vwbj4s/comment/iga251u/?utm_source=share&amp;utm_medium=web2x&amp;context=3) - /u/Amadanb\n\n/u/barggle - [permaban](https://www.reddit.com/r/TheMotte/comments/vuvo1k/comment/ifrpk4k/?utm_source=share&amp;utm_medium=web2x&amp;context=3) - /u/Amadanb\n\n/u/Nantafiria - [2 days](https://www.reddit.com/r/TheMotte/comments/vr0t4v/comment/ifgmwio/) - /u/Amadanb\n\n/u/The_Reason_Trump_Won - [permaban](https://www.reddit.com/r/TheMotte/comments/vr0t4v/comment/if6pju0/?utm_source=share&amp;utm_medium=web2x&amp;context=3) - /u/Amadanb\n\n/u/darwin2500 - [7 days](https://www.reddit.com/r/TheMotte/comments/vr0t4v/comment/iezy5fl/?utm_source=share&amp;utm_medium=web2x&amp;context=3) - /u/naraburns",
    "permalink": "/r/TheMotte/comments/w1s5b7/culture_war_roundup_for_the_week_of_july_18_2022/igy0k3k/"
  },
  {
    "kind": "t1",
    "id": "igwztcg",
    "author": "f3zinker",
    "score": 1,
    "createdUtc": 1658324854,
    "body": "## Why I still talk about covid restrictions. And will continue to do so. \n\n\nRecently there was a [post](https://old.reddit.com/r/TheMotte/comments/vr0t4v/culture_war_roundup_for_the_week_of_july_04_2022/ifl02lf/) talking about how; now that covid restrictions are mostly done with; covid is not something most people really think or talk about. But, there are still two groups of people who continue to talk about covid. Those who were really scared and still are, and the \"skeptics\". The post somewhat implied that both groups are extremist in some way or the other on the issue of covid. \n\nI will try to defend my case on why I think my position of being a skeptic should have been the default position. And the fact it wasn't requires some heavy investigation as to why.\n\n_____________________________________________________________\n\nAs a \"covid skeptic\" much of the discourse around covid restrictions makes me feel like I am being 'gaslighted' on a grand level. The jist of it being that I operated under one overton window, one epistemology my entire life and both those things get radically shifted and transformed in 2 years and everyone is suddenly on board, and I am the crazy one for asking \"wait what about everything we knew before?\"? \n\nTo put it shortly there have been shifts on multiple overton windows in ways that are not conductive to a epistemologycally and politically healthy society and somebody has to acknowledge and speak about it. And continue speaking about it, because some of these shifts pave the way for tremendous injustices. \n\nHere are the reasons why I will keep talking about covid for the rest of my life. And I will not be convinced I am crazy or of a certain ideological group because I do so. I believe the ones who are not talking about these things have had the cloak successfully put over their eyes (even if they are otherwise skeptics), they forgave what was done to them after it wasn't being done anymore, they are complacent.\n\n1. Being a \"covid skeptic\" is the default position of almost all societies before 2020. It was the medical consensus that;\n * Lockdowns are not worth it (QALY,$, \"human rights\" ) for the vast majority of diseases. The ones that pose an IFR high enough to justify them are not that scary because they also tend to be non contagious for various reasons. \nWhat was  essentially considered putting entire cities or countries of people under house arrest suddenly became the default mode of addressing the problem? \n * Universal masking is ineffective for airborne diseases.\n * Vaccinating the entire population by threatening the loss of education/work is by the State is overstepping the bounds by any reasonable western State. \n\n The first two points are correct. They were reached after decades of \"good science\". The bullshit ideological science (along with all sorts of publication bias and a thousand other traps) peddled to make it seem that lockdowns are worth it and masks work are the work of pure propaganda. We can't just let that slide right? If \"mistakes\" were made, they need to be discussed and analyzed lest they not be repeated. \n\n We can't just replace the field of public health which is fundamentally based on the idea of a cost benefit analysis with some idiotic throw EVERYTHING at the wall and hope it works at whatever costs method right? More importantly we can't have this \"philosophy\" wear the skin-suit of what it replaced and pretend to be something it is not, rational. Least of all this needs to be discussed. \n\n2.  The much obvious economic malign caused by covid policies are blamed on \"supply chain issues\",\"Ukraine war\", \"general economic turmoil\", etc. Why is no one talking about the elephant in the room when it comes to economic downturn?\n\n\tReally? Lockdowns and travel bans and printing all that money had nothing to do with the inflation and economic struggles? Why is no one discussing the policies that literally consisted of shutting down economies not having an effect when economies are shutting down? Would Sri Lanka be where it is today if not for travel bans and lockdowns? \n\n\tIn a recent [video essay](https://www.youtube.com/watch?v=JxdHm2dmvKE) by Jordan Peterson. He posits that perhaps the Russian invasion of Ukraine was in part caused by covid restrictions, as some far out there nth order effect. That world leaders being isolated from each other in person for nearing two years might have been a straw that broke the camels back. Even if this sounds like a far reaching judgement on the surface, is it not more far reaching to assert that two years of lockdowns, mandates, minimized travel, and all its social and economic malaise would not manifest at the margins?\n\n      What about an easier to digest example? The mass shootings in the US? They must be at least slightly correlated with the declining social and economic environment right? Why is no one talking about how further isolating and economically straining those on the margins of shooting up a school going to make them do it? Hell I wanted to cause mayhem as I was locked up in my room (don't live in the US) for 2 months on end. \n\n3. The overton window has been shifted significantly towards authoritarianism. We expected the government to play God and deal with nature in 2020 and they let us have our cake, they gladly played as the Gods people wanted them to play so desperately. As a libertarian I don't think this is a good development.  \n\n\t Did we really expect the governments to do everything they did in 2020 for diseases of the past. They were given the right to put people under house arrest for arbitrary levels of disease depending on time and place. This is a terrible precedent. Will this increased state power never be used for stamping out dissent in the future? \n\n____________________________________________________________________\n\nTo further add on. This whole covid debate left me with a tremendous hate towards \"normies\". Many of them felt the same as me. They knew masking 24/7 was stupid. They knew 20 year olds being forced to be vaccinated was unjust. They knew lockdowns would destroy everything. They were still compliant. They had their fun time at home binging netflix and making sourdough bread (as they lost their jobs because of lockdowns). They wore the masks dutifully under their nose. They got vaccinated because \"its just less hassle\", etc. Fuck them.\n\nMaybe I have the temperament of a rabid dog who absolutely won't do something if he thinks its stupid or performative or doesn't want to do it. Perhaps. But if more people were like me, No one would have complied with lockdown orders, what would they have done? Arrest all of us?",
    "permalink": "/r/TheMotte/comments/w1s5b7/culture_war_roundup_for_the_week_of_july_18_2022/igwztcg/"
  },
  {
    "kind": "t1",
    "id": "igu416v",
    "author": "ussgordoncaptain2",
    "score": 46,
    "createdUtc": 1658267480,
    "body": "Ukraine war updates\n\nThis is a slow grinding war of Artillery trenches and drone scouting. Ever since Gennady took over Russia has been steadily and slowly taking ground on [june 19th](https://www.understandingwar.org/backgrounder/russian-offensive-campaign-assessment-june-19) Lysanchansk was the frontline and now on [July 18](https://www.understandingwar.org/backgrounder/russian-offensive-campaign-assessment-july-18) Lysanchansk is firmly in russian territory and the new frontline is Bakhmut. One major issue with reporting on this war is that it's pretty hard to report on a war where most of the conflict is 50000 artillery shells a day (no seriously) getting fired into a fairly small area followed by a small advance and more artillery. Perhaps the best way to find shelling information is [Thermal anomaly](https://firms.modaps.eosdis.nasa.gov/map/#t:adv;d:7days;l:noaa20-viirs,viirs,modis_a,modis_t,street;@37.8,48.1,7z) data because a large scale artillery campaign is visible from such data.\n\nPerhaps the best breakdown I could find of the Ukraine war comes from the [Austrian Military academy](https://youtu.be/dEbLuAPobao) showing just how russian progress has been (slow methodical but definitely moving forward). The grinding down of the Ukrainian forces has been steady, with the UKR forces going from 81 Battallions to 60 while the russians have gone from 93 BTG's to 108 after new reinforcements. (though remember that it's hard to assess the strength of the BTGs) While Thermal anomaly data definitely showed that new NATO weapons had a temporary decrease in russian effectiveness the data appears to show that russian artillery shelling has come back after the operational pause for (what appears to be) logistical reasons.\n\nNew NATO weapons are probably going to make an impact, though given that the US has sent roughly $7 Billion worth of equipment to UKR it's hard to say how much each marginal unit enables. Remember this is also NATO $7 billion so while the weapons work they're not necessarily very good in the \"bang for the buck\" department. In the report by Mr.Resner it's pointed out that the M777 is really vulnerable to damage from Shrapnel, and needs constant repairs to maintain it's combat effectiveness. \n.\n.I keep getting conflicting reports on air defenses, it appears that Ukrianian air defenses are good enough to prevent bombing but they have no defense against air to ground long range missiles., though it appears such ATG missiles aren't very cost effective. \n\nI know reporting on what has become World war 1 with drones is a little boring, but still I'm surprised at how little discussion there is about the only political event to actually remain relevant 5 months after it started in 2022.",
    "permalink": "/r/TheMotte/comments/w1s5b7/culture_war_roundup_for_the_week_of_july_18_2022/igu416v/"
  },
  {
    "kind": "t1",
    "id": "igtlhuq",
    "author": "okay-dot-com",
    "score": 39,
    "createdUtc": 1658260475,
    "body": "https://twitter.com/disclosetv/status/1549460928328077314\n\nSeventeen members of congress were arrested today for protesting the recent SCOTUS decision re: Roe.\n\nThere's a video in that thread of AOC seemingly pretending to be handcuffed, but she raises a triumphant fist at one point, so maybe she didn't realize what it looked like she was doing.\n\nI don't really know how to come at this from a TheMotte perspective. I just find it so humiliating that this is our government. From top to bottom, the US Government is a total embarrassment.",
    "permalink": "/r/TheMotte/comments/w1s5b7/culture_war_roundup_for_the_week_of_july_18_2022/igtlhuq/"
  },
  {
    "kind": "t1",
    "id": "igtkil9",
    "author": "Walterodim79",
    "score": 21,
    "createdUtc": 1658260108,
    "body": "Since the start of Covid-era public health policies, one of my hobbyhorses has been beating up on public health agencies, supporting bureaucracies, and related research and being even more scathing when it comes to the science reporting targeted at general audiences. So naturally, when I heard about [a new study](https://www.thelancet.com/journals/lancet/article/PIIS0140-6736\\(22\\)00847-9/fulltext) out on the impact of alcohol on health and read a couple [news articles](https://www.theguardian.com/society/2022/jul/14/alcohol-is-never-good-for-people-under-40-global-study-finds) on it, my first instinct was to be similarly scathing regarding the quality of evidence and the reporting thereof. Instead of that though, I want to step back and try to tease apart just how different it is to evaluate that evidence from a public health lens and a personal advice lens. For the moment, let's assume that the quality of data and imputed causal relationships are basically valid and use them as a jumping off point:\n\n&gt;The study, published in the Lancet, found that 59% of those who drank harmful amounts were aged 15-39 – people for whom alcohol provided no health benefit and posed risks, including injuries relating to drinking or car accidents, suicides or murders.\n\nI probably do buy that straightaway - I would bet a fair bit that drinkers are more likely to be in car accidents, commit murder, or kill themselves. From a public health perspective, this is at least suggestive of a plausible causal relationship, even if it doesn't really provide the necessary evidence to legitimize compulsory policies without randomized control trials to accumulate better evidence going forward. \n\nOn the flip side though, should this tell me, a guy in my thirties that probably does drink a bit too much, much of anything about the likely impact on my longevity? Does it make me more inclined to suggest to friends that they cut back or stop drinking altogether? My immediate inclination is to think that my risk of car accidents, suicides, and murders are changed by a rounding error by drinking, even by drinking heavily - I don't drink and drive, I've never had a remotely suicidal impulse, and I'm a pretty non-violent guy that doesn't carry a weapon. *Maybe* there's some marginal change, but it's not much. What about my advice for others? Well, I suppose I can't know their inner state as well - some people are visibly sullen or violent when drinking, so it might be best for them to knock it off. I have no way to weight the benefits for others accurately, but I personally gain quite a bit of joy from the culture and experience of good beers and bourbons and do not suffer any apparent emotional or material impacts on my life.\n\nThis isn't really about alcohol though (although I do invite commentary on that), it's about how the reactions of public health people. The policy people say things like:\n\n&gt;Dr Richard Piper, chief executive of Alcohol Change UK, said: “The emerging science on alcohol, over hundreds of studies over the past 20 years, is telling us very clearly that alcohol is very damaging to the human body in multiple ways. We were previously unaware of this, and too many of us continue to drink as though this revolution in our knowledge hasn’t happened.\n\n&gt;“If you care about your health, by far the best approach is not to drink at all. If you do choose to drink alcohol, listen properly to the UK’s chief medical officers, and do not exceed 14 units a week (about six pints of lager or a bottle and a half of wine), have at least three alcohol-free days a week, and never exceed more than six units in one day.”\n\nThe closing paragraph of the linked Lancet study includes:\n\n&gt;The findings of this study support the development of tailored guidelines and recommendations on alcohol consumption by age and across regions and highlight that existing low consumption thresholds are too high for younger populations in all regions. Additionally, our results suggest that guidelines should not incorporate sex-specific recommendations, given the absence of variation in TMREL and NDE by sex across geographies and locations. Finally, recognising that the majority of the world's population consuming harmful amounts of alcohol are young adults and predominantly young males, in order to minimise health loss due to alcohol consumption it is important to prioritise interventions targeted at these demographic groups.\n\nThe thing about public health is that it's inherently a fairly blunt instrument. If the appropriate conclusion is that many people drink too much, resulting in them causing carnage to the tune of thousands of gruesome excess deaths among the young annually from car accidents, suicides, and homicides, it's pretty rational for the policy people to start thinking about how to get people to drink less. They generally can't afford to undercut their message by hedging and saying, \"well, ya know, unless you're just not going to kill yourself, then it doesn't matter much\".\n\nAs a final thought, it's still worth taking a swipe at the journalists - \"Alcohol is never good for people under 40, global study finds\" is just an absolutely shit summary of the finding.",
    "permalink": "/r/TheMotte/comments/w1s5b7/culture_war_roundup_for_the_week_of_july_18_2022/igtkil9/"
  },
  {
    "kind": "t1",
    "id": "igt16bp",
    "author": "badnewsbandit",
    "score": 42,
    "createdUtc": 1658252864,
    "body": "An update on [this](https://old.reddit.com/r/TheMotte/comments/vwbj4s/culture_war_roundup_for_the_week_of_july_11_2022/ifzejpk/) story from last week. [Charges against Jose Alba dismissed](https://www.nydailynews.com/new-york/nyc-crime/ny-charges-dismissed-harlem-bodega-worker-jose-alba-20220719-wpukj3ga2zfrdgomjh7efybbke-story.html).\n&gt;Prosecutors said Alba had at least two strong self-defense arguments to pursue: That he feared Simon might kill him, and that he believed Simon was committing a burglary by stepping behind the counter without permission.\n\n...\n&gt;But other facts of the case weighed in Alba’s favor, the prosecutor wrote. Simon was 26 years younger than Alba and five inches taller. The bodega clerk is 5-foot-7.\n\n&gt;“Simon’s conduct in entering the store’s small, private area, throwing Alba against the wall to a place he could not escape, and grabbing him by the collar could inspire deep fear in an older and shorter man as to what might be in store next,“ Sigall wrote.\n\n&gt;Sigall added, “This was also in the context of the girlfriend saying five minutes earlier that her boyfriend was going to “come down here right now and f--- you up.”\n\nMuch that seems inline with various comments noting the physical disparity between the two men and how that might factor into a self-defense claim as well as the initial remarks from the girlfriend threatening Alba and their impacts on self-defense/robbery.\n\nInitially I was a bit confused about the prosecutors in dismissing the case saying they didn't think they could prove beyond a reasonable doubt that Alba was not justified but apparently in New York, self defense is a [justification](https://ypdcrime.com/penal.law/article35.php#p35.00) not an affirmative defense which balances things much more in favor of the defendant.",
    "permalink": "/r/TheMotte/comments/w1s5b7/culture_war_roundup_for_the_week_of_july_18_2022/igt16bp/"
  },
  {
    "kind": "t1",
    "id": "igsz3wz",
    "author": "Hailanathema",
    "score": 21,
    "createdUtc": 1658252101,
    "body": "The first hearing in Twitter's lawsuit against Elon Musk for specific performance was today. This hearing wasn't about any merits issues for the case but was more about scheduling when the trial will take place. I was unable to tune in for most of the hearing, I only caught the judge's opinion at the end but I know a [couple](https://twitter.com/AkivaMCohen/status/1549403466036117504) lawyers who [live-tweeted](https://twitter.com/Kolyin/status/1549407533269504002) it. You can read Musk's opposition to Twitter's motion to expedite [here](https://corpgov.law.harvard.edu/2022/07/18/twitter-vs-musk-musks-opposition-to-expedited-proceedings/) and Twitter's reply to Musk's opposition [here](https://www.plainsite.org/dockets/download.html?id=308108891&amp;z=0555e1b7).\n\nThe short version is that Twitter wanted a trial in September. This is not *unprecedented* in Delaware courts but it is a very aggressive schedule. Musk wanted a date *next February* which, while also not unprecedented, is much longer than these actions typically take. The Court split the difference (not really) and set the trial for five days in October. This seems to bode pretty poorly for Musk, assuming all the time he wanted before the trial is time he thought he would actually need.",
    "permalink": "/r/TheMotte/comments/w1s5b7/culture_war_roundup_for_the_week_of_july_18_2022/igsz3wz/"
  },
  {
    "kind": "t1",
    "id": "igsmj99",
    "author": "sargon66",
    "score": 24,
    "createdUtc": 1658247422,
    "body": "The UK conservative party will soon pick another leader who will automatically become Prime Minister.  [Betting markets](https://electionbettingodds.com/NextUKConservativeLeader2022.html) give Liz Truss a 47% chance of winning and Penny Mordaunt an 12% chance.\n\nDominic Cummings (rationalist, Brexit Mastermind, and former top adviser to Boris Johnson) [writes](https://dominiccummings.substack.com/p/snippets-6-the-leadership-race-sw1?utm_source=substack&amp;utm_medium=email):\n\n&gt; PennyM is a true idiot. She would be total fiasco as PM\n\n&gt; LizzT is a bit less stupid but much more crackers and would also be a total fiasco.\n\n&gt; Either of them would not just fail, they could destroy the party. Which means that many will be cheering for one of them.\n\n&gt; Boris is supporting Truss. Why? 1) He thinks it’s the best way to stop Sunak. 2) He knows Truss is mad as a box of snakes and is thinking, ‘there’s a chance she blows, there’s another contest and I can return’.\n\n&gt; And with the human handgrenade [LizzT], she may catastrophically escalate the war — remember she has defined the goal as pushing Russia out of Crimea, which if seriously attempted would be seen by the vast majority of Russians Iincluding anti-Putin Russians) as an attempt to destroy Russia and could lead to nuclear weapons.",
    "permalink": "/r/TheMotte/comments/w1s5b7/culture_war_roundup_for_the_week_of_july_18_2022/igsmj99/"
  },
  {
    "kind": "t1",
    "id": "igqxz7m",
    "author": "buttfaceszn",
    "score": 31,
    "createdUtc": 1658213673,
    "body": "I’ve noticed that the term incel has begun to be used as more of a catchall pejorative for sexism of any kind (at least on the internet) which strikes me as odd. I don’t really like when people use the term incel as an insult to people who bring up redpill/PUA/manosphere-type things, since I suspect there’s a lot of non-incels who find these things interesting and I personally think some of it has value. But from the perspective of someone who is trying to insult a redpill/MRA type in a heated Reddit argument, it at least makes sense to call them an incel. Incels afaik do really tend to be into these ideas, and people who excessively harp on them can come across as resentful about their own personal struggles with women.  \n\nWhat’s odd to me is when I’ve seen it used to describe people who make fun of the WNBA, or say that women shouldn’t be NFL coaches, or don’t like women comedians, or make banal observations about women being more sensitive or dramatic or whichever stereotype. The reason it’s odd is that in my experience, low-level sexism or observations/jokes about sex differences are extremely common, even more so among guys who are typically successful with women. I suspect I have a relatively more “normie” upbringing than the typical commenter here, I played sports like football and baseball in high school, went to a good but not elite large public university, was in a social fraternity, and have many uncles and cousins who are all blue-collar tradesmen types. I can’t think of anyone I am close with from sports, HS, college, family, etc. who has had any trouble with women, and definitely none who are redpill types or incels.  \n\nMy whole life, among men of all ages, races, incomes etc. it seems like it’s extremely common to be “casually sexist”. Making “women be shopping”-tier observations about gender differences, or saying women are more [insert stereotype] is very normal, and some more mean-spirited or harmful things like making fun of the WNBA, or saying women couldn’t be NFL coaches, or calling certain women “gold-diggers” wouldn’t be uncommon. It also seems common for my girlfriend or my mom and their friends to make similar observations about men, calling them clueless or lazy or unable to pick up on social cues or not knowing what to do with babies. It also seems these kinds of jokes or observations were popular in sitcoms and comedy movies in the past. It just seems odd to me that this kind of thing would come to be associated with “guys who can’t get laid”, especially since it seems like misogyny/sexism is also somewhat associated with the jock/frat bro stereotype. \n\nI’m not trying to argue whether any of this is good or true or sexist or not. It just always seemed like it was relatively common to me and mostly lighthearted. (I also don’t want to argue whether casual sexism is *harmful* I am just saying the things I am describing aren’t *intended* to be *hateful*).  \n\nI guess my questions are: am I correct that this is normal or am I in a particularly sexist bubble? Was it normal in the past, but isn’t anymore? Or am I just overthinking this, and random people on the internet are just using incel to mean “vaguely sexist” without really caring about being accurate? I suspect it’s the last one and potentially a mix of the other two, but I do wonder if there is a genuine taboo-ing of even the most harmless kinds of gender-stereotype humor among younger generations. Or possibly: I am I just way off on where the line is between “casual/acceptable/normal” level sexism, and something like “making fun of the WNBA” is more in the “hateful towards women” category of sexism?",
    "permalink": "/r/TheMotte/comments/w1s5b7/culture_war_roundup_for_the_week_of_july_18_2022/igqxz7m/"
  },
  {
    "kind": "t1",
    "id": "igq5z71",
    "author": "greyenlightenment",
    "score": 16,
    "createdUtc": 1658197491,
    "body": "Regarding woke capitalism, a common argument is that wokness is profitable, and that the rising share prices of multinational companies that adopt wokness confirm this. \n\nI think finally we may be seeing our fist notable, multinational woke undoing. It's too early to blame wokness for sure, but Disney stock has been doing horribly lately, way worse than the S&amp;P 500. \n\nDisney is at $95, a 53% decline from its peak just 16 months ago, versus a 20% decline for the S&amp;P 500. Moreover, Disney stock is unchanged since early 2015, lagging the S&amp;P 500 considerably there too. \n\nThis difference is huge:  over the past 5 years the S&amp;P 500 is up 56% (excluding dividends) but Disney is down 11%\n\nhttps://i.imgur.com/RmCX3Ms.jpg\n\nToo early to celebrate but this could be a sign of things to come. Same for Netflix, which has also done horribly. I think however Google and Facebook will prove more impervious.",
    "permalink": "/r/TheMotte/comments/w1s5b7/culture_war_roundup_for_the_week_of_july_18_2022/igq5z71/"
  },
  {
    "kind": "t1",
    "id": "igpi2uj",
    "author": "greyenlightenment",
    "score": 22,
    "createdUtc": 1658186815,
    "body": "Link from my blog [The stakes are low for US politics, and America’s rivals are weak and apathetic](https://greyenlightenment.com/2022/07/18/the-stakes-are-low-for-us-politics-and-its-rivals-are-weak-or-apathetic/)\n\nIn this post I argue that America's political problems and division, in spite of social media outrage, are low stakes historically speaking. America's biggest rivals, China and Russia, are also quite weak too even compared to the Cold War.\n\n&gt;Or like the second half of the 20th century, which witnessed several assassinations of statesmen and other important people, including John and Robert Kennedy, Malcolm X, and Martin Luther King Jr., and also the attempted assassinations of Pope John Paul II and Ronald Reagan, in addition to the civil rights movement, the South flipping from Blue to Red, and endless crime waves and race riots that continued until the mid 90s, when crime finally began to fall. Regarding Roe v. Wade, unlike the aftermath of George Floyd’s death, there has been close to zero civil disobedience regarding abortion rights. The BLM riots of 2020, as bad as those were, had far far fewer deaths and injuries compared to the Rodney King riots. Jan 6th is not like 911, as much as the left wishes it was. Yeah, there is a lot of societal decay, such as homelessness and drug use, but this is not destabilizing, nor will it lead to unrest. Elites will continue to retreat from everyone else and the decay, forming their own enclaves and close-knit communities.\n\nI think Pinker's  [Long Peace](https://en.wikipedia.org/wiki/Long_Peace) thesis is still intact even though things may seem worse, thanks to social media , which has the effect of amplifying bad news, so it's hard to look at things in the correct context.  Thanks to social media, every small or isolated event of unrest is broadcast worldwide to billions of people in real time, whereas 40+ years ago similar events would have gone ignored or only mentioned in passing in a local newspaper.  Russia's war with Ukraine does not threaten this post-ww2 geopolitical 'order'. Compared to the conflicts of Vietnam, WW2, or even the Yugoslav Wars, the Russian-Ukraine war doesn't  even measure up to a single battle of WW2, let alone the entire thing.",
    "permalink": "/r/TheMotte/comments/w1s5b7/culture_war_roundup_for_the_week_of_july_18_2022/igpi2uj/"
  },
  {
    "kind": "t1",
    "id": "igph8wf",
    "author": "Extrayesorno",
    "score": -12,
    "createdUtc": 1658186446,
    "body": "Rightists are not put-upon victims nor the innocent objects of left-wing mendacity. \n\nThis framing pops up again and again, [here's an example from a few hours ago](https://old.reddit.com/r/TheMotte/comments/w1s5b7/culture_war_roundup_for_the_week_of_july_18_2022/igotl8u/) that inspired this comment. \n\nThe idea is that the left is just pushing *too far* and if leftists had been a bit more charitable or a bit more reasonable, then rightists would have been happy to compromise. Explicit or implicit is a historical fantasy where the right was sitting passively until the left showed up and tried to implement some change, which the right happily (or at least agreeably) permitted. But then the left just *kept pushing* until the right, like a beaten dog, was finally forced to bite back.\n\nThis is, indeed, fantasy. No left-wing policy, law, program, or ideal has ever been put through except in the teeth of right-wing opposition. Nothing from the decriminalization of sodomy, to desegregation, to women's suffrage, to universal *male* suffrage, to the abolition of slavery (that one necessitated a military defeat, and even then the rebels were whining that they were only fighting this war because the damned abolitionist fanatics had pushed them to it) has been gotten through except by the defeat of the right, whether that be economic, political, social, or military defeat. \n\n(As an aside, there are committed reactionaries who will happily admit that they *do* think the decriminalization of homosexuality, women's suffrage, abolition of slavery, democracy, republicanism, etc. were indeed mistakes, and none of this applies to them, they are at least honest and consistent)\n\nWhen rightists, historically, has said, \"okay, I'll grant you this one,\" they've never said it out of magnanimous good-faith, they've said it at bayonet-point (literal or metaphorical), when they had *no choice* but to grant it anyways. \n\nThe idea that the right wouldn't be so angry and would have been happy if we hadn't just kept pushing has always been nonsense, and the right has never been a hapless victim, but rather an enemy on the back foot. \n\nAny leftist or liberal who is tempted to buy this rightist line of \"hey, we would have been glad to meet in the middle, you guys just got so *crazy*\" and to see the right as victim rather than a (temporarily) weakened foe ought to remember that old fable about the farmgirl and the wounded serpent.",
    "permalink": "/r/TheMotte/comments/w1s5b7/culture_war_roundup_for_the_week_of_july_18_2022/igph8wf/"
  },
  {
    "kind": "t1",
    "id": "igoxug5",
    "author": "JTarrou",
    "score": 50,
    "createdUtc": 1658178356,
    "body": "The tactical AAR on the Uvalde school shooting is out, and full of information for those who want to dig in deeper. Link [here](https://www.youtube.com/redirect?event=video_description&amp;redir_token=QUFFLUhqbGVQV3o2dDdUMzBSRUFzM3ZVdTNhdFgxNmtLUXxBQ3Jtc0ttcWxEblJ2cGlCSWh1aTlYaG1VWFJvSmRkazVJM05OYVM0V1N4TkNZS05ZSUdUVjZmMnJiNGZEZXNSNXRwRkxCMHFJVk5YUjBlSllsNHBObEVORDliSVQ1eVpsOUlkaWFVWjUtU1MzOGt0T0VZeWk0RQ&amp;q=https%3A%2F%2Fbit.ly%2F3yBSEsN&amp;v=u_f6lvwVyfE).\n\nSome highlights to point out:\n\n&gt;Prior to the suspect’s entry into the building at 11:33:00, a Uvalde Police Officer on scene at the crash site observed the suspect carrying a rifle outside the west hall entry. The officer, armed with a rifle, asked his supervisor for permission to shoot the suspect. However, the supervisor either did not hear or responded too late.\n\nPrior to anyone dying there was an armed police officer on site ~~with a bead on the shooter~~ *after* he had fired on two civilians and into the school from the outside. He did not engage the shooter. Edit: or maybe not, conflicting testimony, see thread below.\n\n&gt;At 11:35:55, all three Uvalde Police Department (UPD) officers entered the structure through the west door into the west hallway. These officers were equipped with the following: one with external armor and two with concealable body armor, two rifles, and three pistols.  \n&gt;  \n&gt;At 11:36:00, four officers entered the south hallway through the south door closest to the suspect. It is not clear what equipment these officers had with them. Four more officers entered the west hallway through the west door at 11:36:03.\n\nWithin three minutes of the shooter entering the building, there were at least *eleven* police officers in the building, all with firearms and vests of some sort. At least two, possibly more, had rifles. They do not engage the shooter.\n\n&gt;At 11:38:37, an officer outside of the hallway advises the suspect “is contained.” (BWC)  \n&gt;  \n&gt;At 11:40:58, the suspect fires 1 round according to audio estimates. (ISS)  \n&gt;  \n&gt;At 11:41:30, dispatch asked via radio if the door was locked, a UPD officer responds, “I am not  \n&gt;  \n&gt;sure, but we have a hooligan to break it.” (BWC)  \n&gt;  \n&gt;At 11:44:00, the suspect fires one more round according to audio estimates. (ISS)  \n&gt;  \n&gt;LAW ENFORCEMENT RESPONSE ASSESSMENT 8  \n&gt;  \n&gt;At 11:48:18, a UCISD PD officer enters through the west hallway door and states, “She says she is shot,” referring to his wife. He is escorted outside of the building.\n\nDespite being just behind the shooter, who continues to fire intermittently throughout the standoff, the cops hole up and carefully insert their thumbs deep into their collective rectums.\n\n&gt;At 12:06:16, UPD RL notes that no Command Post is set up, advised bodies needed to keep parents out.\n\nNo one is in charge and the only concern of the cops is to keep anyone who might tackle the shooter out of the school, be it their own officer whose wife was at that moment bleeding out mere feet away, or the parents.\n\n&gt;By 12:13:00, dispatchers had received numerous 9-1-1 calls from a child explaining that there were several children and one of her teachers deceased and another teacher hurt in room 112.  \n&gt;  \n&gt;At 12:15:27, it appears tactical team members of United States Border Patrol Tactical Teams (BORTAC) arrive  \n&gt;  \n&gt;At 12:21:08, four shots are fired by the suspect from within one of the two classrooms. (ISS)\n\n&amp;#x200B;\n\n&gt;From 12:21:16 until 12:34:38, a continuous conversation takes place in the south hallway,  \n&gt;  \n&gt;involving UCISD PD Chief Arredondo and a UPD officer discussing tactical options and  \n&gt;  \n&gt;considerations including snipers, windows, and how to get into the classroom. They also discussed  \n&gt;  \n&gt;who has the keys, testing keys, the probability of the door being locked, and if kids and teachers  \n&gt;  \n&gt;are dying or dead. (BWC)\n\n&amp;#x200B;\n\n&gt;From 12:37:45 until 12:47:25, UCISD PD Chief Arredondo attempts to negotiate with the suspect, speaking in English and Spanish  \n&gt;  \n&gt;At 12:50:03, an ad Hoc team assaults room 111, neutralizing the suspect\n\nSo that's the greatest hits of the timeline. To push in on some issues we discussed previously:\n\nWindows:\n\n&gt;The exterior walls of each classroom had two 3’ x 4’ windows near the opposing corners of each classroom (see Figure 3). The bottom of each window was approximately 3’ from interior floor level, and they were equipped with mini blinds. From the exterior, the windows were approximately 4’ from ground level.\n\nSo four windows total covering both classrooms, and at a height that a normal size man would have no trouble seeing/shooting through from the outside.\n\nExternal door:\n\n&gt;on this day the door was not locked, and because it was not locked, the attacker was able to immediately access the building.\n\nInternal door:\n\n&gt;the suspect is seen entering the room, exiting the room, and then reentering the room again prior to officers entering the building at 11:35:55. The only way to engage the lock is to insert a key from the hallway side of the door. At no point is the suspect observed entering the hallway and engaging the locking mechanism. Based upon this, we believe that the lock to room 111 was never engaged.\n\nJesus H. Shitfucking Christ. Then there's this gem:\n\n&gt;As noted in Figure 6, there was a window in the center of each classroom door. Officers could have utilized the window to send accurate return fire back at the suspect.\n\nInitial attempt of the police to enter:\n\n&gt;As the officers approached the doors, the suspect began firing.  \n&gt;  \n&gt;This gunfire caused both teams of officers to retreat from the doors. We note that the officers did not make contact with the doors (i.e., they never touched any part of the doors)\n\nThis was at the point in time when they had eleven officers with at least two rifles available. Only two officers (one with a rifle) attempted to get to the door, and they both ran away as soon as rounds started coming through the drywall. The \"grazing injuries\" seem to be fragments of the wood/drywall rather than bullets.\n\nSo what should the officers have done, according to the experts?\n\n&gt;Perhaps the simplest plan would have been to push the team back down the hallway and attempt to control the classrooms from the windows in the doors. Any officer wearing rifle rated body armor (e.g., plates) would have assumed the lead as they had an additional level of protection. A team of 4 officers could have utilized the windows in the doors to control a large portion of the classroom from the hallway......  \n&gt;  \n&gt;If the officers believed that they could not establish control through the doors, they should have found another way to stop the killing and dying. One option would have been to breach the exterior windows of the classrooms.....  \n&gt;  \n&gt;Both options a and b could have been done simultaneously. The window breaks could have been used to signal the start of the assault and draw the suspect’s attention from the doors. The window officers would stay behind the cover of the exterior wall while the door officers had priority of fire. Then the window officers could stand and cover the rest of the room.\n\nWell fuck me running, what sort of tactical genius would it take to have thought of that?\n\n[https://www.reddit.com/r/TheMotte/comments/vb5h8j/culture\\_war\\_roundup\\_for\\_the\\_week\\_of\\_june\\_13\\_2022/iciz2ij/?context=3](https://www.reddit.com/r/TheMotte/comments/vb5h8j/culture_war_roundup_for_the_week_of_june_13_2022/iciz2ij/?context=3)",
    "permalink": "/r/TheMotte/comments/w1s5b7/culture_war_roundup_for_the_week_of_july_18_2022/igoxug5/"
  },
  {
    "kind": "t1",
    "id": "ignw4bz",
    "author": "culprith",
    "score": -22,
    "createdUtc": 1658163473,
    "body": "Trans ideology and all it’s strands is becoming a big winning issue for the political right in the West",
    "permalink": "/r/TheMotte/comments/w1s5b7/culture_war_roundup_for_the_week_of_july_18_2022/ignw4bz/"
  },
  {
    "kind": "t1",
    "id": "ign9fxu",
    "author": "Maximum_Publius",
    "score": 82,
    "createdUtc": 1658154341,
    "body": "Wesley Yang is out with a short [new piece](https://wesleyyang.substack.com/p/yes-things-are-really-as-bad-as-youve) by a leftie public school teacher who works in a blue state and a blue city but who nonetheless can acknowledge some of the craziness coming out of the woke left these days. Nothing all that new here but it's nonetheless bracing to be reminded about how deep some woke stuff goes.\n\nThe most shocking part:\n\n&gt;\"1) I once attended a meeting where we brainstormed strategies to increase AP enrollment. When we moved to discuss the gap in enrollment between Black and white students, a senior teacher said that trying to register more children of color for AP classes is inherently racist and that putting greater value on AP classes at all is an expression of white supremacy. To clarify: I don't mean that a senior teacher expressed a complex set of ideas regarding racial justice that could be uncharitably reduced to those claims. I mean I sat in a room where a senior teacher literally spoke the words Trying to register more students of color for AP classes is inherently racist and Putting greater value on AP classes at all is an expression of white supremacy, to an audience of other teachers who nodded along or otherwise kept quiet.  \n&gt;  \n&gt;2) I once attended another meeting - lots of meetings when you’re a teacher! - where we were working to approve a new weekly schedule for students. When I said I was concerned that it would require leaving some sections of the curriculum untaught, a colleague said that might actually be a good thing, because most of our students are white and their test scores dropping slightly would help shrink the racial achievement gap in our state. Again, to clarify: I don’t mean my colleague had a a more nuanced approach to testing that a dishonest interlocutor could twist to sound like that. I mean my colleague literally spoke those words. (To be fair, one other teacher did speak up and challenge them this time, albeit very politely.)\"\n\nI don't have a ton to add here. I've read dozens if not a 100+ articles like this in the past couple years, but they haven't stopped getting my blood boiling. What hope is there for a society captured by an ideology like this?\n\nSometimes I feel a little sad that I haven't had kids yet (I just turned 30). But then I think: If I had had kids earlier (and when I was more of a true believing leftist), then they would probably have been exposed to this kind of toxicity by now. At least having kids later will mean I'll know better than to let them into public schools (or for that matter even into most private schools, many of which are also woke-captured sometimes to an even greater degree than public schools).",
    "permalink": "/r/TheMotte/comments/w1s5b7/culture_war_roundup_for_the_week_of_july_18_2022/ign9fxu/"
  },
  {
    "kind": "t1",
    "id": "igmkq5i",
    "author": "sp8der",
    "score": 54,
    "createdUtc": 1658140781,
    "body": "https://archive.ph/lLUbr\n\nReddit is now straight-up banning opinions it doesn't like. I post this both as a warning to be ready to jump, and to provoke discussion; if one side's arguments are outlawed entirely by the rules of engagement, surely nobody can pretend that the forum is not a far-left dominated venue anymore?",
    "permalink": "/r/TheMotte/comments/w1s5b7/culture_war_roundup_for_the_week_of_july_18_2022/igmkq5i/"
  }
]
