[
  {
    "kind": "t1",
    "id": "ik1ibdz",
    "author": "Hailanathema",
    "score": 1,
    "createdUtc": 1660335759,
    "body": "The Trump search warrant has been [unsealed](https://storage.courtlistener.com/recap/gov.uscourts.flsd.617854/gov.uscourts.flsd.617854.17.0_6.pdf) and it tells us a little more than we already knew.\n\nThe warrant authorizes a search of:\n\n&gt;The premises to be searched, 1100 S Ocean Blvd, Palm Beach, FL 33480, is further\ndescribed as a resort, club, and residence located near the intersection of Southern Blvd and S Ocean Blvd. It is described as a mansion with approximately 58 bedrooms, 33 bathrooms, on a 17- acre estate. The locations to be searched include the \" 45 Office,\" all storage rooms, and all other rooms or areas within the premises used or available to be used by FPOTUS and his staff and in which boxes or documents could be stored, including all structures or buildings on the estate. It does not include areas currently (i.e. , at the time of the search) being occupied, rented, or used by third parties (such as Mar-a-Largo Members) and not otherwise used or available to be used by FPOTUS and his staff, such as private guest suites\n\nThe inventory is not terribly interesting itself. Mostly it classifies what documents they found by their classification level (Secret, Top Secret, etc) and characterizes them very generally.\n\nThere are three statutes listed as being the basis for the warrant. Those are [18 USC 793](https://www.law.cornell.edu/uscode/text/18/793), [18 USC 2071](https://www.law.cornell.edu/uscode/text/18/2071), and [18 USC 1519](https://www.law.cornell.edu/uscode/text/18/1519).\n\nTaking these in reverse order. 1519 provides:\n\n&gt;Whoever knowingly alters, destroys, mutilates, conceals, covers up, falsifies, or makes a false entry in any record, document, or tangible object with the intent to impede, obstruct, or influence the investigation or proper administration of any matter within the jurisdiction of any department or agency of the United States or any case filed under title 11, or in relation to or contemplation of any such matter or case, shall be fined under this title, imprisoned not more than 20 years, or both.\n\nSo the allegation is that Trump altered or destroyed some documents with the intent to impede some kind of investigation or administrative proceeding.\n\n2071 provides:\n\n&gt;(a) Whoever willfully and unlawfully conceals, removes, mutilates, obliterates, or destroys, or attempts to do so, or, with intent to do so takes and carries away any record, proceeding, map, book, paper, document, or other thing, filed or deposited with any clerk or officer of any court of the United States, or in any public office, or with any judicial or public officer of the United States, shall be fined under this title or imprisoned not more than three years, or both.\n\n&gt;(b) Whoever, having the custody of any such record, proceeding, map, book, document, paper, or other thing, willfully and unlawfully conceals, removes, mutilates, obliterates, falsifies, or destroys the same, shall be fined under this title or imprisoned not more than three years, or both; and shall forfeit his office and be disqualified from holding any office under the United States. As used in this subsection, the term “office” does not include the office held by any person as a retired officer of the Armed Forces of the United States.\n\nThe warrant does not specify which section the allegation is for but I think (b) seems the most likely. (a) seems to apply specifically to judicial related documents and I don't think any of Trumps were of that kind. The inventory doesn't obviously indicate so to me. Looking *far* forward, will be interesting to see what kind of legal arguments might evolve around the prohibition of holding office in (b) if Trump were convicted and decided to run anyway. My understanding is current Court precedent prohibits Congress (or the States) adding additional qualifications beyond those in the constitution to offices that are mentioned in the constitution.\n\n793 is probably the spiciest section. I'm not gonna quote it in full here like the others because it's much longer. It basically lists out a bunch of subsections that have to deal with having access to information related to national defense and it being misused in various ways. If I had to pick a section I think (d) or (e) are the most likely. Those paragraphs cover anyone who has access to national defense information (lawfully or unlawfully) and refuses to turn over those documents to a United States officer entitled to receive it. From section (d):\n\n&gt;(d) Whoever, lawfully having possession of, access to, control over, or being entrusted with any document, writing, code book, signal book, sketch, photograph, photographic negative, blueprint, plan, map, model, instrument, appliance, or note relating to the national defense, or information relating to the national defense which information the possessor has reason to believe could be used to the injury of the United States or to the advantage of any foreign nation, willfully communicates, delivers, transmits or causes to be communicated, delivered, or transmitted or attempts to communicate, deliver, transmit or cause to be communicated, delivered or transmitted the same to any person not entitled to receive it, or willfully retains the same and fails to deliver it on demand to the officer or employee of the United States entitled to receive it; or\n\nThe way I read this section is that even if assuming Trump lawfully had possession of these documents (a dubious proposition itself, I think) he still violated this section by refusing to return the documents on demand of whatever government agency was entitled to receive them.\n\nSection 1519 provides a punishment of up to 20 years imprisonment, 2071 provides a punishment of up to 3 years imprisonment, and 793 provides a punishment up to 10 years imprisonment. Note that these are maximums, not necessarily what someone convicted will get.\n\nETA:\n\nOne thing that jumps out to me is that none of these charges seem to depend on the classification status of the documents themselves. I've seen some people float the idea that Trump could have declassified all these documents before leaving office but none of these charges read to me as requiring any particular classification level for the documents referenced therein. Maybe that's my lack of knowledge though.\n\nETA2:\n\nFor reference 18 USC 794(e) (the one I quoted but when you don't have lawful possession) is the one that landed [Reality Winner](https://en.wikipedia.org/wiki/Reality_Winner) five years in federal prison.",
    "permalink": "/r/TheMotte/comments/wj1cwt/culture_war_roundup_for_the_week_of_august_08_2022/ik1ibdz/"
  },
  {
    "kind": "t1",
    "id": "ik0t07v",
    "author": "greyenlightenment",
    "score": 1,
    "createdUtc": 1660325946,
    "body": "Salman Rushdie has been stabbed during an NYC book event, condition unknown.\n\nI'll just link to the twitter feed:\n\nhttps://twitter.com/search?q=%22Salman%20Rushdie%22&amp;src=trend_click&amp;pt=1558109869152018433&amp;vertical=trends\n\nThere's even some footage of after the stabbing, showing him being evacuated via helicopter. Pretty gruesome  stuff.  \n\nMy question is, where was the security. There is a fatwa on this guy... people associated with the book have been killed (notably a Japanese  translator). There should  have been metal detectors or something, yet the assailant was able to smuggle a knife into the venue and ambush him on stage.",
    "permalink": "/r/TheMotte/comments/wj1cwt/culture_war_roundup_for_the_week_of_august_08_2022/ik0t07v/"
  },
  {
    "kind": "t1",
    "id": "ik05nvf",
    "author": "slider5876",
    "score": 1,
    "createdUtc": 1660317173,
    "body": "I found the Richard Hannania breakdown of his readers to be interesting.  Personally I thought he drew from more conservative readership.  But it’s actually fairly similar to motte users.  Instead top sources of his readers are Tyler Cowen, Scott Alexander, Bryan Caplan.\n\nhttps://richardhanania.substack.com/p/survey-results-i-basic-demographics\n\nHis likes and dislikes tables (mostly people) rankings is quite interesting.  You can find it under Hannania table PDF here.\n\nhttps://richardhanania.substack.com/p/survey-results-ii-likes-and-dislikes\n\nI agree with his questioning of sexual harassment and ideas around that where he cited free association as it should be allowed between adults.  If your a libertarian that should make sense to you.  Here’s a few I disagree with the general view on things (apparently from survey results of people like me).\n\n1. Highest ranked big disagreement is Abraham Lincoln.  Comes in as 6th most favorable.  This gets complicated as I dislike slavery but longer term he ended the right of states to secede and with it a lot of the power of State’s Rights.  Personally in an alternative history I would think slavery dies in 30-40 years and a union is re-established while States Rights is watered down forever and eventually when that happened I assume a union was recreated.  Loss of States Rights makes me lower Abraham Lincoln significantly.  Tough call.\n\n2.  Aella making the list is sort of funny.  Probably least known broadly but I guess most have heard of her in this specific community.\n\n3.  Deng Xiaoping.  Way too low.  Probably because of the anti-Chinese bias today (partially earned).  But I would rank him top 10.  Hugely influential and in my opinion successful in eliminating more human misery than anyone else I can think of.\n\n4.  There seems to be a correct interpretation to me that partisan low quality sources are rated lowly.  Looking at ADL/OANN with low rankings.\n\n5.  Assad I rate a lot higher especially in the aftermath.  Simple utilistarianism when Assad dominated Syria was semi-livable.  Now rubble.  Somehow he kept everyone from killing each other.  Which counts for something in my book.\n\n6.  AOC i rank higher.  She’s a meme politician like Gaetz.  Personally think she’s in a process of normalizing and will end up like Nancy Pelosi at 60.  Party leader in the machine.  I don’t have huge negative view of her.\n\n7.  Xi i have a similar bad view of.  And it’s because I’m beginning to question his competency.  Mishandling of COVID and with an authoritarian bent.  I think low competency, bad values, and extreme power makes him a huge threat unlike Deng who had extreme competency.  I would rank him lower from his already low position.  Probably third from bottom.\n\n8.  White Nationalism I rate higher.  Mostly because I don’t know what it means.  And I don’t think the bad version exists at any meaningful level which means it shouldn’t be below things like Xi that has real power.  Same view on Kamala.  Though unlike White Nationalism there’s no strong version that she’s a really bad person.  There’s nothing I dislike about her.  I think she got promoted to a position above her ability.  She shouldn’t be in the lowest tiers.\n\n9.   The Taliban I rate significantly higher.  While they don’t vote on leaders in Afghanistan they seem to have the consent of the governed because no one cared enough to fight them even when they had leftover US guns to stop them.  I will respect a country choosing to be a theocracy provided their shit stays within their own borders.\n\n10.  Weinstein I would also rate higher like Hannania.  On net he made good movies and from a utilitarian perspective he contribute more good than bad.  And I don’t view prostitution as close to as bad as the people he’s listed around him (trading sex for acting jobs).  Though he likely crossed into some non consensual stuff.  I just see a much bigger gap between what he did and Hitler/Stalin.  Xi I would rank next to them.   But still significantly higher because he’s only genocided a little bit instead of entire continents.\n\n\nSome of my differences are probably just how he did the survey and it didn’t differentiate at the lower end well.  And when you dislike someone like Newsome he gets the same score as someone really bad like Hitler.  A 10 point scale would have likely shown bigger gaps.  The scoring would scare me that we are far closer to civil war but I think that’s just the methodology.  I might dislike a lot of Democrat establishment but not at that level.\n\nPersonally was waiting for someone else to post these surveys.  The overlap in communities seemed strong.  I wouldn’t be surprised if he sources ideas here and I’ve had conversations with him.",
    "permalink": "/r/TheMotte/comments/wj1cwt/culture_war_roundup_for_the_week_of_august_08_2022/ik05nvf/"
  },
  {
    "kind": "t1",
    "id": "ijy0qh4",
    "author": "okay-dot-com",
    "score": 1,
    "createdUtc": 1660271787,
    "body": "How likely is it that these nuclear documents will be what Stumps Trump? I can't really say I'm convinced anything will happen since they've been trying to get him for so long... but maybe? I don't have anything useful to say.",
    "permalink": "/r/TheMotte/comments/wj1cwt/culture_war_roundup_for_the_week_of_august_08_2022/ijy0qh4/"
  },
  {
    "kind": "t1",
    "id": "ijxns12",
    "author": "TaiaoToitu",
    "score": 40,
    "createdUtc": 1660265943,
    "body": "Just noticed [AEO taking down](https://www.reddit.com/r/newzealand/comments/wlk5qy/removed_by_reddit/) a public health update on Monkeypox from a NZ government sponsored health foundation on our very left learning national reddit sub. Absolutely wild.\n\nI don't want to bring any more attention to this sub by linking directly, but if you click through to the post, you can find links to the content itself downthread.",
    "permalink": "/r/TheMotte/comments/wj1cwt/culture_war_roundup_for_the_week_of_august_08_2022/ijxns12/"
  },
  {
    "kind": "t1",
    "id": "ijx1bm6",
    "author": "Doglatine",
    "score": 42,
    "createdUtc": 1660256132,
    "body": "Tuesday marked [the death of Raymond Briggs](https://www.theguardian.com/books/2022/aug/10/snowman-author-raymond-briggs-dies-aged-88), one of England's greatest graphic novelists, most widely known for [The Snowman](https://www.youtube.com/watch?v=ZE9KpobX9J8) and [Father Christmas](https://www.youtube.com/watch?v=VkoejIzlITA).\n\nWhile his life and death aren't culture wars material per se, I wanted to mention his passing because his work was *immensely* influential on me as a kid. Specifically, when I was about 7 years old, I read his graphic novel [When The Wind Blows](https://readcomiconline.li/Comic/When-the-Wind-Blows), and accidentally saw [the TV adaptation](https://www.youtube.com/watch?v=9pJKdTqYijY) a few years later. In a departure from his previous work aimed at children, this was a \"comic book\" about nuclear war. Even more specifically, it's about an elderly English couple who follow every bit of government advice, and slowly, painfully die of radiation sickness in the wake of a nuclear attack on the UK.\n\nI cannot emphasise enough how much anxiety and trauma this caused me as a child. I was lucky enough to avoid a religious upbringing, but suddenly, I became aware of civilisational-level threats and the horror of the apocalypse. I literally took weeks off school because I was vomiting from fear of nuclear attack, a condition that only eased when puberty hit and I became worried about much more sensible things like not having a large enough penis.\n\nWhile at some level I resent Briggs (and my parents!) for exposing me to such existential horror at such a young age, I'm also very grateful. I do think the world is a safer place in virtue of this kind of protest comic. It also set in motion a lifelong coping strategy for me - when faced with something terrifying, I resolved to learn as much as possible about it, so that the emotional was replaced by the intellectual. In my late prepubescent years, I became fascinated by nuclear weapons and prepping, and to this day, I make sure to keep potassium iodide pills in the house. Somehow by turning horrors into intellectual problems, they lose their terror.\n\nIn any case, Raymond Briggs's work helped make me who I am today. May the man rest in peace, and his work continue to (appropriately, within reason) traumatise generations yet to come.",
    "permalink": "/r/TheMotte/comments/wj1cwt/culture_war_roundup_for_the_week_of_august_08_2022/ijx1bm6/"
  },
  {
    "kind": "t1",
    "id": "ijwypi3",
    "author": "xablor",
    "score": 36,
    "createdUtc": 1660255064,
    "body": "Another entry in the Inflation Reduction Act effort, this time covering some of the proposed uses of all that money. u/Sorie_K and u/netstack_ ably covered the huge Title I, and I attempted to cover as much of the rest as I could, working backwards. I'm more than out of time, but I'm pleased that I managed to line-by-line Titles II through VIII, some 200 pages, so here's my attempt at a summary. This will necessarily be high-level; my low-level summaries are available at [https://www.reddit.com/r/TheMotte/comments/wc7x7s/collaborative\\_analysis\\_of\\_the\\_inflation\\_reduction/](https://www.reddit.com/r/TheMotte/comments/wc7x7s/collaborative_analysis_of_the_inflation_reduction/), with a top level thread for each title, and summaries under each.\n\nMy first impression is of how /sane/ all this seems - accepting the premise that we will all literally die if we're not net-zero by 2050 (or whatever goal is being set for whatever reason, don't @ me) - this is a legitimate full-court press to electrify GHG producers, enable consumer and industrial deployment of low-emissions tech and enhanced energy efficiency, deploy renewable energy at scale, adapt to incoming warming and extreme weather, and enable research into new forms of renewable energy. I'm not cynical enough to reliably detect opportunities for patronage and corruption, but I'm sure it's there, but a LOT of these funds are pretty tightly targeted. They're even market-y in most places: using them for loan guarantee programs is frequently explicitly allowed, public/private cost sharing is sometimes required. The whole thing reads as though you asked 7 different specialist committees to ask their SMEs to dig out their best ideas, harden them into operationalizable proposals, and then have the lawyers translate it into Congress-flavored legalese.\n\nAs a wrinkle that I'm not sure how to fit elsewhere, there's a good chunk of money allocated for environmental review improvements: S70007 gives 70M to the Environmental Review Improvement Fund under the Federal Permitting Improvement Steering Council; S60402 gives 30M to the Council on Economic Quality for general operations and review enhancements; S60115 gives EPA 850M for improved review and permitting processes; 40003 gives NOAA 150M for improved review and permitting processes; S50301, -2, -3 gives 375M for improvements to environmental reviews and authorizations to Sec of Energy, Federal Energy Regulatory Commission, and Sec of Interior; S23001 gets 100M to provide more effective and efficient reviews. This totals 1.575B, casually. I happened to run across a passed Senate Resolution in the Congressional Record for 2022-8-4 that would undo a rule currently requiring environmental impact statements to include indirect and cumulative impacts; it's S J Res 55 for this Congress, it's got all 50 Republicans and 0 Democrats, and /I don't understand why/. It's referred to House Committee, where it'll die or get stonewalled, but it's an interesting opening for construction maximalism, which seems necessary to achieve the construction bandwidth needed for all these large-scale climate projects. I really hope that someone wiser than me can weigh in here, because I have no idea what to make of this development that smells so much of the Shadow Congress quietly getting big things done.\n\nOf the functional goals of the bill given in the one-page summary at [https://www.documentcloud.org/documents/22122297-inflation\\_reduction\\_act\\_one\\_page\\_summary](https://www.documentcloud.org/documents/22122297-inflation_reduction_act_one_page_summary) , these titles only implement #2: 'Lowers energy costs, increases cleaner production, and reduces carbon emissions by roughly 40 percent by 2030'. This is is only slightly duplicitous:  there are programs for retrofitting cleaner and more efficient industrial processes, and under ideal conditions and friendly analysis 40% reduction from predicted emissions is achievable, but the energy costs aspect seems to be on the demand side, due to more newer and more efficient appliances, better insulation and sealing, demand-shifting tech, and distributed power generation via rooftop PV and thermal solar.\n\nI didn't pick up on a lot of opportunities for diversion, patronage, winner-choosing, vote-buying, or similar abuses, though of course the sheer scale makes waste and fraud inevitable. Most Inspector General offices are getting additional funding, which should help. S13103 is specifically for solar and wind facilities serving low-income communities. 22004 is about disadvantaged rural communities. S50121 sets aside money specifically for encouraging work in underserved communities. 50231 is specifically for water supply projects for disadvantaged communities. 60103 targets GHG emissions in disadvantaged communities. 60104 tries to reduce diesel emissions in poor communities. 60105 targets air quality sensors in low-income communities. 60106 targets air quality emissions at schools in poor communities. 60201 is specifically for \"Environmental and Climate Justic Block Grants\", and is fairly blatantly loose, including \"facilitating engagement of disadvantaged communities in State and Federal public processes\". 60501 tries to fix highways cutting poor neighborhoods in half, improving walkability. Nonprofit orgs are eligible for grants for a few sections, but the purposes are usually tightly scoped. S4001 targets nonprofits \"to enable coastal communities to prepare for extreme storms and other changing climate conditions\", which strikes me as usefully loose.\n\nI'm out of words, here, please let fly with comments,  corrections, or followup questions I can work on. Thanks again to u/netstack_ and u/Sorie_K.",
    "permalink": "/r/TheMotte/comments/wj1cwt/culture_war_roundup_for_the_week_of_august_08_2022/ijwypi3/"
  },
  {
    "kind": "t1",
    "id": "ijwb99h",
    "author": "89237849237498237427",
    "score": 37,
    "createdUtc": 1660245999,
    "body": "The Second Epistle to Timothy 2:22 in the New International Version reads \"Flee the evil desires of youth and pursue righteousness, faith, love and peace, along with those who call on the Lord out of a pure heart.\" The principle outlined here has also been called the \"Modesto Manifesto\", the \"Billy Graham Rule\", and more recently, the \"Mike Pence Rule\".   A pithy statement of it is \"Never dine alone with a woman\". For Pence, it goes a bit further and he also won't consume alcohol without his wife present.   \n  \nWhen this came to light after Pence's vice presidential nomination in 2016, it inspired a furor overnight. Some [claimed it was sexist](https://www.latimes.com/local/abcarian/la-me-abcarian-pence-marriage-20170405-story.html), [Kamala Harris called it \"outrageous\"](https://www.politico.com/story/2019/03/14/kamala-harris-pence-women-1221741), and some commentators have even [questioned its legality](https://www.vox.com/the-big-idea/2017/3/31/15132730/pence-women-alone-rule-graham-discrimination). On the other hand, you have people claiming this is good or inevitable. [One example of the latter](https://wyborcza.pl/Jutronauci/7,165057,25453074,dukaj-wyrazam-niewiare.html) comes from a Polish sci-fi author some of you may be familiar with. In his opinion, movements like #MeToo make Pence's personal code of etiquette unavoidable because there aren't other ways to avoid the implied \"New Puritanism\". Quoting from [the *Atlantic*](https://www.theatlantic.com/politics/archive/2017/03/pence-wife-billy-graham-rule/521298/), \"Socially liberal or non-religious people may see Pence’s practice as misogynistic or bizarre. For a lot of conservative religious people, though, this set-up probably sounds normal, or even wise. The dust-up shows how radically notions of gender divide American culture.\" With a description as apt as that, whatever you feel about it, Pence's personal is now [certainly political](https://digitaledition.chicagotribune.com/tribune/article_popover.aspx?guid=0ba7b595-8da9-4e63-a0ec-aec0639e4af6).  \n\nSo what happens when we have a society-wide experiment in forcing Pence's rule on people? [A recent preprint](https://papers.ssrn.com/sol3/papers.cfm?abstract_id=4105976) alleged that was exactly what happened in the area of economic research. The TL;DR of the result is that post-#MeToo, male economists became more wary of collaborating with female economists. This effect was stronger when university policies on \"impersonal harassment\" were more ambiguous and when the number of past public sexual harassment cases at a university was higher. The effects are a bit scattered, but some clear findings ring out. Despite their proportions of the sample remaining unchanged despite #MeToo, female economists became less productive afterwards. This reduced productivity can be substantially (60%) attributed to the direct effects of having fewer collaborations with male economists, whose own productivity hasn't been affected. The effect on female economists' productivity was broad. Female economists were not less likely to work with women alone or women and men together, but they were less likely to work with men alone. This extended to new projects and new papers. They were not less likely to collaborate with untenured colleagues, but they were less likely to collaborate with tenured people, and this seems to be due to the fact that the tenured colleagues were at higher-ranking universities, which saw larger reductions in cross-sex collaboration. After #MeToo, female economists were less likely to initiate new projects with new and existing coauthors and this effect was due to reductions in the numbers of new projects with new coauthors inside the university and of new projects with new coauthors outside of their university. The same pattern was seen for coauthorships more generally.   \n\nSo this paper argues that what happens when we start practicing what we're told in 2 Timothy 2:22 is that women take a professional hit. The author of this paper offered [two](https://twitter.com/marinambgg/status/1557714978747981824) [stories](https://twitter.com/marinambgg/status/1557714981587546114) to explain these results.  \n\n&gt;Men think “#MeToo means if I accidentally say the wrong thing, I’ll be cancelled/fired. I’d better stay away from women.” Clear policies show that “saying the wrong thing” doesn’t get you cancelled/fired, so clear policies reduce men’s (perceived) risk of #MeToo. \n\nand  \n\n&gt;Women think “#MeToo means I don’t have to work with the predator men anymore, so I’ll avoid them.” If that’s the story, we should see the decrease in collaborations regardless of whether policies are clear or not.  \n \nAnd, to be fair, both of these stories might be true to different degrees. Policy ambiguity does not explain the whole reduction in collaborations. Because this *is* the case, unless the authors' policy ambiguity measures weren't good enough, her suggestion that \"#MeToo plus clear policies could create awareness for sexual harassment without hurting women’s productivity\" may be misguided. Sure, ambiguity reduction looks like it could cut against these changes a bit, but if we trust her measurement we have to conclude that the damage is done. #MeToo has made us all evangelicals, and women are some of the victims of that change.",
    "permalink": "/r/TheMotte/comments/wj1cwt/culture_war_roundup_for_the_week_of_august_08_2022/ijwb99h/"
  },
  {
    "kind": "t1",
    "id": "ijvrw9p",
    "author": "OracleOutlook",
    "score": 34,
    "createdUtc": 1660238684,
    "body": "Are we seeing a correction in practice for transgender issues?  I've seen several signals this year that indicate the tide is shifting away from the affirmative care model.\n\n[The Tavistock clinic](https://archive.ph/TM9LO#selection-295.52-299.145) has been shut down.  The NYT makes it sound like long waitlists are the main reason the UK is ditching this model, but another very strong reason is because the clinic ignored mental health issues in favor of beginning medical transition.  The clinic faces a [class action lawsuit](https://www.thetimes.co.uk/article/4e7fc538-18dc-11ed-b1f4-627a202c7457?shareToken=8c10508fb9e9acdd02579f7a5207924c) from families who believe their child was negligently misdiagnosed by the clinic.  \n\nAn independent review of the Gender Identity Development Service by [Dr Hilary Cass](https://cass.independent-review.uk/publications/interim-report/) appears to be a significant catalyst.  The key points from an interim report are:\n\n&gt;The rapid increase in the number of children requiring support and the complex case-mix means that the current clinical model, with a single national provider, is not sustainable in the longer term. \n\n&gt;We need to know more about the population being referred and outcomes. There has not been routine and consistent data collection, which means it is not possible to accurately track the outcomes and pathways that children and young people take through the service.  \n\n&gt;There is lack of consensus and open discussion about the nature of gender dysphoria and therefore about the appropriate clinical response. \n\n&gt;Because the specialist service has evolved rapidly and organically in response to demand, the clinical approach and overall service design has not been subjected to some of the normal quality controls that are typically applied when new or innovative treatments are introduced.   \n\nFinland and Sweden have likewise changed their guidelines on how to treat gender dysphoria in children.  The Swedish National Board of Health and Welfare has released a [new set of guidelines](https://www.socialstyrelsen.se/globalassets/sharepoint-dokument/artikelkatalog/kunskapsstod/2022-3-7799.pdf):\n\n&gt;For adolescents with gender incongruence, the NBHW deems that\nthe risks of puberty suppressing treatment with GnRH-analogues\nand gender-affirming hormonal treatment currently outweigh the\npossible benefits, and that the treatments should be offered only in\nexceptional cases. This judgement is based mainly on three factors:\nthe continued lack of reliable scientific evidence concerning the\nefficacy and the safety of both treatments [2], the new knowledge\nthat detransition occurs among young adults [3], and the uncertainty that follows from the yet unexplained increase in the number\nof care seekers, an increase particularly large among adolescents\nregistered as females at birth [4]\n\n[Finland released a report with similar guidelines.](https://segm.org/sites/default/files/Finnish_Guidelines_2020_Minors_Unofficial%20Translation.pdf)  \n\nOverall it seems to me that parts of Europe are moving more towards the *actual* Dutch protocol and becoming more cautious about providing medical interventions to gender non-conforming youth.  I have not seen any evidence that this shift might happen in America or Canada though.  Is America lagging behind Europe or is the affirmative care and informed consent model here to stay?  \n\nLastly, the reason this post came together today is because of a thread in the SeattleWA subreddit.   There are a few Seattle subreddits, SeattleWA is the more right-leaning.  It's still pretty left leaning, earlier this week there were people arguing against voting for an independent candidate in case they were a secret Republican.  (They were not, they are actually further left of the Democratic candidate.)  So it's \"right for Seattle\" which is still pretty left for much of America.  \n\nSomeone posted a link to a news article about a YMCA transwoman employee being harassed by an 80 year old woman who felt there shouldn't be a male helping little girls pull down their swimsuits to go potty.  The old woman was banned from the Y due to the incident.   I would expect the comments to be supportive of the trans employee and less supportive of the old lady.  However, that is not what happened.  [See here](https://archive.ph/bdp2r), but most people felt like they wouldn't want a transwoman helping their small daughters use the toilet.  \n\nOther recent events like Lia Thomas' infamy seems to indicate that people don't really mean \"Trans women are woman\" in all situations.  I'm wondering if we'll see an ideological shift happen in America before we see a medical care model shift.",
    "permalink": "/r/TheMotte/comments/wj1cwt/culture_war_roundup_for_the_week_of_august_08_2022/ijvrw9p/"
  },
  {
    "kind": "t1",
    "id": "ijurnpj",
    "author": "[deleted]",
    "score": 6,
    "createdUtc": 1660224408,
    "body": "[deleted]",
    "permalink": "/r/TheMotte/comments/wj1cwt/culture_war_roundup_for_the_week_of_august_08_2022/ijurnpj/"
  },
  {
    "kind": "t1",
    "id": "ijtgwi4",
    "author": "HalloweenSnarry",
    "score": 38,
    "createdUtc": 1660192570,
    "body": "EDIT: [My apologies, this may have all been bullshit.](https://twitter.com/AshleyLatke/status/1557430756267511808) Original post follows below.\n\n----\n\nDispatches from the War on Horny, per Dexerto: [OnlyFans bribed Meta into suppressing competitor sites by having models on said sites labeled as \"terrorists\" on FB and Instagram.](https://twitter.com/Dexerto/status/1557491228232622081)\n\nI'm reminded of the recent story about PredictIt losing the legal cover it had, along with the allegation that rival site Kalshi basically engaged in [regulatory capture](https://en.wikipedia.org/wiki/Regulatory_capture) to get the CFTC to not only approve them, but de-approve PredictIt.\n\nThis is a story not merely about how society treats sex work, but more about how sex work is the canary in the coal mine that often exposes the ways in which our economic system fails. First there was deplatforming and the impossibilities of \"building your own\" (a story that also involved OnlyFans), now there is the reminder that sufficiently-large actors can wield enough clout to just *ask* platform-holders to essentially put their competitors out of business. Now, if you're reading this, chances are you're likely about to respond about how government regulation actually enforces monopolies, but this story is about Facebook (granted, maybe this isn't much different depending on how much you believe that FB is essentially an arm of the US Government), who effectively controls a large chunk of the modern surface internet.\n\nIt's one thing for there to be rules and regulations in place, but much of our legal landscape is in effect very malleable and prone to change on the say-so of ultimately-human agents. Of course, I know that money and words have always been weaknesses in our democratic institutions, but this is just more grist for the mill of \"the real power is not just in Washington.\"",
    "permalink": "/r/TheMotte/comments/wj1cwt/culture_war_roundup_for_the_week_of_august_08_2022/ijtgwi4/"
  },
  {
    "kind": "t1",
    "id": "ijsuiyy",
    "author": "DrManhattan16",
    "score": 15,
    "createdUtc": 1660181563,
    "body": "For a blast from the past, [Alex Jones has just finished up with a one of multiple lawsuits he's involved in](https://www.nbcnews.com/think/opinion/alex-jones-law-suit-verdict-sandy-hook-case-scare-conspiracy-theorists-rcna41828).\n\nThe lawsuits were about his messages calling Sandy Hook a fake school shooting and saying the parents were crisis actors. Jones obviously moved on once the shooting was no longer relevant, but his actions led to his followers harassing the parents in question. Some accounts of that harassment can be found here: [1](https://nymag.com/intelligencer/2016/09/the-sandy-hook-hoax.html), [2](https://www.washingtonpost.com/news/morning-mix/wp/2017/06/08/sandy-hook-hoaxer-gets-prison-time-for-threatening-6-year-old-victims-father/). It's difficult to conclusively define his impact, so I can't really say if he's the originator of the hoax claim. There are more conspiracy theorists with large followings than Jones, and ideas can occur independently at the same time. But Jones' status makes it likely many people heard the \"Sandy Hook was a hoax\" line from him in one way or the other and some acted on it.\n\nA big point about this lawsuit and Jones' conduct in general has been the refusal to obey judicial orders or not follow court rules in general. Jones, his lawyers, his company, and whoever was involved in his defense don't seem to have done a very good job, his lawyer straight up sent Jones' phone records to the plaintiffs' lawyer, who said that Jones basically lied about actually trying to see if he had any records about Sandy Hook.\n\nThat said, [he's admitted under oath that he does think the school shooting actually happened](https://abcnews.go.com/US/wireStory/sandy-hook-parents-alex-jones-claims-created-living-87866827), which seems on brand for Jones as someone who doesn't actually believe what he's saying. Of course, he added that he'd apparently love to recant his mistake, but the media won't let him. He's also said he apparently wanted to apologize to the parents, but given how many years its been, it's clear this is throwing anything at the wall to see if something sticks.\n\nThe lawsuits are not satisfying for anyone, I think. Jones' defenders can tell themselves that this trial was really only decided by legal technicalities and the actual facts were never put under examination, a similar claim to one that some people here have made regarding 2020 election lawsuits. For those who want to see Jones taken down, the amount of money is basically nothing to him. Some are calling for Jones to see trial for perjury (he lied multiple times under oath in this trial) and his phone records are apparently being sent at request to the Jan 6th committee, so look forward to that in the future.",
    "permalink": "/r/TheMotte/comments/wj1cwt/culture_war_roundup_for_the_week_of_august_08_2022/ijsuiyy/"
  },
  {
    "kind": "t1",
    "id": "ijr0gxb",
    "author": "SaxifragetheGreen",
    "score": 57,
    "createdUtc": 1660155161,
    "body": "Today marks four years since Richard Russell stole a plane from SeaTac airport, did a barrel roll, then crashed into a remote island. RIP Skyking.\n\nThis story has always held my attention, and I must admit to a certain amount of wistful fascination with the entire episode. The story of a nobody who does something extraordinary, even though it meant his death. There's something glorious about it. Despite the need to avoid glorifying a man stealing an airplane to take it on a joyride, I can't help but admire him. \n\nThere aren't many other things I can think of that are simultaneously ill-advised and wonderfully glorious. The one that came to mind, that has a similar feeling to me, is Alex Honnold, the man who freeclimbed El Capitan. Like stealing an airplane, freeclimbing El Capitan is ill-advised, and yet undeniably glorious. Obviously Alex didn't have to steal anything, and Alex didn't die doing it. Alex planned, and didn't break any laws. But still. The feeling I get from both resonate, harmonize. Maybe it's close to the admiration I have for Ted Kaczynski, who more than all else lived his morals and implemented them as he saw fit. Of course, while Alex didn't kill anyone and didn't die, and Richard didn't kill anyone but himself, Ted killed other people, and is still alive (for now). Ted's not glorious, not like Alex, not like Richard, even. Maybe I'm just a sucker for iconoclasts, and don't have the moral fortitude to decry their transgressions. Maybe I'm just confused.\n\nI don't really have a point with this post, other than to mark the anniversary of Richard's flight. I'd be curious to know if this story affected anyone here like it did me, if anyone can recognize the kind of wistfulness I feel, and if there are any other people or stories who make them feel the same way. Maybe there's a German word that describes it, one I don't know.\n\nFor anyone not familiar, here are some links.\n\nhttps://mynorthwest.com/1076542/planes-temporarily-grounded-at-sea-tac-airport-for-security-breach/\n\nhttps://counter-currents.com/2020/08/sky-king/\n\nhttps://theamericansun.com/2018/10/06/the-last-flight-of-the-white-man/\n\nhttps://www.rollingstone.com/culture/culture-features/beebo-russell-seattle-plane-theft-true-story-1187023/\n\nThe \"full\" audio of the air traffic call: https://www.youtube.com/watch?v=KNWoomWgYAc",
    "permalink": "/r/TheMotte/comments/wj1cwt/culture_war_roundup_for_the_week_of_august_08_2022/ijr0gxb/"
  },
  {
    "kind": "t1",
    "id": "ijpo106",
    "author": "Arminio90",
    "score": 23,
    "createdUtc": 1660136176,
    "body": "Italian election coming the 25th of september after the collapse of the technical government lead by Draghi , and the electoral campaign is in full swing and fun as always.\n\nThe \"left-center\" anti-right alliance collapsed after 5 days when the leader of Azione (3% party, center-leftish pro-Draghi) left it when the PD (main center-left party) decided to include inside the Sinistra Italiana and the Greens (3% together) in the grand-coalition. \n\nAzione was also part of another small coalition with the Soros-funded Più Europa party (2%), alliance that collapsed with accusation of betrayal launched against each other. \n\n- the left accuse Calenda of being a liberal centrist always allied with fascism\n- the center left and Più Europa, apart from the fascist libel, are also desperate because Azione was a party liked by a certain kind of leftish intellighenzia more near to the ex-Premier Draghi\n- Calenda attacked everyone, saying that Pd and Più Europa did not respected the pact of forming a \"Pro-Draghi coalition\", preferring the leftist parties\n\nIn general, the grand coalition is not working. The small left is candidating africans and gays, while the center left candidates neoliberal economists and feminists, while everyone complains that, if they are not going to sustain each other, the right \"will win\" \n\nThe right has also internal problems (Especially with Berlusconi's Forza Italia, 7%, that lost a big chunk of the leadership to Azione after the fall of Draghi's government), but they appear more united and less catty. \n\nMedias are pumping stories daily on black people being beaten or discriminated or gay people, but the survey say that the right coalition can win more than 2/3 of the parlamentarians both in the chamber or in the Senate. \n\nWhile the right post cringe boomer memes as their method of propaganda, the other side is going hard on the \"vote us or Orban (!!!) wins\" \n\nIt is not working.",
    "permalink": "/r/TheMotte/comments/wj1cwt/culture_war_roundup_for_the_week_of_august_08_2022/ijpo106/"
  },
  {
    "kind": "t1",
    "id": "ijp0dfw",
    "author": "TransportationSad410",
    "score": 15,
    "createdUtc": 1660120523,
    "body": "The magistrate who approved the warrant seems to be corrupt. Here is a timeline of his involvement with the Epstein case:\n\n- Reinhart was working for the justice department\n- 10/07 Reinhart registers a llc registered in Epstein’s defense lawyers name(not sure if it was registered like this from the beginning or switched later)\n- during the middle of the case Reinhart switches sides, quits the DOJ and immediately starts represents Epstein’s employees. The llc is used for his defense firm\n- 2011 Reinhart denies he was involved in the case while at the DOJ during a lawsuit \n- 2013 supervisors of reinhart contradict him and say he was privy to private info about the case.\n\nAm I missing something here, because it seems like he was in contact about a job with Epstein’s side while the DOJ was prosecuting Epstein and he was privy to private info about the case. Seems like straightforward corruption",
    "permalink": "/r/TheMotte/comments/wj1cwt/culture_war_roundup_for_the_week_of_august_08_2022/ijp0dfw/"
  },
  {
    "kind": "t1",
    "id": "ijothr6",
    "author": "DuplexFields",
    "score": 112,
    "createdUtc": 1660114990,
    "body": "As the resident Albuquerquean, I want to mention that the serial killer of Muslims has been found. At least one tip to the police was from a redditor in the Albuquerque subreddit who methodically searched Google Streetview for the suspect’s Jetta, which had small but significant damage in one place.\n\nThe killer targeted local Muslim men, mostly Shia but one Sunni. He lay in wait for his victims, hinting that he knew them personally. The community was devastated by the deaths and was also devastated by the killer’s identity: a Sunni gentleman who was known to be a bit off his rocker, and seems to have been motivated by his son marrying a Shiite girl.\n\nThe Albuquerque subreddit, a progressivist haven as most default-named subs tend to be, instantly stopped calling for fire to rain down from Washington DC onto Albuquerque’s red-hatted bigots, and started thoughtfully bemoaning extremism and mental health issues. They did manage to find a few outgroup tags to apply to the suspect, whose shares his first name with his Prophet and a few of his victims.\n\nEDIT: I was just reported for a violent comment in the Albuquerque sub wherein I said (before his religion and race were known) that I hope the suspect gets the death penalty, in the form of a public hanging, after a fair trial and all applicable appeals, instead of life in prison. I got the warning only *after* it became known he’s a non-white Muslim with longstanding mental health issues.",
    "permalink": "/r/TheMotte/comments/wj1cwt/culture_war_roundup_for_the_week_of_august_08_2022/ijothr6/"
  },
  {
    "kind": "t1",
    "id": "ijngiha",
    "author": "Lorelei_On_The_Rocks",
    "score": 21,
    "createdUtc": 1660089311,
    "body": "Is there even any point to right-wing political victories when the left continues to control the cultural means of production? It's hard to get psyched up about GOP governors going after CRT or cracking down on left-wing corporations, and it's hard to see it as anything more than a rear-guard action. As long as the left controls the narrative, which they will continue to do since they control media, movies, social media, etc. Hard power can't prevail against soft-power in the long-term. Seems like the only way the right could get anything like a lasting victory would be to somehow seize control of cultural institutions, but that is a far more difficult thing to do than to seize control of stage legislatures or governors' mansions.",
    "permalink": "/r/TheMotte/comments/wj1cwt/culture_war_roundup_for_the_week_of_august_08_2022/ijngiha/"
  },
  {
    "kind": "t1",
    "id": "ijmqb7h",
    "author": "grendel-khan",
    "score": 37,
    "createdUtc": 1660078486,
    "body": "Jordan Weissmann for *Slate*, [\"Why Internet Leftists Are So Pissed About Democrats’ Historic Climate Bill\"](https://slate.com/business/2022/08/inflation-reduction-act-climate-change-criticism-adam-mckay-david-sirota.html). (See also [this episode of *Volts*](https://www.volts.wtf/p/volts-podcast-what-to-make-of-the).)\n\nThis is inside-baseball among climate activists, but I thought it was interesting enough to lay out here.\n\nThe [Inflation Reduction Act](https://en.wikipedia.org/wiki/Inflation_Reduction_Act_of_2022) is, [as Michael Sweeney predicted](https://nitter.it/mtsw/search?f=tweets&amp;q=inflation+reduction&amp;since=&amp;until=2022-01-31&amp;near=), part of Build Back Better wearing a different hat, but adjusted significantly to appeal to Joe Manchin and Kyrsten Sinema. Some Mottians [are doing a collaborative analysis here](https://old.reddit.com/r/TheMotte/comments/wc7x7s/collaborative_analysis_of_the_inflation_reduction/).\n\nA central tradeoff is in [section 50625](https://s3.documentcloud.org/documents/22122281/inflation_reduction_act_of_2022.pdf#page=644), which requires that for wind and solar to be developed on federal lands, two million acres of land and sixty million offshore acres of federal land must be offered for lease for oil and gas development. (Note that private and public lands are somewhat fungible, all offers are not leased, and all leases are not developed.)\n\nAdam McKay and David Sirota are the screenwriters of *Don't Look Up* (previously [reviewed on ACX here](https://astralcodexten.substack.com/p/movie-review-dont-look-up)), with 1.3 million Twitter followers between them. They've been *very angry* about this deal. ([Example from Sirota](https://twitter.com/davidsirota/status/1556487558510821376), [from McKay](https://twitter.com/GhostPanther/status/1556745117838430208).) This has led to some [moderately funny beclownening](https://twitter.com/Wertwhile/status/1556278768674566145), and [is the same line being pushed by some Republicans](https://popular.info/p/the-people-behind-the-bizarre-non) attempting to derail the bill.\n\nBut I think there's something more interesting here. This reads to me as a very clean deontology/consequentialism split. If it hadn't been the leases, it would have been the [supports for keeping nuclear plants open](https://www.bloomberg.com/news/articles/2022-08-03/machin-deal-tosses-30-billion-lifeline-to-us-nuclear-reactors). From one perspective, anything that helps fossil fuels in any way is absolutely forbidden, therefore, this is a bad idea; from the other, we [see that the policy bundle reduces 24 tons of emissions for every ton it adds](https://energyinnovation.org/wp-content/uploads/2022/08/Modeling-the-Inflation-Reduction-Act-with-the-US-Energy-Policy-Simulator_August.pdf), so it's net good, period.\n\nThere's a persistent belief on the left that there's a vast disaffected left-wing mass of voters who would show up for a sufficiently inspiring candidate. This was shown to be false when Sanders ran in 2016 and again in 2020, but it's *sticky* because it's nice to believe that everyone's silently on your side. Similarly, this portion of the left has been very keen to believe that [we can crush fossil-fuel supply, and it'll only affect billionaires](https://twitter.com/KateAronoff/status/1089327906139054080). The political reality is, of course, different, in that people [*really hate* high energy prices](https://pprg.stanford.edu/wp-content/uploads/Presidential-Approval-and-Gas-Prices.pdf), which is how supply restrictions manifest themselves.\n\nI want to emphasize, not everyone on the climate-hawk left is taking the deontological approach. But it's certainly *interesting* to see this split.",
    "permalink": "/r/TheMotte/comments/wj1cwt/culture_war_roundup_for_the_week_of_august_08_2022/ijmqb7h/"
  },
  {
    "kind": "t1",
    "id": "ijidq33",
    "author": "rokosbasilica",
    "score": 67,
    "createdUtc": 1660002038,
    "body": "The FBI just [raided Mar A Lago](https://www.cnn.com/2022/08/08/politics/mar-a-lago-search-warrant-fbi-donald-trump/index.html) (Trump's home).\n\nThis doesn't seem quite *unbelievably* stupid, since, there is a lot of very stupid things that have already happened, so I can believe it, but...man this just seems like a really dumb thing to do.\n\nThere's no way this isn't a major step on an escalatory spiral.  What will the Republicans do to Biden when they regain power?",
    "permalink": "/r/TheMotte/comments/wj1cwt/culture_war_roundup_for_the_week_of_august_08_2022/ijidq33/"
  }
]
