[
  {
    "kind": "t1",
    "id": "ihpow7l",
    "author": "FiveHourMarathon",
    "score": 1,
    "createdUtc": 1658842704,
    "body": "**Has Modern Capitalism Lost Track of the Idea of the Gimmick?**\n\nWall Street had a day of talking about nothing but [Snapchat](https://finance.yahoo.com/m/054b5080-cb67-3e13-8265-dab2917f384a/snap-stock-tumbles-as.html) as its parent company lost 30% of its value after a bad earnings report. Advertising revenues are down across the board, as Apple and others have instituted better privacy protections for users, and the economy seems headed for a general downturn so ad revenues will likely follow.\n\n[Snap](https://en.wikipedia.org/wiki/Snap_Inc.) for those of you that aren't aware, is a messaging app that send self-destructing picture/video and sometimes text messages. When it launched, it was the first service to really make the disappearing pic/video big, and that made it popular with teenagers/20-somethings who wanted to send pictures that they might be embarrassed by later. Besides the obvious sexting use-case (the privacy was of course much worse than promised), I also recall having a lot of male friends that loved to send me pictures of their giant poops as a gag, and people liked to use it at parties to send drunken videos that wouldn't last any longer than necessary. Its use was always casual, no one wrote a thesis on Snapchat the way they have on Twitter/Reddit or made art on it the way they have on Instagram/TikTok. Its primary use case was dicking around with your friends, and the professional ecosystem built around that because people were already on snapchat, at core it's a [Gimmick](https://en.wikipedia.org/wiki/Gimmick).\n\nSomehow this got turned into a market cap of over $100,000,000,000; 80% of which has been erased this year. The company has only once turned an actual profit, and while the founders are now immensely wealthy it is as a result of selling equity in the \"future\" of Snapchat rather than from money actually paid by advertisers or users of Snapchat. Somebody is going to, or already has, lost a lot of money on this.\n\nAnd it's summer, so I'm thinking of summer trips to the Jersey Shore as a kid, and the Surf Mall on the boardwalk that was like a big pseudo-department store with every summer fad or gimmick of the year. I think I've been inside it most years since about 1998 or so, and every year the majority of their entire stock of stuff is different. One year it's drug rug hoodies, the next year it is marvel themed sweatshirts, the next everything is in a certain shade of pink. Baseball cards become Pokemon cards become YuGiOh cards become Funko Pops (I think? I'm still not entirely sure what those are beyond hearing them in sneers) comes all the way back around to first edition Holo Charizard Pokemon Cards. \n\nAnd I'm thinking about it, the Surf Mall proprietors if you asked them would say they need to make money on whatever they are selling before it goes out of fashion, and run their business each year at a profit on that item. And their suppliers would say, we're selling these sweatshirts at a price where we can make money this year before they go out of fashion next year and then we'll make something else, whether they are manufactured in NJ or in Sichuan they are able to figure out what their customer will move to. I feel like that's what we've lost in this business environment, you get a gimmick you and recognize it and you cash in while you can, then move on. Snapchat was a gimmick, it was always a gimmick, and anyone who knew teenagers using it would have said \"Yeah, this is a gimmick.\" A business like that should have been trying to actually make money off its business while the going was good. What is it that leads to this attitude:\n\n1) Is it that everyone is trying to get the next Amazon or Google? Are all these investors just foolishly playing the lottery? Are they all lemmings following a few leaders on CNBC or whatever who fell for the lottery approach?\n\n2) On a related note, cult of the founder? Snapchat's founding pair will always control 98% of voting shares, much like WeWork before them, were investors snookered by a few charismatic guys?\n\n3) Generation gap expanding? Maybe middle aged businessmen get physical fads like Pokemon cards because they saw similar things when they were teens, but digital fads confuse them because they didn't experience them. This should become less true over time, as digital generations age, but it does not seem to be. It would have been obvious, in my mind, to any 19 year old sexting on Snap that Snap was not a $100bn company for the future, it was a fun thing you would stop doing soon enough. There's a disconnect between the customer and the investor somewhere.\n\n4) Cult of the future? I'm probably more plugged into fashion than most Motte-izens, and you see this as well in fashion companies where brands are constantly decried for not keeping up with the times, or alternatively for selling out when they get big, when the reasonable explanation for the vast majority of brands is that they're big for a while and then they disappear. Most apps are the same, they're a fad for a bit, then they fail. Why are we so consistently expecting top 1% scenarios from every business, rather than looking for 50th percentile performance?",
    "permalink": "/r/TheMotte/comments/w7h8wa/culture_war_roundup_for_the_week_of_july_25_2022/ihpow7l/"
  },
  {
    "kind": "t1",
    "id": "ihnvjn6",
    "author": "ussgordoncaptain2",
    "score": 4,
    "createdUtc": 1658801724,
    "body": "A while ago their was a Motte Survey that had the statement \"the west is in Decline\" which I disagreed with but the modal motte user agreed with.\n\nTherefore I need to tease out what people meant by \"the west\" and meant by \"decline\".\n\nSurvey's are popular so I [made 1](https://docs.google.com/forms/d/e/1FAIpQLScbtLqP8cf6ae4C3JeRXXXXNpCBlVF28B9QuDshf9oswPBHXg/viewform?usp=sf_link).\n\nMost of the questions are replicated below.\n\n1. What G20 nations are in \"The west\" (most notable countries, being Russia, Japan, and South Korea) \n\n2. What countries are in Decline? \n\n3. What do people mean when they say \"Decline\"? Do they mean relative decline or absolute decline?\n        \n       3a. A country loses her imperial holdings but the mainland grew 5x in the time period, did they \"decline\"\n\n       3b. A global power grows 5 fold with stable borders but the rest of the world grew 10 fold, did they \"decline\"  \n        3c. A country grows 5 fold in 30 years becoming one of the major powers, but then in the next 30 years grows only 1.5x and falls from 1/3rd as strong to being 2/9ths as strong as the main superpower.\n\n\nWhen people say the west is in decline I tend to disagree, with the exception of the fall of the British and French empires, The west has not declined, merely risen slower than contemporaries. Even then since the fall of the berlin wall only 1 nation (china) has risen to surpass the Medium powers of Germany/France/Britan. Though Japan surpassed them as well, Japan also became \"west\" somehow.",
    "permalink": "/r/TheMotte/comments/w7h8wa/culture_war_roundup_for_the_week_of_july_25_2022/ihnvjn6/"
  },
  {
    "kind": "t1",
    "id": "ihmd0bz",
    "author": "f3zinker",
    "score": -14,
    "createdUtc": 1658778956,
    "body": "Reposting my link to a survey. I didn't get any responses from The Motte users (I got some from the other two subs) so I'm posting it here, I think the CW thread might get all the traffic as opposed to the front page. \n\nRecently there was a post trying to survey the general knowledge of the motte. The post got removed. And various people accused the survey of having various shortcomings, from it being a troll, to OP having some kind of agenda with the questions asked. \n\nTherefore I created a new survey for general knowledge. \n\n~~1. Its timed. There are 39 questions. With 35 minutes to answer all of them.~~ \n\n~~2. They are all multiple choice, with only 1 valid answer.~~\n\nThere is a math, CS, geography, history and economics section.\n\nI tried to design the questions such that they can be answered without any niche/esoteric knowledge. I did not include any of my personal pet questions or anything like that and tried to frame the questions such that you can use incomplete knowledge to answer them, as long as you have a rough idea of the mechanisms that guide those fields. \n\nFeedback appreciated. \n\nDISCLAIMER: Email only to log in, I can't see the emails. \n\nLink to the survey here. https://forms.gle/S2a8BY7Ln8kPcCpj9\n\n\n________________________\n\nedit - Very controversial. I will count more than one answer to the *vague* questions as correct when I do the final eda. My ultimate goal is to do a subreddit wide survey, not individual survey, so don't put too much weight into your own score. Add +1 or 2 points because some questions are vague, if you want a rough estimate of your score were the questions less vague.\n\nedit2- Certain questions most people were getting wrong, people are getting right now. Either there is data leakage from the comments, or a different demographic is onto it. Hmmmmm",
    "permalink": "/r/TheMotte/comments/w7h8wa/culture_war_roundup_for_the_week_of_july_25_2022/ihmd0bz/"
  },
  {
    "kind": "t1",
    "id": "ihllphv",
    "author": "dblackdrake",
    "score": -34,
    "createdUtc": 1658768549,
    "body": "So, you know how when you examine the porn consumption habits vs. political beliefs, you can always find something worth a laugh?\n\n[https://lawsuit.org/general-law/republicans-have-an-obsession-with-transgender-pornography/](https://lawsuit.org/general-law/republicans-have-an-obsession-with-transgender-pornography/)\n\nHere it is again: Conservatives fucking LOVE trans porn, and liberals don't seem to know it exists. \n\nLikewise, conservative as a population love cuckoldry(BLACK), cheating, and Teen; while liberals seem to go in hard for BDSM, rape play, and power dynamic shit.\n\nYou can't really do anything useful with this other than score the meaningless dunks on the more naïve type of lib or con; but I always wonder if there is anything meaningful you can take from it?\n\nThat is, I don't really have anything interesting to say about it that hasn't been said, other than I still don't understand the why this would be the case to consistently and none of the explanations I've heard have an air of truthiness.\n\nAnyone have any links that they feel explain this well?",
    "permalink": "/r/TheMotte/comments/w7h8wa/culture_war_roundup_for_the_week_of_july_25_2022/ihllphv/"
  },
  {
    "kind": "t1",
    "id": "ihlhqm0",
    "author": "rokosbasilica",
    "score": 40,
    "createdUtc": 1658767047,
    "body": "There's a trend I've noticed more on reddit lately, including here on this sub.  I thought I'd share some thoughts on it.\n\nThere is a technique that old SysAdmins will recognize called tarpitting: https://en.wikipedia.org/wiki/Tarpit_(networking)#SMTP_tarpits\n\nThe technique is to prevent spammers from being able to abuse a mail server (send too many messages) by simply wasting their time.  If the mail system detects something it believes is a spammer, it will simply make everything take a really long (relatively) time.\n\nInstead of being able to send 1000 messages/second, it might limit you to one message ever 5 seconds (this is exaggerated).  The idea is that a normal user won't notice this, but a spammer trying to send thousands of messages will.  It's a very clever, and also effective strategy.  I like it.\n\nThere is something that I've noticed especially on reddit, which feels like an evolution of Gish Galloping: https://en.wikipedia.org/wiki/Gish_gallop\n\nThe way it might go is that an uncharitable discussion partner will write long posts with very little substance in which they repeatedly ask the same questions, or sortof \"play dumb\" and ask for explanations for things which have been discussed *extensively* in the past.\n\nI notice it here, but I notice it on other subreddits as well.  To put on a tinfoil hat for a short second: a lot of times the accounts which engage in this behavior seem to spend an almost *unbelievable* amount of time posting things on reddit, and often only on one subreddit.  So my tinfoil hat question is: are these really good GPT bots?  GPT-3 is *quite* good, and it seems within the realm of possibility that there are conversational-tarpitting bots that exist.\n\nMy question is: has anybody else noticed this behavior and charted it at all?  If so how do you identify it and what framework do you use for thinking about it?",
    "permalink": "/r/TheMotte/comments/w7h8wa/culture_war_roundup_for_the_week_of_july_25_2022/ihlhqm0/"
  },
  {
    "kind": "t1",
    "id": "ihl4atv",
    "author": "codergenius",
    "score": 9,
    "createdUtc": 1658761846,
    "body": "*Apologies for posting multiple times at once. Posting here because I thought that it would be too culture-wary for the small questions thread*\n\n**What is the actual difference between arranged marriages vs love marriages (failure modes, happy paths, why would be one be better than the other based on certain frameworks, and so on)?** \n\nAfter looking on the internet, I found that the differences account for context to be already present. I found out that I could not grok that context as I am too \"autistic\" (God I hate that word, along with nerdy). I am trying to understand it as an alien that has come to the earth for the first time or in the rationalist terms, I am trying to taboo the words \"love\", \"arranged\" and \"marriages\".   \n  \nI would really like views with the framework stated, if that is not too much or better yet, links to forums that you have seen where these concepts are discussed in detail. Thanks.",
    "permalink": "/r/TheMotte/comments/w7h8wa/culture_war_roundup_for_the_week_of_july_25_2022/ihl4atv/"
  },
  {
    "kind": "t1",
    "id": "ihkqcw6",
    "author": "Sorie_K",
    "score": 18,
    "createdUtc": 1658755905,
    "body": "A follow up from [my post](https://www.reddit.com/r/TheMotte/comments/w1s5b7/culture_war_roundup_for_the_week_of_july_18_2022/ih7jtj4/?context=3) about oil prices a few days ago.\n\nOne of the sub-questions I was curious about was why oil companies weren’t investing more in digging new wells.  A few commenters replied that this was probably because of Biden – he opened up his term by cancelling the Keystone XL pipeline, removing permits on drilling on federal lands and saying we should move towards fully green energy.  My reply was that Obama basically did all that stuff too and oil production doubled under him, so are these kinds of regulatory policy moves really that important to investors?\n\nUsers u/LeninLovedUncleTom and u/Pulpachair offered more information on how technology breakthroughs and the relatively high price of crude oil opened up the new shale market under Obama and led to that crazy growth.  But there’s still a lot of shale and crude prices are crazy high again and no one’s drilling.  I think [both](https://www.reddit.com/r/TheMotte/comments/w1s5b7/comment/ih8bt2a/?context=3) [users](https://www.reddit.com/r/TheMotte/comments/w1s5b7/comment/ih89f6l/?context=3) made compelling arguments (if i followed them), substantiated with the articles I can find with quotes from oil leaders, that the primary driver of investment isn't really regulatory policy, it's the fact that everyone is too worried about massive market fluctuations.  OPEC cratered prices after the initial shale boom and hurt a lot of investors, and Covid saw barrels going for negative prices.  Who wants to invest in drilling more when the market could switch up on you and completely destroy your profits?  [To quote](https://www.bloomberg.com/news/articles/2022-02-18/shale-wildcatters-send-bullish-oil-price-signal-with-output-restraint):\n\n&gt;“Whether it’s $150 oil, $200 oil, or $100 oil, we’re not going to change our growth plans,’’ Pioneer Chief Executive Officer Scott Sheffield said during a Bloomberg Television interview. “If the president wants us to grow, I just don’t think the industry can grow anyway.’’\n\nI think here this offers us two possibilities, with two questions I’d ask everyone.\n\n1:  If we assume government policy can’t make a huge difference on oil investment relative to the market, and the market experiences such dramatic fluctuations that investors literally won’t invest in drilling more even when it would be profitable, and that this common sense market rationale means we all have to eat high gas prices: is this not an extremely strong argument for trying to divest away from oil?  To invest full scale in nuclear and renewables (edit: and battery storage technology) and microgrids and the infrastructure to make electric vehicles possible and widespread?\n\nMuch is talked about the intermittency issues with renewables, but should the fact that Russia and China each control 15% of the world’s oil production, and petroleum sales can always be used as a carrot or stick in conflicts like the current one, and that we don’t have the ability to control OPEC with their further 44% of the world’s production – shouldn’t all this be seen functionally as an broad scale intermittency problem as well?  You can address shortfalls with wind and solar in a number of ways, like using combined heat and gas systems or only using them to complement nuclear power, but in crisis situations where 15% of the world’s oil disappears off of the western markets there doesn’t seem to be any quick fix – our oil companies outright say the won’t drill more no matter what the president does!\n\nI’m well aware this would be a cost intensive and technologically challenging road, and that renewables in particular have other huge limitations and could perhaps never fully fill the gap fossil fuels played, but wouldn’t shrinking our fossil fuel dependency alone go significantly far towards reducing our exposure to these kinds of crises?  Would the eventual problems we might face in a country that invested to the hilt in electric cars, nuclear energy, renewable energy systems and decentralized microgrids be worse than what we’re dealing with now?  Would it be worse than the fact that our country is always vulnerable having the pipe turned off from the outside?\n\n2:  Alternatively, maybe none of the obvious stuff Biden could do would help oil.  But let’s pretend he can - what if he did all the non-obvious stuff as well?  What if Biden completely deregulated oil, cut their taxes down to zero, gave them (more) massive subsidies and promised to insure any losses from market fluctuations, slashed wages, cut all zoning laws, worker’s rights, safety regulations and environmental regulations and finally got domestic oil production to rise.\n\nWould it be worth it?\n\nSometimes I’m jealous of China’s powerful industrial base.  Then I think about their horrendously polluted waterways and their skies full of smog and their workers paid pittances to labor for crazy hours in often unsafe conditions, and I wonder if it would be worth having to do all that to compete with them on some kind of even footing.\n\nWould it be worth producing two, three, four times as much oil, enough that we have dominance over the world price and never have to worry about this situation again, if we also had to trade away our centuries of hard-fought worker’s rights? If all of our gorgeous national parks were studded with oil wells and refineries and our waterways and skies groaned under the weight of their pollution?  This is an exaggerated example to be sure, but in a world where oil executives outright say the President’s normal policy levers won’t change their investment outlook, it bears worth asking: how much are we actually willing to give up to change that?",
    "permalink": "/r/TheMotte/comments/w7h8wa/culture_war_roundup_for_the_week_of_july_25_2022/ihkqcw6/"
  }
]
