[
  {
    "kind": "t1",
    "id": "if8qh52",
    "author": "SensitiveRaccoon7371",
    "score": 1,
    "createdUtc": 1657220027,
    "body": "**So, what went wrong for Boris Johnson?**\n\nBack in 2019 Boris was flying high securing a huge majority in the elections and seeing off the challenge of Corbynism. He was \"getting Brexit done\" and successfully broke through the red wall of Labour voters in middle England. With the left sinking more and more in the morass of identity politics, the conservatives were well-positioned to win the working-class voters who were fed up with woke politicians playing to the prejudices of the urban professional-managerial class. In 2020 with the spread of BLM fads in the summer of race riots in America the conservative government had successfully posed as defenders of history and tradition against the ignorant rioters. Their performance on covid was also praised because Brexit enabled the government to avoid being yoked to the inefficient Brussels bureaucracy. Given the continuing culture wars, with their leftist opponents reliably picking the wrong side, it seemed that the conservatives were poised to just keep winning.\n\nYet today Johnson has resigned. This came after a bunch of his ministers quit the government in the last 48 hours. Boris was stampeded to the exit by his own party, shrugging  in his resignation speech that \"them's the breaks\". Notably for all the comparisons to Trump, this never happened to the latter for the GOP was much more house-trained under Trump than the Tories ever were under Johnson. This has already been described as a slow-moving coup perpetrated by the liberal media with their never-ending drip-drip of various \"scandals\" and \"-gates\" which panicked conservative MPs and whetted their appetites for back-stabbing once they smelled the blood in the water. Ultimately, Johnson has only himself to blame because losing control of your own party in a parliamentary system is fatal.",
    "permalink": "/r/TheMotte/comments/vr0t4v/culture_war_roundup_for_the_week_of_july_04_2022/if8qh52/"
  },
  {
    "kind": "t1",
    "id": "if7s8d3",
    "author": "Rov_Scam",
    "score": 1,
    "createdUtc": 1657206773,
    "body": "**Is This the End of Newsmax and OAN?**\n\nThis is coming a bit late, but over the past month or so, a court in Delaware has denied motions to dismiss in Dominion's lawsuits against Newsmax and Fox News. The court hasn't ruled on a similar suit against OAN yet but, given that it is, in my opinion, the strongest of the three, I'd be willing to bet that this one moves forward as well. Dominion is suing these media companies for defamation, claiming that statements concerning their Venezuelan ties, role in rigging the 2020 election, etc. have damaged their business to the tune of billions of dollars. \n\nThe reason I'm seriously wondering if these two networks are finished is because, with these rulings, Dominion has cleared the biggest hurdle of the lawsuit. When defamation involves public figures and matters of public interest (as this defamation undoubtedly does), plaintiffs must show that the defendant acted with \"actual malice\"; that is, they must prove that the defamatory statements were made either with the express knowledge that they were false or with reckless disregard for their truth or falsity. This is a tough standard to meet and is why celebrities haven't put supermarket tabloids out of business. Media companies in the United States are given pretty wide latitude to report on rumors, allegations, and other items where certainty isn't exactly bulletproof. But if they have actual knowledge that something is untrue, and publish it anyway, they can be held liable. \"Reckless disregard\" is much slipperier, but the general idea is that if you have piles of evidence that strongly suggest that something isn't true you can't just publish it without cautionary language indicating the uncertainty surrounding it. As a caution, I'm only explaining all this to provide context for how this case may play out. I'm not interested in debating whether it's fair that something some liberal network said should be considered defamatory, because first, these cases are very fact dependent and I don't know all the facts about hypothetical MSNBC cockups, and, second, it's irrelevant unless there's actually a lawsuit. \n\nAnyway, this standard is notoriously difficult to meet, mainly because most entities worth suing are sufficiently sophisticated to avoid making false statements of fact. It should also be noted that the decisions don't conclusively say that the networks acted with actual malice, simply that Dominion has alleged enough facts that a reasonable jury could conclude that they acted with actual malice. I'd also note that I left Fox out of the headline because the case against them appears to be significantly weaker than the cases against Newsmax and OAN, and in any event they are more likely to be able to pay a settlement or verdict. Having failed to get a motion to dismiss, the networks can assert a number of defenses:\n\n**Truth:** I doubt they'll actually assert this, as it would essentially involve proving that Dominion has ties to Hugo Chavez and created software designed to rig the election. If the networks had any evidence of this they wouldn't have held onto it to be used in a future lawsuit.\n\n**Statement of Opinion:** Opinions are protected under the First Amendment. However, merely couching a defamatory statement as an opinion isn't enough to overcome a defamation claim; the courts aren't going to make it so you can get away with anything as long as you preface it with \"I think.\" This is one defense the networks are likely to assert, but proving it is going to be difficult. Given the sheer amount of coverage OAN and Newsmax gave to the Dominion allegations (with OAN seemingly airing Mike Lindell documentaries as fast as he could produce them), claiming that they were merely expressing an opinion with no intention of presenting the reporting as factual is going to be a hard sell.\n\n**Privilege:** Occasionally, there are certain situations where one is privileged to make defamatory statements without consequence. These usually relate to official proceedings—court testimony, legislative sessions, etc. The one privilege that Newsmax, in particular, is claiming is a \"neutral reportage\" privilege that says in essence that when public figures make statements about matters of public concern, news organizations are privileged to report those allegations without fear of defamation. There are two obvious problems with this defense. The first is that it is derived from certain Circuit Court decisions that imply it's a First Amendment issue. This means that it's not a recognized common-law defense and isn't necessarily a protected constitutional right. So Newsmax is arguing that a state court should apply precedent from a Federal court that isn't even controlling over the entire Federal Court system; in effect, they want a Delaware court to give non-controlling law the force of a constitutional imperative, which isn't exactly firm footing. The second problem is that even if the court takes them up on their offer, it's highly unlikely that Newsmax meets the criteria required for protection. Without listing all the elements, it's clear that the privilege, to the extent that it exists, is intended to protect media agencies who neutrally and dispassionately report the contents of defamatory allegations without taking sides. Newsmax and OAN became All Fraud All the Time for months following the election, and repeatedly had guests like Sidney Powell repeating the allegations to sympathetic interviewers who offered little to no pushback, and in many cases parroted the allegations themselves. It's unlikely that any reasonable person could have watched either network's coverage of the election challenges for any period of time and come to the conclusion that they weren't putting forth any particular point of view. \n\n**Retraction:** If a defendant retracts the defamatory statements in a timely manner it will usually serve as an effective defense. This is a nonstarter her, however, since Dominion repeatedly asked the networks to issue retractions and not only did the networks refuse, but continued airing defamatory material in spite of these requests.\n\nGiven that the Actual Malice hurdle has been cleared and the available defenses aren't good, I'd say that the chances of a jury verdict are pretty high. The only real question is damages, but given that they're confident in asking for over a billion dollars, even a significant reduction would still be disastrous for Newsmax and OAN. These aren't large networks with a ton of cash lying around, and this probably wouldn't be their only debt. If a jury awards a tenth of what Dominion is asking they're probably looking at bankruptcy.\n\nThe most obvious counterargument to this is \"If the networks' cases are so bad, they'll just settle.\" The problem with this is that the networks couldn't offer any amount of money to make it worth it for Dominion to settle (the exception is Fox, but the case against Fox is much weaker and Fox has more money). Dominion isn't suing second-tier networks because it expects to get a lot of money. It's suing them to get vindication and rehabilitate their public image. The biggest issue for Dominion moving forward is that the taint of these allegations makes it difficult for them to get contracts. If a county is looking to replace its voting machines or renew an existing contract with Dominion, there is going to be a certain amount of public pressure to go with another vendor \"just to stay on the safe side\". I don't know the ins and outs of every state's bidding  procedures to know if a county can be forced into accepting a Dominion contract, but if there's any room for discretion a county may opt to ignore Dominion entirely just to avoid any possible controversy. The potential damages are unknowable, and Dominion is obviously erring on the high side, and Dominion knows that it can't possibly hope to recover for all the damage the allegations did. What they can hope for, however, is that a jury verdict stating not only are the allegations unproven or lacking in evidence (as some of the Powell lawsuit dismissals implied), but are demonstrably and indisputable false. False to the point that we're making those who repeated them publicly pay large sums of money. It's not perfect, but it's probably the best Dominion can hope for.",
    "permalink": "/r/TheMotte/comments/vr0t4v/culture_war_roundup_for_the_week_of_july_04_2022/if7s8d3/"
  },
  {
    "kind": "t1",
    "id": "if66ryn",
    "author": "SebJenSeb",
    "score": 1,
    "createdUtc": 1657171002,
    "body": "short post, but are there any legitimate arguments against the genetic race/iq stuff anymore?",
    "permalink": "/r/TheMotte/comments/vr0t4v/culture_war_roundup_for_the_week_of_july_04_2022/if66ryn/"
  },
  {
    "kind": "t1",
    "id": "if4jc0o",
    "author": "MelodicBerries",
    "score": 27,
    "createdUtc": 1657142757,
    "body": "**The death of the American Middle-Class**.\n\nMuch has been written about this topic in terms of outsourcing or trade, but the NYT has a decent [data-rich article](https://archive.ph/m93RC) showing how US cities are increasingly bifurcated onto \"poor\" or \"rich\" areas with a disappearing middle. \n\nA few excerpts:\n\n&gt; And in Orlando, nearly 70 percent of area residents lived in “average” neighborhoods back in 1990, according to census data. In 2020, the same was true for just 46 percent.\n\n&gt;That leaves a lot of people feeling like they are on the outside looking in.\nMichael Street is a union electrician who moved from Nashville to Goodlettsville about 25 minutes away. \n\n&gt;He said he spent his days driving around Nashville, working on houses that have all been rehabbed, rebuilt or rendered unrecognizable in neighborhoods he can no longer afford.\n“Either you’re poor, or you’re rich,” he said. “Middle class is kind of phasing out. Either you have a lot of money, or you’re just barely getting by.”\n\nThis raises a few questions. First, should we aim for a more evenly balanced income distribution in residential areas? If not, should we at least try to mix people socio-economically even if they don't live in the same neighbourhoods? This seems to be the underlying premise of the article. \n\nSecond, is it even possible to achieve? The forces of self-segregation appear to be structural. It's an important reminder that while the US remains obsessed about race, class is often just a salient issue, if not more so.",
    "permalink": "/r/TheMotte/comments/vr0t4v/culture_war_roundup_for_the_week_of_july_04_2022/if4jc0o/"
  },
  {
    "kind": "t1",
    "id": "if4iq46",
    "author": "Fevzi_Pasha",
    "score": 24,
    "createdUtc": 1657142503,
    "body": "[Ask HN: I’m 41 and still unmarried – what should I do?](https://news.ycombinator.com/item?id=31961992#31970883)\n\nA woman asked the above question to hacker news (central Internet forum for tech nerds and entrepreneurs) and the discussion is just fascinating for many reasons. Totally recommended to read all the comments at least in the first page to get a good display of how different priors and communication methods people have for such a central issue in human life. \n\nThe whole thing made me wonder.. what should one actually say if a friend in this exact situation (assuming this lady isn’t purposefully lying about anything) asked for help? Any ideas? This forum focuses a lot on the male side of dating so I am curious",
    "permalink": "/r/TheMotte/comments/vr0t4v/culture_war_roundup_for_the_week_of_july_04_2022/if4iq46/"
  },
  {
    "kind": "t1",
    "id": "if42mlj",
    "author": "bulksalty",
    "score": 37,
    "createdUtc": 1657135770,
    "body": "On the topic of spooky culture war items, someone [blew up](https://news.yahoo.com/georgia-guidestones-explosion-live-large-171102114.html) one of the stone pillars that make up the Georgia Guidestones.  \n\nFor those not familiar the [Georgia Guidestones](https://creepycatalog.com/georgia-guidestones-a-complete-guide/) are a monument created by a secretive person or group that list a set of guidelines for some post apocalyptic society.  One of the most famous guidelines is to maintain the human population at 500 million.  \n\nThey've been pretty popular in conspiracy circles since their mysterious creation.",
    "permalink": "/r/TheMotte/comments/vr0t4v/culture_war_roundup_for_the_week_of_july_04_2022/if42mlj/"
  },
  {
    "kind": "t1",
    "id": "iezyfh8",
    "author": "Primaprimaprima",
    "score": 47,
    "createdUtc": 1657058601,
    "body": "**On The Concept of Male Entitlement**\n\nAs an example to get the ball rolling: [Feminism and the Question of Theory](https://ravenmagazine.org/magazine/feminist-critical-consciousness-and-the-question-of-theory/)\n\n&gt;The men who engage in sexual assault are not, as the narrative goes, hapless victims of changing sexual mores. They are, at worst, pretending they don’t know that what they are doing is wrong; or, what is almost as bad, they are utterly clueless: they are unable or unwilling to listen to women because their own sense of entitlement drowns out everything else.\n\nThe concept of \"entitlement\" is frequently used in feminist discourse to explain male sexual behavior, particularly in cases of rape and sexual assault.  I am skeptical of this concept and its explanatory power, and I'll attempt to outline why.\n\nMy own personal theory is that male sexual behavior, good and bad, is largely explained by the fact that men simply desire to engage in the sexual acts that they carry out, in the same way that the fact that people eat food is largely explained by the fact that people get hungry and food tastes good.  My intention in this post is not to defend the desire theory though - it's just to critique the entitlement theory.\n\nActually, I'm skeptical that the idea of \"acting out of a sense of entitlement\" is even coherent.  Entitlement seems to me, first and foremost, to be an objective relation that obtains between you and something else, not a psychological attitude that you take towards something else.  To be entitled to X is to be in a legal or social relation with X that grants you control over or access to X.  Your attitudes and motivations don't enter into the picture.  \n\nIndeed, when I try to imagine thought experiments where I or someone else is primarily motivated to act by a \"sense of entitlement\", I'm not sure if I can do it.  It always seems more appropriate to use other concepts to explain the motivations instead - raw desire, or protecting one's wounded pride, or maintaining the coherence of one's self-image, or any number of things.  But it's hard to think of a scenario where \"entitlement\" seems like an appropriate psychological concept to explain someone's motivations.  Ultimately, it seems that it's just a sneer-like word, too pre-loaded with moral judgment to be explanatorily useful.\n\nIt seems more plausible to defend the idea that someone could act out of a *mistaken belief* that they are entitled to something, rather than acting out of raw entitlement itself.  These sorts of scenarios are much easier to imagine.  But is this what men actually do?  I think not.  What man actually believes that he's entitled to sexual access to women in today's Western society?  I've seen no evidence that any sizable number of men actually believe this, but I've seen plenty of evidence to the contrary.\n\nConsider the discourse that circulates in \"manosphere\", \"The Red Pill\", and \"pick-up artist\" forums.  I don't know how you can walk away with any belief other than that these men are *acutely* aware that they are *not* entitled to sexual access to women in any way.  They become completely obsessed with the idea of self-improvement, because the only alternative in their view is dying bitter and alone.  Every day is a constant Darwinian struggle against other men for access to extremely scarce reproductive resources.  Even if they are able to secure a long-term relationship or even marriage with a woman, they are never allowed a moment's rest.  They constantly have to be on top of their game, always striving to assert dominance, otherwise their woman will leave them for Chad Thundercock at the drop of a hat.  How could anyone think that this paints a psychological portrait of an entitled individual?\n\nGiven the flaws with the entitlement theory, why are feminists so attracted to it?  I have two hypotheses:\n\nOne is a simple failure of imagination on the part of women.  In the female experience, there is no analogue of male sexual desire.  (Probably there are many feminists who reject the idea that men and women experience sexual desire differently at all).  Women have a hard time believing that men could really just want sex *that fucking much*, to the point that it drives men to do the sorts of insane and violent things that men are known for.\n\nThe second is that feminism demands a theory of male sexual desire that renders it socially mutable.  If men do what they do because of biological drives, then that means we just have to live with it, which is horrifying.  But if men do what they do because they've been instilled with a false sense of entitlement, then we can just educate them on the appropriate way to have relations with women and everything will be fine.  So the thinking goes.  I make no judgments here - I'm just outlining my thinking on why feminism is structurally predisposed to adopt certain theories over others.\n\nOf course, I don't think that male sexual behavior *entirely* reduces to basic biological desires.  Certainly sexual behavior can be rooted in other motives as well, like social validation.  But I'm skeptical that entitlement has a role to play in the overall picture.",
    "permalink": "/r/TheMotte/comments/vr0t4v/culture_war_roundup_for_the_week_of_july_04_2022/iezyfh8/"
  },
  {
    "kind": "t1",
    "id": "iezttog",
    "author": "tricksandcandlewicks",
    "score": 63,
    "createdUtc": 1657056696,
    "body": "In other news, [a large farmer's protest is going on right now in the Netherlands](https://www.reuters.com/world/europe/dutch-farmers-protest-by-blocking-supermarket-distribution-centres-2022-07-04/). This bears a similarity to the trucker's protests in Canada in the mode of operation - large vehicles blockading key roads and chokepoints. The difference here is that the issue they are protesting is much more directly threatening their livelihoods - the Dutch government wants farmers to reduce livestock counts and fertilizer use to reduce Carbon emissions. Naturally, this would be a great blow to the farmer's incomes and ability to keep the surrounding areas well fed.\n\nIn fatter times, I would expect that the Dutch government and the EU could easily get away with crushing this kind of protest. When Europe is already reeling from supply chain issues and the declining availability of cheap Russian gas and covid overregulation harming business, this seems more and more like it could start seriously harming the camel's back. If people start going hungry and the German economy collapses, that's probably the end of the EU. \n\nSpeaking as an American, though, I have no idea what local reactions to this protest are - would like to hear some. Or steelmanning all of the recent decisions made by European politicians in regards to climate and energy policies and Russia - these in concert completely baffle me in their capacity for self destruction.",
    "permalink": "/r/TheMotte/comments/vr0t4v/culture_war_roundup_for_the_week_of_july_04_2022/iezttog/"
  },
  {
    "kind": "t1",
    "id": "iez9pon",
    "author": "Texas_Rockets",
    "score": 10,
    "createdUtc": 1657048612,
    "body": "There are many, many valid reasons to oppose the overturning of Roe. But I think it’s dangerous and inaccurate to frame this solely as women’s rights being taken away. That’s absolutely an element, but we need to be cognizant that we’re not just talking about a Pap smear here. Framing this as only being an issue of womens rights necessarily means that anyone who supported the ruling is literally just out there to rescind the rights of women. And that misses that, ultimately, abortion laws are about at what point a fetus becomes a life, and therefore at what point it becomes wrong. Most people agree that late term abortions are wrong, so I think most concede that to some extent. But those who supported this ruling did so because they think that a fetus is a human almost immediately. To me this really just illustrates the detrimental and all-consuming impact of identity politics, in which everything is viewed first and foremost with respect to one’s identity. There are important factors outside of that and that is not always the primary consideration. \n\nReally, though, what I want to drive home is that viewing this solely in terms of women’s rights guarantees that you miss the other sides POV and necessarily means they are just evil people. And failing to consider this ensures that this debate is never actually going to reflect the real issue here. People are just going to view it as good v evil. And I wanna be clear here and say that I am not defending those who supported the ruling.",
    "permalink": "/r/TheMotte/comments/vr0t4v/culture_war_roundup_for_the_week_of_july_04_2022/iez9pon/"
  },
  {
    "kind": "t1",
    "id": "ieywk50",
    "author": "LacklustreFriend",
    "score": 48,
    "createdUtc": 1657043378,
    "body": "####Illiteracy of Christianity\n\nApologies for the rambling tone.\n\nI recently started playing *Wasteland 3* and been having a lot of fun. Early on in the game, there is [a cover](https://www.youtube.com/watch?v=cXeHwhLPKz8) of the Christian hymn [*Are You Washed in the Blood?*](https://en.wikipedia.org/wiki/Are_You_Washed_in_the_Blood) that plays as part of a dramatic setpiece battle. I found the cover really quite catchy, and went to listen to it outside the game and find the original hymn (I hadn't heard it before). Apparently I wasn't the only one who enjoyed the song and many other Wasteland 3 players did the same. However, I found their comments on the 'genuine' renditions by actual Christian artists to be very strange to me. They frequently describing the tone and lyrics (and the Youtube comments of Christians) on the song as 'creepy' or 'cultish'.\n\nIt's obvious why people find the Wasteland 3 version creepy. It's a pretty sinister sounding rendition and you hear it when you the player are fighting a post-apocalyptic inbred redneck cult family while destruction and blood surround you. The 'genuine' versions are more tricky. Clearly [many Christians listening to the hymn](https://www.youtube.com/watch?v=bJWgpljckbA) don't feel it's creepy, but fulfilling and positive.\n\nMaybe the non-Christians finding it creepy have a point. Lyrics like \"washed in the Blood of the Lamb\" and \"are your garments spotless\" do sound very strange or creepy devoid of any context. But these lyrics *aren't* devoid of context, it's clearly a Christian hymn. Rather, non-Christians (secularized Americans) don't *understand* the context. They don't know what the 'Blood' or 'Lamb' means or represents. They are illiterate of the language of Christianity. As a cultural/lapsed Catholic, I wouldn't consider myself *fluent* in 'Christian', but I'm certainly literate enough that I don't find the lyrics of the song creepy and can easily understand their meaning.\n\nIt's like hearing an idiom literally translated from another language. e.g. the Swedish idiom '*to shit in a blue cupboard*'. Removed from its linguistic and cultural home makes it sound like the Swedes are crazy. There was an image that reached the front page of reddit recently of [an ethnic group in Indonesia that exhumes their ancestors' bodies to dress them up and spend time with them](https://old.reddit.com/r/interestingasfuck/comments/vqeptq/the_toraja_people_in_indonesia_periodically_dig/), something that would seem absolutely ghastly and creepy to many Westerners despite being a positive and joyous event for this ethnic group.\n\nThis is not really a brand new thought for me, but rather this was just a crystalizing event. I recall a [public lecture from Camile Paglia](https://www.youtube.com/watch?v=nvmTHQviAHM) where she describes teaching a class 15 years ago on the art of song lyrics where she was playing the hymn 'Go Down Moses'. After a lack of engagement from the students, she came to the shocking revelation that virtually none of the students knew who Moses was. Seemingly the only engagement contemporary secular America has with Christian themes is negative, cynical and superficial portrayals in media. Typically some evil redneck evangelical doomsday cult that serves as than antagonist who is more that happy to use Christian symbols in their evil plans. Obviously *Wasteland 3*, but media like *Farcry 5* or the Netflix movie *The Devil All The Time* and many others. Sure, Americans might know some superficial details, like Christmas being the celebration of Jesus' birth, but they have no real understanding of Christianity.\n\nThe reason I think this is important for the US (and its cultural sphere) is it renders secular Americans unable to communicate, understand and ultimately find common ground with American Christians, who still make up a sizable portion of the US population. I don't believe this was the case in the past (though I have no strong evidence), where secular individuals or even atheists understood Christianity in the broad sense, being an important part of American life. It also breeds hostility, as there is a tendency to view people one cannot understand with suspicion (exacerbated with the negative portrayals of Christianity in media). I also suspect this illiteracy is largely unidirectional too, as most Christians are exposed to the glut of secular/liberal media that exists.\n\nEdit: Just to add an addendum, I do wonder what the consequences of this are. A lack of understanding of the cultural history of the West, a lack of understanding of the most influential moral system in the word, is this a void that secular religions are rushing to fill? Is America truly culturally secular now?",
    "permalink": "/r/TheMotte/comments/vr0t4v/culture_war_roundup_for_the_week_of_july_04_2022/ieywk50/"
  },
  {
    "kind": "t1",
    "id": "iey8d9l",
    "author": "naraburns",
    "score": 40,
    "createdUtc": 1657033798,
    "body": "I'm seeing some discussion of [this paper](https://journals.sagepub.com/doi/full/10.1177/00323292221100220) popping up on [Twitter](https://twitter.com/MattGrossmann/status/1544319680441098240/photo/1), and I think some of you might be interested (though you'll need SAGE database access if you want to read the full thing).\n\nAs the political scientist who shared this notes:\n\n&gt; Across 21 countries, the left has lost most support among low education, high income voters. Left gained most among high education, high income votes, but only reached parity there. So left support is now concentrated among high education low income voters.\n\nI've skimmed the paper, and it does not appear to raise any discussion of Peter Turchin's [elite overproduction](https://en.wikipedia.org/wiki/Elite_overproduction), but I feel like that is the natural direction to take the research.  Here is a bit from the conclusion:\n\n&gt; The emerging party positioning in the policy space has led to a deteriorating partisan representation for high-education/high-income and--especially--low-education/low-income citizens. While liberal parties in some countries adopted right-libertarian positions that are attractive to high-education/high-income voters, the main party on the right typically drifted toward authoritarian positions. Low-education/low-income voters fared worse: in no country [of the 21 studied] do viable left-authoritarian parties exist. Without obvious political homes, therefore, the low-education/low-income and high-education/high-income groups have become cross-pressured voter groups--up for grabs--between the left and right fields of parties.\n\nOf course, many people live in countries ruled by left-authoritarian parties; most of those people are Chinese.  I doubt many will be surprised to hear that wealthy democracy is incompatible with redistributionist authoritarianism; to me it sounds like a clear contradiction in terms.  But the specific data on how \"polarity reversal\" happens *given* cross-pressured voter groups seems interesting.",
    "permalink": "/r/TheMotte/comments/vr0t4v/culture_war_roundup_for_the_week_of_july_04_2022/iey8d9l/"
  },
  {
    "kind": "t1",
    "id": "iexyxng",
    "author": "CoventryDemon",
    "score": 5,
    "createdUtc": 1657029763,
    "body": "I don't know where else on Reddit to put this so it's going here: Every argument about abortion that I've seen both the Right and the Left use is utter garbage. \n\nThe right:\n\n* No. The left is not out to \"kill babies\". (see below under the left)\n* The bible doesn't ban abortion and nor should your religion dictate what others do.\n* The idea that a clump of cells is a person is ridiculous. \n* In Ohio, right wing policymaking just denied an abortion to a raped ten year old. \n* Preaching adoption and then not adopting any kids smacks of hypocrisy. \n\nThe left: \n\n* The people on the right believe that abortion **kills a baby**. The folks on the left don't agree with that, but insist on ignoring this motivation. I cannot tell you how disingenuous this is. \"Your motivation isn't what you say it is, but instead is whatever I get to define it as\". It is nothing more than the other side of the coin to \"the left is out to kill babies\". Taking the worst argument of the right and inverting it is unforgiveable. \n* Your body autonomy arguments are all incoherent. Each and every one of them is perfectly cogent so long as you assume the fetus inside you isn't a person. The right has already assumed the fetus is a person so the argument is a non-starter. To the right, it's like saying, \"If I was at the edge of the cliff and someone was hanging onto my arm so as not to fall into a chasm and die, it's TOTALLY not murder for me to shake them off my arm. Because it's **my** arm and they're not allowed to use it!\" It's an echo chamber argument that has zero chance of convincing the opposition. \n* Instead of spending the age of social media trying to win over hearts and minds, you have taken every opportunity to silence yourself to the people who need your voices the most. How many times have we seen \"If you agree with \\[insert right wing policy\\] then unfriend/unfollow/etc. me!\" You should have been working to reach people this whole time, but you didn't.",
    "permalink": "/r/TheMotte/comments/vr0t4v/culture_war_roundup_for_the_week_of_july_04_2022/iexyxng/"
  },
  {
    "kind": "t1",
    "id": "iexrshj",
    "author": "JTarrou",
    "score": 26,
    "createdUtc": 1657026316,
    "body": "A short bit of [anecdata](https://thenewdaily.com.au/opinion/2022/07/02/the-stats-gug-indigenous-census/) from Australia about the rise of self-identification among aboriginal Australians.\n\n&gt;One figure, more than anything else, jumped out at me. Australia’s Indigenous population went up steeply to 813,000 people (3.2 per cent of the population).  \n&gt;  \n&gt;This increase of 25 per cent compared to 2016 data is huge. Obviously, this increase can’t, by definition, be driven by migration and wasn’t the result of an outrageously high birth rate either. Rather, more people self-identified as Indigenous on the census form.\n\nThis is a wonderful thing:\n\n&gt;We collectively created an environment where more people are confident enough to proclaim their heritage loudly and proudly.\n\nBut, of course, they run into the Warren Paradox.\n\n[https://cphce.unsw.edu.au/news-events/news/2017/01/introducing-chetres-new-indigenous-health-lead-suzanne-ingram](https://cphce.unsw.edu.au/news-events/news/2017/01/introducing-chetres-new-indigenous-health-lead-suzanne-ingram)\n\n[https://en.wikipedia.org/wiki/Lidia\\_Thorpe](https://en.wikipedia.org/wiki/Lidia_Thorpe)\n\n[https://womensagenda.com.au/latest/10-indigenous-women-blazing-a-trail-in-australia-today/](https://womensagenda.com.au/latest/10-indigenous-women-blazing-a-trail-in-australia-today/)\n\n[https://edition.cnn.com/2017/03/05/asia/her-linda-burney-australia/index.html](https://edition.cnn.com/2017/03/05/asia/her-linda-burney-australia/index.html)",
    "permalink": "/r/TheMotte/comments/vr0t4v/culture_war_roundup_for_the_week_of_july_04_2022/iexrshj/"
  },
  {
    "kind": "t1",
    "id": "iewbcpg",
    "author": "SlightlyLessHairyApe",
    "score": 53,
    "createdUtc": 1656989597,
    "body": "## Followup Monday\n\nA [while ago](https://www.reddit.com/r/TheMotte/comments/ijs526/culture_war_roundup_for_the_week_of_august_31_2020/g40dx0u/) u/mcjunker opined that in 18 months after election, Biden would be less popular than Trump. \n\nIn retrospect, it's not clear if this was meant as \"at the same point in their presidency\" or \"at that moment\", although I lean towards the former since approval ratings of those not in office isn't usually a topic of discussion. \n\nIn that case, this seems to be narrowly [coming true](https://www.cookpolitical.com/analysis/national/national-politics/two-different-paths-41) by a few percentage points, just barely enough past the margin of error on the polls to call it anyway.",
    "permalink": "/r/TheMotte/comments/vr0t4v/culture_war_roundup_for_the_week_of_july_04_2022/iewbcpg/"
  },
  {
    "kind": "t1",
    "id": "ieuxana",
    "author": "MustPavloveDogs",
    "score": 8,
    "createdUtc": 1656965404,
    "body": "I love reading and thinking about the future of robotics and artificial intelligence, and am a fan of works such as Blade Runner/Do Androids Dream of Electric Sheep?, iRobot, and other media that explores the possibilities of artificial intelligence. I don't have the most sophisticated understanding of them, but I enjoy discussing them with others.\n\nAssuming that 1) We develop androids that can pass the Turing Test and 2) Humanity doesn't destroy itself before we reach this point, how do you imagine the fight for android rights, the possible \"final frontier of civil rights\" playing out?\n\nIt occurred to me that future discussions on android rights could mirror current discussions on transgender rights.\n\n(NOTE: I am NOT at all trying to compare trans people to robots or imply that trans people aren't human. I'm only comparing the discourse around their treatment in society.\n\nAlso NOTE: I'm using the term \"androids\" mostly, but if you'd prefer to focus on AI as a separate thing, that's fine with me)\n\nI imagine one argument against androids being given the same rights as humans would boil down to:\n\n*\"They're not really humans, they're only acting how they think humans behave.\"*\n\nReplace \"humans\" with \"men\" or \"women\" and you've got one of the most common complaints in the current \"trans rights\" discourse.\n\nAssuming we can get through the [Uncanny\\_Valley](https://en.wikipedia.org/wiki/Uncanny_valley) and create androids that look identical to humans in addition to sounding like them--in other words, \"passing\" as human--how does that affect the discussion? Would it be better to have androids that don't look too human, or would that negatively impact their chance for greater rights?\n\nA few other questions to consider:\n\n\\- Will \"robosexual\" and \"robophobia\" become mainstream terms?\n\n\\- Will the robots destroy us all before we even get to that point...or perhaps will the debate lead to them destroying us?\n\n\\- Would you be a human ally to android activists?\n\n&amp;#x200B;\n\nI thought this would be a good place to have an intelligent, honest discussion. I hope it's enjoyable for everyone.",
    "permalink": "/r/TheMotte/comments/vr0t4v/culture_war_roundup_for_the_week_of_july_04_2022/ieuxana/"
  },
  {
    "kind": "t1",
    "id": "ieutf9m",
    "author": "urquan5200",
    "score": 43,
    "createdUtc": 1656963715,
    "body": "I was at the doctor's office the other day, and I saw a curious poster on the wall. I can't remember the organization that sponsored the poster, and unfortunately I can't find it online, but I remember the concept it promoted: it was about **moral injury**, which is an idea I'd never heard of before. I looked it up, and apparently [the core concept](https://moralinjuryproject.syr.edu/about-moral-injury/) is about war:\n\n&gt; Within the context of military service, particularly regarding the experience of war, \"moral injury\" refers to the lasting emotional, psychological, social, behavioral, and spiritual impacts of actions that violate a service member’s core moral values and behavioral expectations of self or others.\n\nIn other words, it's the deep spiritual and psychological damage that happens when soldiers are ordered to do things that conflict with their personal moral codes: killing people, taking actions that lead to civilian casualties, having to abandon friends on the battlefield to accomplish the mission. Serious, earth-shattering things like that. Some of the deepest horrors of war.\n\nBut the poster I saw wasn't about the experiences of veterans or the terror of the battlefield. It was about \"a nurse who feels ashamed of having a medical condition because she's a nurse.\"\n\nTo me, this feels like a substantial deviation from the original definition of \"moral injury.\" An \"injury to pride,\" maybe. Or perhaps it's best described as a psychological struggle with unnecessary shame. I'm not saying that a medical professional being ashamed of having a medical condition is a good thing, that there shouldn't be therapies and programs that help people overcome this unnecessary shame and stigma, or that having posters in doctor's offices promoting awareness of this problem is a bad idea.\n\nAll I'm saying is, maybe it's not such a good idea to use the same term to describe this phenomenon that we use to describe soldiers facing the terrible moral horrors of warfare.\n\nI know the medical field is hard. Sometimes earth-shatteringly hard. I know it can sometimes feel like a war-zone, a constant fight against death and injury that can never be won, a perpetual Afghanistan withdrawal. I also know it can be especially hard on nurses, who do so much to keep our hospitals and clinics going and are often under-appreciated (is that too much of a cliché?). I know that the job's so hard that we have a [major nurse shortage](https://www.ncbi.nlm.nih.gov/books/NBK493175/) in part due to high rates of burnout. And I know medical professionals often have to deal with belligerent patients, and sometimes they have to take actions -- like restraining or sedating a delirious patient, or holding someone against their will for a psychological evaluation -- that would be unacceptable in normal life.\n\nBut it just feels wrong to me, equating the experiences of people in a profession whose cardinal rule is \"first do no harm,\" with a profession whose cardinal rule, as set out in international law, is [\"well you can harm *some* people\"](https://www.npr.org/sections/goatsandsoda/2018/06/28/621112394/the-rules-of-war-are-being-broken-what-exactly-are-they). Especially when what's being compared isn't the experience of violating one's moral code and finding one's ethical conception of the self and maybe even the world being shattered, but the personal shame of a nurse who feels like having a serious illness is unfitting for her. (I use a female pronoun not to claim that all nurses are women, although the [vast majority in the United States](https://www.beckershospitalreview.com/hr/gender-ratio-of-nurses-across-50-states.html) are, but because the original poster I saw depicted a woman as the nurse in question.)\n\nThis feels part and parcel of a social tendency that concerns me: the \"social traumatization\" of society, where more and more life experiences are described in terms of trauma and in increasingly intense ways.\n\nMedical professionals experiencing shame because of a personal diagnosis is a problem, and it's a problem I hope they're able to receive help for, so they can move on with their lives and receive proper treatment for the physical ailment. But although it's a problem, it's not an \"I had to kill a man to survive in the trenches, it was either him or me\"-level problem.\n\nRemoving the terminological distinctions between these things, I believe, eliminates essential social and psychological information that helps people contextualize their negative experiences and find peace in overcoming them.\n\nautomod_multipart_lockme",
    "permalink": "/r/TheMotte/comments/vr0t4v/culture_war_roundup_for_the_week_of_july_04_2022/ieutf9m/"
  },
  {
    "kind": "t1",
    "id": "ieu8z57",
    "author": "HlynkaCG",
    "score": 39,
    "createdUtc": 1656954987,
    "body": "Happy fourth of July everyone. If you're one of those people who hasn't read it since Middle School or haven't read it at all the Declaration is a short document, and today is as good a day as any and better than most. \n\n&gt;#IN CONGRESS, JULY 4, 1776 THE UNANIMOUS DECLARATION OF THE THIRTEEN UNITED STATES OF AMERICA#\n`\n&gt;When in the Course of human events it becomes necessary for one people to dissolve the political bands which have connected them with another and to assume among the powers of the earth, the separate and equal station to which the Laws of Nature and of Nature’s God entitle them, a decent respect to the opinions of mankind requires that they should declare the causes which impel them to the separation.  \n\n&gt;We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness. - That to secure these rights, Governments are instituted among Men, deriving their just powers from the consent of the governed, - That whenever any Form of Government becomes destructive of these ends, it is the Right of the People to alter or to abolish it, and to institute new Government, laying its foundation on such principles and organizing its powers in such form, as to them shall seem most likely to effect their Safety and Happiness. Prudence, indeed, will dictate that Governments long established should not be changed for light and transient causes; and accordingly all experience hath shewn that mankind are more disposed to suffer, while evils are sufferable than to right themselves by abolishing the forms to which they are accustomed. But when a long train of abuses and usurpations, pursuing invariably the same Object evinces a design to reduce them under absolute Despotism, it is their right, it is their duty, to throw off such Government, and to provide new Guards for their future security. — Such has been the patient sufferance of these Colonies; and such is now the necessity which constrains them to alter their former Systems of Government. The history of the present King of Great Britain is a history of repeated injuries and usurpations, all having in direct object the establishment of an absolute Tyranny over these States. To prove this, let Facts be submitted to a candid world.  \n\n&gt;He has refused his Assent to Laws, the most wholesome and necessary for the public good.  \n\n&gt;He has forbidden his Governors to pass Laws of immediate and pressing importance, unless suspended in their operation till his Assent should be obtained; and when so suspended, he has utterly neglected to attend to them.  \n\n&gt;He has refused to pass other Laws for the accommodation of large districts of people, unless those people would relinquish the right of Representation in the Legislature, a right inestimable to them and formidable to tyrants only.  \n\n&gt;He has called together legislative bodies at places unusual, uncomfortable, and distant from the depository of their Public Records, for the sole purpose of fatiguing them into compliance with his measures.  \n\n&gt;He has dissolved Representative Houses repeatedly, for opposing with manly firmness his invasions on the rights of the people.  \n\n&gt;He has refused for a long time, after such dissolutions, to cause others to be elected, whereby the Legislative Powers, incapable of Annihilation, have returned to the People at large for their exercise; the State remaining in the mean time exposed to all the dangers of invasion from without, and convulsions within.  \n\n&gt;He has endeavoured to prevent the population of these States; for that purpose obstructing the Laws for Naturalization of Foreigners; refusing to pass others to encourage their migrations hither, and raising the conditions of new Appropriations of Lands.  \n\n&gt;He has obstructed the Administration of Justice by refusing his Assent to Laws for establishing Judiciary Powers.  \n\n&gt;He has made Judges dependent on his Will alone for the tenure of their offices, and the amount and payment of their salaries.  \n\n&gt;He has erected a multitude of New Offices, and sent hither swarms of Officers to harass our people and eat out their substance.  \n\n&gt;He has kept among us, in times of peace, Standing Armies without the Consent of our legislatures.  \n\n&gt;He has affected to render the Military independent of and superior to the Civil Power.  \n\n&gt;He has combined with others to subject us to a jurisdiction foreign to our constitution, and unacknowledged by our laws; giving his Assent to their Acts of pretended Legislation.  \n\n&gt;Trial from punishment for any Murders which they should commit on the Inhabitants of these States.\n\n&gt;For cutting off our Trade with all parts of the world.\n\n&gt;For imposing Taxes on us without our Consent.\n\n&gt;For depriving us in many cases, of the benefit of Trial by Jury.\n\n&gt;For transporting us beyond Seas to be tried for pretended offences.\n\n&gt;For abolishing the free System of English Laws in a neighbouring Province, establishing therein an Arbitrary government, and enlarging its Boundaries so as to render it at once an example and fit instrument for introducing the same absolute rule into these Colonies.\n\n&gt;For taking away our Charters, abolishing our most valuable Laws and altering fundamentally the Forms of our Governments.\n\n&gt;For suspending our own Legislatures, and declaring themselves invested with power to legislate for us in all cases whatsoever.\n\n&gt;He has abdicated Government here, by declaring us out of his Protection and waging War against us.\n\n&gt;He has plundered our seas, ravaged our coasts, burnt our towns, and destroyed the lives of our people.\n\n&gt;He is at this time transporting large Armies of foreign Mercenaries to compleat the works of death, desolation, and tyranny, already begun with circumstances of Cruelty &amp; Perfidy scarcely paralleled in the most barbarous ages, and totally unworthy the Head of a civilized nation.\n\n&gt;He has constrained our fellow Citizens taken Captive on the high Seas to bear Arms against their Country, to become the executioners of their friends and Brethren, or to fall themselves by their Hands.\n\n&gt;He has excited domestic insurrections amongst us, and has endeavoured to bring on the inhabitants of our frontiers, the merciless Indian Savages whose known rule of warfare, is an undistinguished destruction of all ages, sexes and conditions.\n\n&gt;In every stage of these Oppressions We have Petitioned for Redress in the most humble terms: Our repeated Petitions have been answered only by repeated injury. A Prince, whose character is thus marked by every act which may define a Tyrant, is unfit to be the ruler of a free people.  \n\n&gt;Nor have We been wanting in attentions to our British brethren. We have warned them from time to time of attempts by their legislature to extend an unwarrantable jurisdiction over us. We have reminded them of the circumstances of our emigration and settlement here. We have appealed to their native justice and magnanimity, and we have conjured them by the ties of our common kindred to disavow these usurpations, which would inevitably interrupt our connections and correspondence. They too have been deaf to the voice of justice and of consanguinity. We must, therefore, acquiesce in the necessity, which denounces our Separation, and hold them, as we hold the rest of mankind, Enemies in War, in Peace Friends.  \n\n&gt;We, therefore, the Representatives of the united States of America, in General Congress, Assembled, appealing to the Supreme Judge of the world for the rectitude of our intentions, do, in the Name, and by Authority of the good People of these Colonies, solemnly publish and declare, That these united Colonies are, and of Right ought to be Free and Independent States, that they are Absolved from all Allegiance to the British Crown, and that all political connection between them and the State of Great Britain, is and ought to be totally dissolved; and that as Free and Independent States, they have full Power to levy War, conclude Peace, contract Alliances, establish Commerce, and to do all other Acts and Things which Independent States may of right do. — And for the support of this Declaration, with a firm reliance on the protection of Divine Providence, we mutually pledge to each other our Lives, our Fortunes, and our sacred Honor.  \n\n- Signing for Massachusetts:  \nJohn Hancock, Samuel Adams, John Adams, Robert Treat Paine, Elbridge Gerry\n\n- Signing for New Hampshire:  \nJosiah Bartlett, William Whipple, Matthew Thornton\n\n- Signing for Rhode Island:  \nStephen Hopkins, William Ellery\n\n- Signing for Connecticut:  \nRoger Sherman, Samuel Huntington, William Williams, Oliver Wolcott\n\n- Signing for New York:  \nWilliam Floyd, Philip Livingston, Francis Lewis, Lewis Morris\n\n- Signing for New Jersey:  \nRichard Stockton, John Witherspoon, Francis Hopkinson, John Hart, Abraham Clark\n\n- Signing for Pennsylvania:  \nRobert Morris, Benjamin Rush, Benjamin Franklin, John Morton, George Clymer, James Smith, George Taylor, James Wilson, George Ross\n\n- Signing for Delaware:  \nCaesar Rodney, George Read, Thomas McKean\n\n- Signing for Maryland:  \nSamuel Chase, William Paca, Thomas Stone, Charles Carroll of Carrollton\n\n- Signing for Virginia:  \nGeorge Wythe, Richard Henry Lee, Thomas Jefferson, Benjamin Harrison, Thomas Nelson, Jr., Francis Lightfoot Lee, Carter Braxton\n\n- Signing for North Carolina:  \nWilliam Hooper, Joseph Hewes, John Penn\n\n- Signing for South Carolina:  \nEdward Rutledge, Thomas Heyward, Jr., Thomas Lynch, Jr., Arthur Middleton\n\n- Signing for Georgia:  \nButton Gwinnett, Lyman Hall, George Walton\n\nedit: formatting",
    "permalink": "/r/TheMotte/comments/vr0t4v/culture_war_roundup_for_the_week_of_july_04_2022/ieu8z57/"
  },
  {
    "kind": "t1",
    "id": "ietv5wp",
    "author": "Amadanb",
    "score": 26,
    "createdUtc": 1656949236,
    "body": "**Semi-regular Ban Report**\n\nNo AEO actions since the last report. Maybe y'all are getting more chill. Or maybe you're just saving your powder for the midterms. Anyway, progress on www.themotte.org proceeds apace.\n\nHappy 4th to my fellow Americans, and please don't shoot your damn rockets onto my roof.\n\n**The Bans**\n\n/u/PoliticsComprehender - [permaban](https://www.reddit.com/r/TheMotte/comments/vjpec0/comment/iee7rju/?utm_source=share&amp;utm_medium=web2x&amp;context=3) -/u/Amadanb\n\n/u/OPSIA_0967 - [permaban](https://www.reddit.com/r/TheMotte/comments/vlopk0/comment/ie4dtk6/?utm_source=share&amp;utm_medium=web2x&amp;context=3) -/u/Amadanb\n\n/u/CD-ROM_INSTRUCTOR - [7 days](https://www.reddit.com/r/TheMotte/comments/vlopk0/culture_war_roundup_for_the_week_of_june_27_2022/iebo494/) -/u/naraburns\n\n/u/catharturban - permaban -/u/Amadanb\n\n/u/DoubtfulDustpan - [3 days](https://www.reddit.com/r/TheMotte/comments/vjpec0/comment/idn8au1/?utm_source=share&amp;utm_medium=web2x&amp;context=3) -/u/Amadanb\n\n/u/ParkingCampaign3 - [permaban](https://www.reddit.com/r/TheMotte/comments/vgemda/comment/idi81he/?utm_source=share&amp;utm_medium=web2x&amp;context=3) -/u/Amadanb\n\n/u/StuartBuck [7 days](https://www.reddit.com/r/TheMotte/comments/v3ljan/comment/idi3tj2/?utm_source=share&amp;utm_medium=web2x&amp;context=3) -/u/Amadanb",
    "permalink": "/r/TheMotte/comments/vr0t4v/culture_war_roundup_for_the_week_of_july_04_2022/ietv5wp/"
  },
  {
    "kind": "t1",
    "id": "ietouha",
    "author": "netstack_",
    "score": 64,
    "createdUtc": 1656946541,
    "body": "The other week, I enjoyed lunch with my grandmother in her retirement home.\nOne of the other residents was a sweet old lady with, apparently, quite the variety of life experiences.\nAnd as I listened to her stories of Saudi Arabia, I felt what can only be described as national pride.\nSo in the spirit of the 4th, I'd like to share a few examples of American cultural imperialism.\n\n___\n\nThe year is 1981.\nIn Iran, 52 American hostages were only just released to the newly inaugurated Reagan administration.\nSoviet forces occupy Afghanistan; three offensives have so far failed to drive the mujahideen from the Panjshir valley.\nSaudi Arabia's King Khalid is in ill health and delegates ever more administrative duties to Crown Prince Fahd.\nHis response to the 1979 Grand Mosque Seizure has increased the power of Islamic traditionalists.\n\nThis woman is not terribly concerned with such developments, even though the American embassy has warned her: \n\"If there's trouble, don't come here.\"\nShe has already resolved to ignore that directive in case of danger.\n\nHer new job is administrative work at a major Riyadh hospital employing citizens of 52 different countries.\nShe speaks only English.\nLater she will tell me that the trick is careful listening, not the half-awareness we do when we are familiar with a language.\nYou can get a lot from paying attention to tone.\n\nAs she becomes more familiar with employee records, she notices that no one celebrates birthdays in the office.\n(She told me that the records don't emphasize birth date like they do here;\nI haven't been able to corroborate that, but the lack of celebrations still holds true today.\nIt is considered a risk of excess.)\nNaturally, she decides to correct this oversight.\nThis means assigning each of her fellow employees to a week.\nWhen that date comes around, she bakes a cake for the office and throws a little party.\nShe really enjoys having this as a regular occurrence.\n\nPayroll is managed entirely with paper money.\nEach month bags are brought into the hospital to be divided by department.\nThen each department head distributes the cash to their employees.\nDuring her stay, she is part of the rollout of a new and exotic technology known as the \"check.\"\nThis takes some getting used to; many employees are not familiar with the concept at all, and may even lack a bank account, treating the check like it's cash.\nShe observes that the number of uncashed checks is very high.\nNot that she's particularly surprised, as management has done next to nothing to prepare training for the rollout.\nAgain, she takes it upon herself to set up workshops explaining the basics.\n\nSaudi Arabia was and is incredibly gender-segregated.\nIts buses allocate the front half to men and the back half to women.\nNot in the Rosa Parks sense--there are two separate entrances with a divider.\nAll the bus drivers are Filipino, apparently because they are more likely to speak English.\nBut the passengers are largely young Saudi men.\n\nShe makes a habit of walking up to the front entrance.\nNot to *actually* board the men's section, but to holler at the driver for directions before heading to the back.\n\"The men would get outraged as you walked up, shouting 'You have to go to the back!' and waving me away,\" she tells me.\n\"It was the *funniest* thing.\"\n\nThere's an older man running a cafe that she frequents.\nThey regularly chat over lunch, and on occasion, he tries to matchmake her with locals.\nShe doesn't hold it against him.\nAfter several months, he says it's a shame she's still unmarried, and makes the offer himself.\nShe says yes--on two conditions.\nFirst, he'd have to convert, as she's a Baptist with no intention of taking up Islam.\nSecond, she doesn't share.\nBut if he divorces his first wife, she'd marry him.\nHe reconsiders.\n\nA week before she is due to fly back to the States, she is walking downtown and notices one of the *mutaween* evaluating her outfit.\nThese are the religious police, tasked with identifying and punishing noncompliance with Sharia law.\nThey're equipped with switches to slap any uncovered ankles passing by.\nAs a consequence of population statistics, they also tend to be at least six inches shorter than her.\nShe fixes this man with a Look and tells him, and I quote:\n\"Hit me with that and I'll kill you.\"\nIt's not clear whether or not he speaks English, but he certainly lets her pass.\n\n___\n\nI still don't know exactly why this woman chose to spend a year or two in Saudi Arabia.\nShe didn't know the language, was a stranger to the culture, and left the U.S.A. for a country actively sliding towards Islamic fundamentalism.\nAnd she did so with *confidence*.\nHer self-assurance in our customs, paired with the willingness to go out there and export it to the rest of the world--\nThat's cultural imperialism in action, and I'm proud of it.\n\nHere's to another 250 years.",
    "permalink": "/r/TheMotte/comments/vr0t4v/culture_war_roundup_for_the_week_of_july_04_2022/ietouha/"
  },
  {
    "kind": "t1",
    "id": "iet735c",
    "author": "naraburns",
    "score": 51,
    "createdUtc": 1656937614,
    "body": "The *Dobbs* megathread is over a week old now, and never did reach 2000 posts, so I think it's probably safe to let it lapse... that said, I have been thinking *a lot* about [one of these charts](https://news.gallup.com/poll/245618/abortion-trends-gender.aspx) over the past week, and wondered what you all might make of it.\n\nI hate the labels \"pro-life\" and \"pro-choice,\" for what I think are well-trod reasons.  A majority of Americans favor *some* restrictions on abortion.  A majority of Americans *oppose* a blanket ban.  Setting the poles of the debate at \"all or nothing\" creates [duelling purity spirals](https://www.reddit.com/r/TheMotte/comments/vjpec0/dobbs_v_jackson_womens_health_organization/idq2mlt/) that tear apart all the reasoned and nuanced discussion between those positions.  But one of the most famous \"pro-choice\" essays in the philosophical literature, where Judith Jarvis Thompson introduces the violinist case, concludes:\n\n&gt; I do argue that abortion is not impermissible, [but] I do not argue that it is always permissible... [A] sick and desperately frightened fourteen-year-old schoolgirl, pregnant due to rape, may of course choose abortion, and... any law which rules this out is an insane law... It would be indecent in the woman to request an abortion, and indecent in a doctor to perform it, if she is in her seventh month, and wants the abortion just to avoid the nuisance of postponing a trip abroad.\n\nBy contrast, if you check the [Republican Party platform](https://prod-cdn-static.gop.com/media/documents/DRAFT_12_FINAL%5B1%5D-ben_1468872234.pdf), it states unequivocally:\n\n&gt; Numerous studies have shown that abortion endangers the health and well-being of women, and we stand firmly against it.\n\nThe [Democratic Party platform](https://democrats.org/wp-content/uploads/2020/08/2020-Democratic-Party-Platform.pdf) is arguably more equivocal, but \"**every** woman should be able to access...safe and legal abortion\" does strictly include abortion for women who are 40 weeks pregnant, though this is of course not what \"the majority of Americans\" believe:\n\n&gt; We believe unequivocally, like the majority of Americans, that every woman should be able to access high-quality reproductive health care services, including safe and legal abortion.\n\nBack to the Gallup poll--check the chart called \"Trends in Preferred Abortion Label, by Gender.\"  In May of 2022, a historical high of 61% of women identified as \"pro-choice.\"  This is just three years after 2019's poll, in which a quarter-century high of 51% of women identified as pro-life.  This change is substantially underwritten by a rather abrupt explosion of \"legal under any circumstances\" women, and collapse of \"illegal in all circumstances\" women.  Just at a guess, timing wise the polls go \n\n&gt; low support for unconditional abortion --&gt;\n\n&gt; Kavanaugh --&gt;\n\n&gt; rising support for unconditional abortion --&gt; \n\n&gt; Coney Barrett --&gt; \n\n&gt; all-time high support for unconditional abortion\n\nIn other words, people tend to default toward pro-life type positions (or pro-life type positions just get more consistently pushed), but dropping abortion into the news cycle shifts people quickly back toward pro-choice type positions.  And \"all-time high\" may be a little misleading, as the mid-1990s saw similarly high \"legal under any circumstances\" support from women (37% then, 38% today).\n\nI know that many of you did not live through the 1990s, or were too young to be aware of the culture wars, but culturally it was an era of fairly strident feminism.  Hillary Clinton was personally responsible for some small part of that, but so was *Planned Parenthood v. Casey* (1992), to say nothing of Hollywood.  Disney's *Beauty and the Beast* (1991) deliberately appealed to feminist tropes, \"girl power\" was, if not coined, at least popularized in that era (the Spice Girls played some role in this, though more recently they have [disavowed the slogan](https://www.telegraph.co.uk/music/news/spice-girls-say-people-power-not-girl-power-should-back-theresa/), for presumably CW-adjacent reasons).  All this is in turn downstream from the feminism of the 1980s and 1970s, or maybe arguably a culmination of those influences.  By the 1990s, though, all the fresh-faced feminists of the Summer of Love had grown up, gotten jobs, had children, and otherwise installed themselves into positions of influence, even if only as reliably Democratic voters.\n\nThere is a lot of debate about \"wave\" feminism and what each \"wave\" entails, but whether these numbers indicate a new \"wave\" of feminism, they seem to indicate *something*.  The salience of \"women's issues\" is particularly great in a nation where women consistently outnumber men at the polls, by fairly wide margins.  So for almost *one woman in five* to go from labeling herself \"pro-life\" to \"pro-choice\" in the space of three years seems like an important shift, even if drilling down into those numbers reveals more nuanced attitudes that are *mostly* within historically-attested ranges. \n\nSince *Dobbs* has moved the issue to the states, where there are fifty wildly-diverse legislative and judicial bodies prepared to fuck things up in a million new and exciting ways, this is likely to go on for several years at least.  I anticipate media amping the feminist signal ([here is a young adult books editor calling for abortion books in a since-deleted tweet](https://bleedingcool.com/comics/scholastic-editor-calls-for-ya-books-graphic-novels-about-abortion/), for example) akin to what we saw in the 1990s, building on the memetic success of the execrable and behindhanded \"Handmaid's Tale.\"  What is unclear to me is the payoff.  \n\nPainting with a broad brush, if we think of first wave feminism as receding once suffrage was secured, and second wave feminism as receding once it eliminated legal barriers to women's social equality, third wave feminism arguably came for the \"systemic\" bits, the left-over oppression that persisted in civilization's social and political habits--like \"gender identity\" and \"gender roles.\"  Each wave of feminism contains seeds of its successor (all are a part of the same ocean) but still there are clustered trends.  So what's left for feminism after that?  More specifically: what *difference between men and women* remains to be erased?  And how does \"legal abortion under any circumstances\" capture it?\n\n(My own hasty guess is something like \"finding ways to eliminate the biological differences between men and women,\" but I see the face of transhumanism on tortillas and burnt toast so possibly I am not a reliable analyst in this regard.)",
    "permalink": "/r/TheMotte/comments/vr0t4v/culture_war_roundup_for_the_week_of_july_04_2022/iet735c/"
  }
]
