[{"kind": "Listing", "data": {"after": null, "dist": 1, "modhash": "", "geo_filter": "", "children": [{"kind": "t3", "data": {"approved_at_utc": null, "subreddit": "TheMotte", "selftext": "This weekly roundup thread is intended for all culture war posts. ['Culture war'](https://en.wikipedia.org/w/index.php?title=Culture_war&amp;oldid=963768354) is vaguely defined, but it basically means controversial issues that fall along set tribal lines. Arguments over culture war issues generate a lot of heat and little light, and few deeply entrenched people ever change their minds. This thread is for voicing opinions and analyzing the state of the discussion while trying to optimize for light over heat.\n\nOptimistically, we think that [engaging with people you disagree with](http://archive.is/LuQ66) is worth your time, and [so is being nice!](http://archive.is/hH3VO) Pessimistically, there are many dynamics that can lead discussions on Culture War topics to become unproductive. There's a human tendency to divide along tribal lines, praising your ingroup and vilifying your outgroup - and if you think you find it easy to criticize your ingroup, then it may be that your outgroup is [not who you think it is](http://archive.is/ur3Fh). Extremists with opposing positions can [feed off each other](http://archive.is/FtI4S), highlighting each other's worst points to justify their own angry rhetoric, which becomes in turn a new example of bad behavior for the other side to highlight.\n\nWe would like to avoid these negative dynamics. Accordingly, we ask that you do not use this thread for waging the Culture War. Examples of waging the Culture War:\n\n* Shaming.     \n* Attempting to 'build consensus' or enforce ideological conformity.     \n* Making sweeping generalizations to vilify a group you dislike.     \n* Recruiting for a cause.     \n* Posting links that could be summarized as 'Boo outgroup!' Basically, if your content is 'Can you believe what Those People did this week?' then you should either refrain from posting, or do some very patient work to contextualize and/or [steel-man](https://wiki.lesswrong.com/wiki/Steel_man) the relevant viewpoint.\n\nIn general, you should argue to understand, not to win. This thread is not territory to be claimed by one group or another; indeed, the aim is to have many different viewpoints represented here. Thus, we also ask that you follow some guidelines:\n\n* Speak plainly. Avoid sarcasm and mockery. When disagreeing with someone, state your objections explicitly.     \n* Be as precise and charitable as you can. Don't paraphrase unflatteringly.     \n* Don't imply that someone said something they did not say, even if you think it follows from what they said.     \n* Write like everyone is reading and you want them to be included in the discussion.\n\nOn an ad hoc basis, the mods will try to compile a list of the best posts/comments from the previous week, posted in Quality Contribution threads and archived at r/TheThread. You may nominate a comment for this list by clicking on 'report' at the bottom of the post, selecting 'this breaks r/themotte's rules, or is of interest to the mods' from the pop-up menu and then selecting 'Actually a quality contribution' from the sub-menu.\n\n----\n\n**Locking Your Own Posts**\n\nMaking a multi-comment megapost and want people to reply to the last one in order to preserve comment ordering? We've got a solution for you!\n\n* Write your entire post series in Notepad or some other offsite medium. Make sure that they're long; comment limit is 10000 characters, if your comments are less than half that length you should probably not be making it a multipost series.\n* Post it rapidly, in response to yourself, like you would normally.\n* For each post *except the last one*, go back and edit it to include the trigger phrase `automod_multipart_lockme`.\n* This will cause AutoModerator to lock the post.\n\nYou can then edit it to remove that phrase and it'll stay locked. This means that *you cannot unlock your post on your own*, so make sure you do this *after* you've posted your entire series. Also, don't lock the last one or people can't respond to you. *Also*, this gets reported to the mods, so don't abuse it or we'll either lock you out of the feature or just boot you; this feature is specifically for organization of multipart megaposts.\n\n----\n\nIf you're having trouble loading the whole thread, there are several tools that may be useful:\n\n* https://reddit-thread.glitch.me/\n* [RedditSearch.io](https://redditsearch.io/)\n* [Camas Reddit Search](https://camas.unddit.com/)\n* Append `?sort=old&amp;depth=1` to the end of this page's URL", "user_reports": [], "saved": false, "mod_reason_title": null, "gilded": 0, "clicked": false, "title": "Culture War Roundup for the week of July 11, 2022", "link_flair_richtext": [], "subreddit_name_prefixed": "r/TheMotte", "hidden": false, "pwls": 7, "link_flair_css_class": null, "downs": 0, "top_awarded_type": null, "parent_whitelist_status": "some_ads", "hide_score": false, "name": "t3_vwbj4s", "quarantine": false, "link_flair_text_color": "dark", "upvote_ratio": 0.78, "author_flair_background_color": null, "subreddit_type": "public", "ups": 5, "total_awards_received": 0, "media_embed": {}, "author_flair_template_id": null, "is_original_content": false, "author_fullname": "t2_6l4z3", "secure_media": null, "is_reddit_media_domain": false, "is_meta": false, "category": null, "secure_media_embed": {}, "link_flair_text": "Culture War Roundup", "can_mod_post": false, "score": 5, "approved_by": null, "is_created_from_ads_ui": false, "author_premium": true, "thumbnail": "", "edited": false, "author_flair_css_class": null, "author_flair_richtext": [], "gildings": {}, "content_categories": null, "is_self": true, "mod_note": null, "created": 1657520108.0, "link_flair_type": "text", "wls": 7, "removed_by_category": null, "banned_by": null, "author_flair_type": "text", "domain": "self.TheMotte", "allow_live_comments": false, "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This weekly roundup thread is intended for all culture war posts. &lt;a href=\"https://en.wikipedia.org/w/index.php?title=Culture_war&amp;amp;oldid=963768354\"&gt;&amp;#39;Culture war&amp;#39;&lt;/a&gt; is vaguely defined, but it basically means controversial issues that fall along set tribal lines. Arguments over culture war issues generate a lot of heat and little light, and few deeply entrenched people ever change their minds. This thread is for voicing opinions and analyzing the state of the discussion while trying to optimize for light over heat.&lt;/p&gt;\n\n&lt;p&gt;Optimistically, we think that &lt;a href=\"http://archive.is/LuQ66\"&gt;engaging with people you disagree with&lt;/a&gt; is worth your time, and &lt;a href=\"http://archive.is/hH3VO\"&gt;so is being nice!&lt;/a&gt; Pessimistically, there are many dynamics that can lead discussions on Culture War topics to become unproductive. There&amp;#39;s a human tendency to divide along tribal lines, praising your ingroup and vilifying your outgroup - and if you think you find it easy to criticize your ingroup, then it may be that your outgroup is &lt;a href=\"http://archive.is/ur3Fh\"&gt;not who you think it is&lt;/a&gt;. Extremists with opposing positions can &lt;a href=\"http://archive.is/FtI4S\"&gt;feed off each other&lt;/a&gt;, highlighting each other&amp;#39;s worst points to justify their own angry rhetoric, which becomes in turn a new example of bad behavior for the other side to highlight.&lt;/p&gt;\n\n&lt;p&gt;We would like to avoid these negative dynamics. Accordingly, we ask that you do not use this thread for waging the Culture War. Examples of waging the Culture War:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Shaming.&lt;br/&gt;&lt;/li&gt;\n&lt;li&gt;Attempting to &amp;#39;build consensus&amp;#39; or enforce ideological conformity.&lt;br/&gt;&lt;/li&gt;\n&lt;li&gt;Making sweeping generalizations to vilify a group you dislike.&lt;br/&gt;&lt;/li&gt;\n&lt;li&gt;Recruiting for a cause.&lt;br/&gt;&lt;/li&gt;\n&lt;li&gt;Posting links that could be summarized as &amp;#39;Boo outgroup!&amp;#39; Basically, if your content is &amp;#39;Can you believe what Those People did this week?&amp;#39; then you should either refrain from posting, or do some very patient work to contextualize and/or &lt;a href=\"https://wiki.lesswrong.com/wiki/Steel_man\"&gt;steel-man&lt;/a&gt; the relevant viewpoint.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;In general, you should argue to understand, not to win. This thread is not territory to be claimed by one group or another; indeed, the aim is to have many different viewpoints represented here. Thus, we also ask that you follow some guidelines:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Speak plainly. Avoid sarcasm and mockery. When disagreeing with someone, state your objections explicitly.&lt;br/&gt;&lt;/li&gt;\n&lt;li&gt;Be as precise and charitable as you can. Don&amp;#39;t paraphrase unflatteringly.&lt;br/&gt;&lt;/li&gt;\n&lt;li&gt;Don&amp;#39;t imply that someone said something they did not say, even if you think it follows from what they said.&lt;br/&gt;&lt;/li&gt;\n&lt;li&gt;Write like everyone is reading and you want them to be included in the discussion.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;On an ad hoc basis, the mods will try to compile a list of the best posts/comments from the previous week, posted in Quality Contribution threads and archived at &lt;a href=\"/r/TheThread\"&gt;r/TheThread&lt;/a&gt;. You may nominate a comment for this list by clicking on &amp;#39;report&amp;#39; at the bottom of the post, selecting &amp;#39;this breaks &lt;a href=\"/r/themotte\"&gt;r/themotte&lt;/a&gt;&amp;#39;s rules, or is of interest to the mods&amp;#39; from the pop-up menu and then selecting &amp;#39;Actually a quality contribution&amp;#39; from the sub-menu.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;strong&gt;Locking Your Own Posts&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Making a multi-comment megapost and want people to reply to the last one in order to preserve comment ordering? We&amp;#39;ve got a solution for you!&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Write your entire post series in Notepad or some other offsite medium. Make sure that they&amp;#39;re long; comment limit is 10000 characters, if your comments are less than half that length you should probably not be making it a multipost series.&lt;/li&gt;\n&lt;li&gt;Post it rapidly, in response to yourself, like you would normally.&lt;/li&gt;\n&lt;li&gt;For each post &lt;em&gt;except the last one&lt;/em&gt;, go back and edit it to include the trigger phrase &lt;code&gt;automod_multipart_lockme&lt;/code&gt;.&lt;/li&gt;\n&lt;li&gt;This will cause AutoModerator to lock the post.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;You can then edit it to remove that phrase and it&amp;#39;ll stay locked. This means that &lt;em&gt;you cannot unlock your post on your own&lt;/em&gt;, so make sure you do this &lt;em&gt;after&lt;/em&gt; you&amp;#39;ve posted your entire series. Also, don&amp;#39;t lock the last one or people can&amp;#39;t respond to you. &lt;em&gt;Also&lt;/em&gt;, this gets reported to the mods, so don&amp;#39;t abuse it or we&amp;#39;ll either lock you out of the feature or just boot you; this feature is specifically for organization of multipart megaposts.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;If you&amp;#39;re having trouble loading the whole thread, there are several tools that may be useful:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;a href=\"https://reddit-thread.glitch.me/\"&gt;https://reddit-thread.glitch.me/&lt;/a&gt;&lt;/li&gt;\n&lt;li&gt;&lt;a href=\"https://redditsearch.io/\"&gt;RedditSearch.io&lt;/a&gt;&lt;/li&gt;\n&lt;li&gt;&lt;a href=\"https://camas.unddit.com/\"&gt;Camas Reddit Search&lt;/a&gt;&lt;/li&gt;\n&lt;li&gt;Append &lt;code&gt;?sort=old&amp;amp;depth=1&lt;/code&gt; to the end of this page&amp;#39;s URL&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "likes": null, "suggested_sort": "new", "banned_at_utc": null, "view_count": null, "archived": false, "no_follow": false, "is_crosspostable": false, "pinned": false, "over_18": false, "all_awardings": [], "awarders": [], "media_only": false, "can_gild": false, "spoiler": false, "locked": false, "author_flair_text": null, "treatment_tags": [], "visited": false, "removed_by": null, "num_reports": null, "distinguished": "moderator", "subreddit_id": "t5_vkedk", "author_is_blocked": false, "mod_reason_by": null, "removal_reason": null, "link_flair_background_color": "", "id": "vwbj4s", "is_robot_indexable": true, "num_duplicates": 0, "report_reasons": null, "author": "AutoModerator", "discussion_type": null, "num_comments": 3, "send_replies": false, "media": null, "contest_mode": false, "author_patreon_flair": false, "author_flair_text_color": null, "permalink": "/r/TheMotte/comments/vwbj4s/culture_war_roundup_for_the_week_of_july_11_2022/", "whitelist_status": "some_ads", "stickied": true, "url": "https://old.reddit.com/r/TheMotte/comments/vwbj4s/culture_war_roundup_for_the_week_of_july_11_2022/", "subreddit_subscribers": 18332, "created_utc": 1657520108.0, "num_crossposts": 0, "mod_reports": [], "is_video": false}}], "before": null}}, {"kind": "Listing", "data": {"after": null, "dist": null, "modhash": "", "geo_filter": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_vkedk", "approved_at_utc": null, "author_is_blocked": false, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "author_flair_type": "text", "total_awards_received": 0, "subreddit": "TheMotte", "author_flair_template_id": null, "likes": null, "replies": {"kind": "Listing", "data": {"after": null, "dist": null, "modhash": "", "geo_filter": "", "children": [{"kind": "more", "data": {"count": 0, "name": "t1__", "id": "_", "parent_id": "t1_ifpphsh", "depth": 1, "children": []}}], "before": null}}, "user_reports": [], "saved": false, "id": "ifpphsh", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "collapsed_reason_code": null, "no_follow": false, "author": "Walterodim79", "can_mod_post": false, "created_utc": 1657542002.0, "send_replies": true, "parent_id": "t3_vwbj4s", "score": 1, "author_fullname": "t2_9dc7xngg", "approved_by": null, "mod_note": null, "all_awardings": [], "collapsed": false, "body": "We talked quite a bit about the quality of information in the media ecosystem and how that has intersected with science of questionable quality in the Covid universe, but today I want to highlight an example that's generally a bit further from the culture war. Over the weekend, my NYT digest pinged me with the now one year old wellness article *[Do We Really Need to Take 10,000 Steps a Day for Our Health?](https://archive.ph/Xq0Fv#selection-319.0-322.0)*. As someone that's immediately triggered by people looking for excuses to justify their sedentary lifestyles, I naturally clicked through for a quick rage-read (put aside for a moment how unhealthy *that* behavior is). So, what's the origin of the claim that fewer steps is actually fine?\n\n&gt;A 2019 study by Dr. Lee and her colleagues found that women in their 70s who managed as few as 4,400 steps a day reduced their risk of premature death by about 40 percent, compared to women completing 2,700 or fewer steps a day. The risks for early death continued to drop among the women walking more than 5,000 steps a day, but benefits plateaued at about 7,500 daily steps. In other words, older women who completed fewer than half of the mythic 10,000 daily steps tended to live substantially longer than those who covered even less ground.\n\nWait, *what*? How does this causal inference chain work? If you showed me [that study](https://archive.ph/3Xcuo), I'd think it's fine as far as it goes, but that the only thing that it really tells us is that elderly women that have dropped to as few as 2,700 steps are often pretty well on death's door, which is what I would have already expected. There's pretty much nothing I can draw from that regarding the value of moving more for young and middle-aged people. There definitely isn't anything strong enough to move me off the prior that moving more is almost always a good thing. I suppose I agree that there's no magic number and if there was, it'd be a hell of a coincidence that it happened to line up with a shiny, round number, but that's never really been the point anyway. Oh well though, she's not done citing evidence:\n\n&gt;Another, more expansive study last year of almost 5,000 middle-aged men and women of various ethnicities likewise found that 10,000 steps a day are not a requirement for longevity. In that study, people who walked for about 8,000 steps a day were half as likely to die prematurely from heart disease or any other cause as those who accumulated 4,000 steps a day. The statistical benefits of additional steps were slight, meaning it did not hurt people to amass more daily steps, up to and beyond the 10,000-steps mark. But the extra steps did not provide much additional protection against dying young, either.\n\nWell, that's a bit more encouraging, so [what does that study say](https://jamanetwork.com/journals/jama/article-abstract/2763292)? \n\n&gt;A total of 4840 participants (mean age, 56.8 years; 2435 [54%] women; 1732 [36%] individuals with obesity) wore accelerometers for a mean of 5.7 days for a mean of 14.4 hours per day. The mean number of steps per day was 9124. There were 1165 deaths over a mean 10.1 years of follow-up, including 406 CVD and 283 cancer deaths. The unadjusted incidence density for all-cause mortality was 76.7 per 1000 person-years (419 deaths) for the 655 individuals who took less than 4000 steps per day; 21.4 per 1000 person-years (488 deaths) for the 1727 individuals who took 4000 to 7999 steps per day; 6.9 per 1000 person-years (176 deaths) for the 1539 individuals who took 8000 to 11 999 steps per day; and 4.8 per 1000 person-years (82 deaths) for the 919 individuals who took at least 12 000 steps per day. Compared with taking 4000 steps per day, taking 8000 steps per day was associated with significantly lower all-cause mortality (HR, 0.49 [95% CI, 0.44-0.55]), as was taking 12 000 steps per day (HR, 0.35 [95% CI, 0.28-0.45]). Unadjusted incidence density for all-cause mortality by peak 30 cadence was 32.9 per 1000 person-years (406 deaths) for the 1080 individuals who took 18.5 to 56.0 steps per minute; 12.6 per 1000 person-years (207 deaths) for the 1153 individuals who took 56.1 to 69.2 steps per minute; 6.8 per 1000 person-years (124 deaths) for the 1074 individuals who took 69.3 to 82.8 steps per minute; and 5.3 per 1000 person-years (108 deaths) for the 1037 individuals who took 82.9 to 149.5 steps per minute. Greater step intensity was not significantly associated with lower mortality after adjustment for total steps per day (eg, highest vs lowest quartile of peak 30 cadence: HR, 0.90 [95% CI, 0.65-1.27]; P value for trend = .34).\n\nOK, this is actually pretty good. It's still more in the direction of predictive data than advice (IMO), but those differences are *really* large. We should be looking at that and describing dropping to 4,000 steps per day in middle age as an emergency, a strong predictor of impending doom. This doesn't necessarily provide advice for the young, but we can probably start drawing some inferences about just how bad it is to not move around much. Of note, the 12,000 step group actually did a decent bit better than the 8,000 step group; they have overlapping confidence intervals, so that's a weak conclusion, but I'd personally be inclined to take it as a suggestion that we don't really have any cap on the \"more is better\" line of thinking. What's the conclusion from our intrepid NYT reporter?\n\n&gt;The good news is that upping our current step counts by even a few thousand additional strides most days could be a reasonable, sufficient — and achievable — goal, Dr. Lee said. The formal physical activity guidelines issued by the United States and other governments use time, not steps, as a recommendation, and suggest we exercise for at least 150 minutes a week, or a half-hour most days, in addition to any moving around we do as part of our normal, daily lives. Translated into step counts, Dr. Lee said, that total would work out to a little more than 16,000 steps a week of exercise for most people, or about 2,000 to 3,000 steps most days. (Two thousand steps equal approximately a mile.) If, like many people, we currently take about 5,000 steps a day during the course of everyday activities like shopping and housework, adding the extra 2,000 to 3,000 steps would take us to a total of between 7,000 and 8,000 steps most days, which, Dr. Lee said, seems to be the step-count sweet spot.\n\nWait, *what*? How is that the \"sweet spot\"? Is this based on the idea that it's some unbearable suffering to go for a long walk? I'm just absolutely blown away that anyone would treat 10,000 steps as (implied above) unreasonable and unachievable. Just how low of a bar are we setting and why is that the tone that a NYT blogger wants to set for people?\n\nOn one level, I know I'm being petty, but I actually do think misunderstanding causality and failing to actually look at the data in a couple pretty simple papers highlights just how bad science and medical journalism is. It's not just politically charged topics like Covid and environmentalism, it's something as simple as, \"should people be advised to take more than 8,000 steps?\". When the writing is this bad on something that I wouldn't expect bias to creep in, I find that I'm unsurprised that it goes completely off the rails on topics where there's a tribal affiliation with morally good conclusions.", "edited": false, "top_awarded_type": null, "author_flair_css_class": null, "name": "t1_ifpphsh", "is_submitter": false, "downs": 0, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;We talked quite a bit about the quality of information in the media ecosystem and how that has intersected with science of questionable quality in the Covid universe, but today I want to highlight an example that&amp;#39;s generally a bit further from the culture war. Over the weekend, my NYT digest pinged me with the now one year old wellness article &lt;em&gt;&lt;a href=\"https://archive.ph/Xq0Fv#selection-319.0-322.0\"&gt;Do We Really Need to Take 10,000 Steps a Day for Our Health?&lt;/a&gt;&lt;/em&gt;. As someone that&amp;#39;s immediately triggered by people looking for excuses to justify their sedentary lifestyles, I naturally clicked through for a quick rage-read (put aside for a moment how unhealthy &lt;em&gt;that&lt;/em&gt; behavior is). So, what&amp;#39;s the origin of the claim that fewer steps is actually fine?&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;A 2019 study by Dr. Lee and her colleagues found that women in their 70s who managed as few as 4,400 steps a day reduced their risk of premature death by about 40 percent, compared to women completing 2,700 or fewer steps a day. The risks for early death continued to drop among the women walking more than 5,000 steps a day, but benefits plateaued at about 7,500 daily steps. In other words, older women who completed fewer than half of the mythic 10,000 daily steps tended to live substantially longer than those who covered even less ground.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Wait, &lt;em&gt;what&lt;/em&gt;? How does this causal inference chain work? If you showed me &lt;a href=\"https://archive.ph/3Xcuo\"&gt;that study&lt;/a&gt;, I&amp;#39;d think it&amp;#39;s fine as far as it goes, but that the only thing that it really tells us is that elderly women that have dropped to as few as 2,700 steps are often pretty well on death&amp;#39;s door, which is what I would have already expected. There&amp;#39;s pretty much nothing I can draw from that regarding the value of moving more for young and middle-aged people. There definitely isn&amp;#39;t anything strong enough to move me off the prior that moving more is almost always a good thing. I suppose I agree that there&amp;#39;s no magic number and if there was, it&amp;#39;d be a hell of a coincidence that it happened to line up with a shiny, round number, but that&amp;#39;s never really been the point anyway. Oh well though, she&amp;#39;s not done citing evidence:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Another, more expansive study last year of almost 5,000 middle-aged men and women of various ethnicities likewise found that 10,000 steps a day are not a requirement for longevity. In that study, people who walked for about 8,000 steps a day were half as likely to die prematurely from heart disease or any other cause as those who accumulated 4,000 steps a day. The statistical benefits of additional steps were slight, meaning it did not hurt people to amass more daily steps, up to and beyond the 10,000-steps mark. But the extra steps did not provide much additional protection against dying young, either.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Well, that&amp;#39;s a bit more encouraging, so &lt;a href=\"https://jamanetwork.com/journals/jama/article-abstract/2763292\"&gt;what does that study say&lt;/a&gt;? &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;A total of 4840 participants (mean age, 56.8 years; 2435 [54%] women; 1732 [36%] individuals with obesity) wore accelerometers for a mean of 5.7 days for a mean of 14.4 hours per day. The mean number of steps per day was 9124. There were 1165 deaths over a mean 10.1 years of follow-up, including 406 CVD and 283 cancer deaths. The unadjusted incidence density for all-cause mortality was 76.7 per 1000 person-years (419 deaths) for the 655 individuals who took less than 4000 steps per day; 21.4 per 1000 person-years (488 deaths) for the 1727 individuals who took 4000 to 7999 steps per day; 6.9 per 1000 person-years (176 deaths) for the 1539 individuals who took 8000 to 11 999 steps per day; and 4.8 per 1000 person-years (82 deaths) for the 919 individuals who took at least 12 000 steps per day. Compared with taking 4000 steps per day, taking 8000 steps per day was associated with significantly lower all-cause mortality (HR, 0.49 [95% CI, 0.44-0.55]), as was taking 12 000 steps per day (HR, 0.35 [95% CI, 0.28-0.45]). Unadjusted incidence density for all-cause mortality by peak 30 cadence was 32.9 per 1000 person-years (406 deaths) for the 1080 individuals who took 18.5 to 56.0 steps per minute; 12.6 per 1000 person-years (207 deaths) for the 1153 individuals who took 56.1 to 69.2 steps per minute; 6.8 per 1000 person-years (124 deaths) for the 1074 individuals who took 69.3 to 82.8 steps per minute; and 5.3 per 1000 person-years (108 deaths) for the 1037 individuals who took 82.9 to 149.5 steps per minute. Greater step intensity was not significantly associated with lower mortality after adjustment for total steps per day (eg, highest vs lowest quartile of peak 30 cadence: HR, 0.90 [95% CI, 0.65-1.27]; P value for trend = .34).&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;OK, this is actually pretty good. It&amp;#39;s still more in the direction of predictive data than advice (IMO), but those differences are &lt;em&gt;really&lt;/em&gt; large. We should be looking at that and describing dropping to 4,000 steps per day in middle age as an emergency, a strong predictor of impending doom. This doesn&amp;#39;t necessarily provide advice for the young, but we can probably start drawing some inferences about just how bad it is to not move around much. Of note, the 12,000 step group actually did a decent bit better than the 8,000 step group; they have overlapping confidence intervals, so that&amp;#39;s a weak conclusion, but I&amp;#39;d personally be inclined to take it as a suggestion that we don&amp;#39;t really have any cap on the &amp;quot;more is better&amp;quot; line of thinking. What&amp;#39;s the conclusion from our intrepid NYT reporter?&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;The good news is that upping our current step counts by even a few thousand additional strides most days could be a reasonable, sufficient — and achievable — goal, Dr. Lee said. The formal physical activity guidelines issued by the United States and other governments use time, not steps, as a recommendation, and suggest we exercise for at least 150 minutes a week, or a half-hour most days, in addition to any moving around we do as part of our normal, daily lives. Translated into step counts, Dr. Lee said, that total would work out to a little more than 16,000 steps a week of exercise for most people, or about 2,000 to 3,000 steps most days. (Two thousand steps equal approximately a mile.) If, like many people, we currently take about 5,000 steps a day during the course of everyday activities like shopping and housework, adding the extra 2,000 to 3,000 steps would take us to a total of between 7,000 and 8,000 steps most days, which, Dr. Lee said, seems to be the step-count sweet spot.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Wait, &lt;em&gt;what&lt;/em&gt;? How is that the &amp;quot;sweet spot&amp;quot;? Is this based on the idea that it&amp;#39;s some unbearable suffering to go for a long walk? I&amp;#39;m just absolutely blown away that anyone would treat 10,000 steps as (implied above) unreasonable and unachievable. Just how low of a bar are we setting and why is that the tone that a NYT blogger wants to set for people?&lt;/p&gt;\n\n&lt;p&gt;On one level, I know I&amp;#39;m being petty, but I actually do think misunderstanding causality and failing to actually look at the data in a couple pretty simple papers highlights just how bad science and medical journalism is. It&amp;#39;s not just politically charged topics like Covid and environmentalism, it&amp;#39;s something as simple as, &amp;quot;should people be advised to take more than 8,000 steps?&amp;quot;. When the writing is this bad on something that I wouldn&amp;#39;t expect bias to creep in, I find that I&amp;#39;m unsurprised that it goes completely off the rails on topics where there&amp;#39;s a tribal affiliation with morally good conclusions.&lt;/p&gt;\n&lt;/div&gt;", "removal_reason": null, "collapsed_reason": null, "distinguished": null, "associated_award": null, "stickied": false, "author_premium": false, "can_gild": true, "gildings": {}, "unrepliable_reason": null, "author_flair_text_color": null, "score_hidden": true, "permalink": "/r/TheMotte/comments/vwbj4s/culture_war_roundup_for_the_week_of_july_11_2022/ifpphsh/", "subreddit_type": "public", "locked": false, "report_reasons": null, "created": 1657542002.0, "author_flair_text": null, "treatment_tags": [], "link_id": "t3_vwbj4s", "subreddit_name_prefixed": "r/TheMotte", "controversiality": 0, "depth": 0, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "num_reports": null, "ups": 1}}], "before": null}}]