[
  {
    "kind": "t1",
    "id": "iesmq99",
    "author": "WestphalianPeace",
    "score": 5,
    "createdUtc": 1656921731,
    "body": "does anyone remember/can provide a link to the QC from awhile back about the importance of Pokemon Gold's Goldenrod's City Miltank being a difficult fight? I cannot find it for the life of me.",
    "permalink": "/r/TheMotte/comments/vosrph/friday_fun_thread_for_july_01_2022/iesmq99/"
  },
  {
    "kind": "t1",
    "id": "iem9m2x",
    "author": "stolen_brawnze",
    "score": 3,
    "createdUtc": 1656793968,
    "body": "Mr. Beast just released a video in which he attempts to fast for 30 days straight consuming nothing but water. I knew such a long fast was theoretically possible, but I figured it would come with some sort of lasting damage. Jesus did 40 days, but the lifestyle of Jesus was not built for earthly longevity to begin with. Mr. Beast's team of doctors didn't seem worried about it, however. \n\nThere was one small wrinkle, though, which was that he had scheduled a video shoot with *Gordon fucking Ramsey* during the period he was supposed to be fasting. He made it a full two weeks, when Gordon pretty unabashedly bullied Mr. Beast into trying his egg sandwich. He lost 20 lbs!",
    "permalink": "/r/TheMotte/comments/vosrph/friday_fun_thread_for_july_01_2022/iem9m2x/"
  },
  {
    "kind": "t1",
    "id": "iekxnbe",
    "author": "cafemachiavelli",
    "score": 4,
    "createdUtc": 1656772544,
    "body": "I've been getting back into (Japanese) Mahjong and it's been surprisingly fun so far.\n\nHere's a short summary and plug:\n\n**The rules**\n\nMahjong is a distant cousin of Rummy and plays similarly. You build sequences or sets of 3 tiles (e.g. 2-3-4 or 2-2-2) of the same suit. Discarded tiles can be claimed by other players. Four of those sets/sequences plus a pair make up a winning hand. The more rare qualities (e.g. having a flush, having a straight from 1 to 9) your hand has, the more valuable it is.\n\nReasonable people might stop here, but it's Japanese Mahjong, so we need at least four more rules:\n\nFirstly, you need at least one of those rare qualities (called yaku) in your hand for it to be considered a winning hand. So no calling random trash for a quick win. \n\nSecondly, yaku add up quickly. A cheap hand may get you 2000pts, a complex one 12000, the really rare yaku cost up to 96000. \n\nThirdly, if you win by calling a discard, that player pays the full value of your hand, else it's split evenly (ish). So at all but the lowest levels of play, people will try to avoid dealing into your hand.\n\nLastly, you can't win by stealing a discard that you've discarded before. In combination with the last rule this makes checking the other players discards for safe tiles to drop in the late game a central part of the game, and much of basic strategy consists of learning certain inference patterns regarding discards.\n\nThere are still many more rules - \"betting\" on a hand, bonus tiles, quads, repeats - but this should cover the basic feel of the game.\n\n**The plug**\n\nMahjong is fairly quick, easily played online and imo offers a good compromise between luck and skill. It's not as erratic as poker or as deterministic as chess. \n\nThe deal-in rule makes Mahjong feel more defensive than similar games. Players are typically aggressive early on but will slow down and \"fold\" in the late game, destroying a nearly finished hand to avoid a deal-in. That may sound boring, at least it did to me, but it has a certain kind of appeal once you get used to it. Ready hands, i.e. those only one tile from winning, get revealed after the round and seeing that your hunch was right and you folded in just the right moment is just deeply satisfying.\n\nPlays are highly contextual which makes an intuition for Bayesian inference very valuable. The stage of the game, the scores and player seating all affect gameplay and often let you draw conclusions about which hands are more and which less likely.\n\nThe skill ceiling is intense. I pretty much always have more information available than I can process at a given moment and need to decide which calculations to run and which to ignore. Expert players can have a sense for which tiles are dangerous that looks almost supernatural to weaker players like me. \n\nIf you want to try out the game, there's the minimalist [Tenhou](https://tenhou.net/) and the fancier [Mahjong Soul](https://mahjongsoul.yo-star.com/). If you want to start against AI, get one of the [Yakuza](https://en.wikipedia.org/wiki/Yakuza_\\(franchise\\)) games, they have Mahjong parlors ingame. For strategy I recommend [Riichi Book I](https://dainachiba.github.io/RiichiBooks/) and [Crow77](https://www.youtube.com/c/Crow77), for game reviews [Daniel Moreno](https://www.youtube.com/user/XDasukeX/videos).",
    "permalink": "/r/TheMotte/comments/vosrph/friday_fun_thread_for_july_01_2022/iekxnbe/"
  },
  {
    "kind": "t1",
    "id": "ieksl2o",
    "author": "commonsenseextremist",
    "score": 5,
    "createdUtc": 1656770080,
    "body": "1._I managed to come out of my nose dive. For two days already, I have my shit together and I'm getting things done. Nice.\n\nAlso, I think somewhere around this week or two marks the point when I started to think about my creative project seriously. \n I'm yet to define what I want precisely, but I already have a skeleton and I just keep effortlessly coming up with details, approaches, ideas to explore.\n\nIt's worth covering where it all comes from. I had a habit of daydreaming for my entire life. At first it was primitive, obviously derivative of whatever fiction impressed me most at the time, with me as a self-insert - basically me fantasizing about being badass action hero, soldier, mage, genius, and so on. Cringe, yes, though in my defense I never took it too seriously and it wasn't intentional or even voluntary - you don't really *think* about what thought you are *going to be thinking* next, right? It is what it is. Good luck not thinking about pink elephants.\n\nLater it got stranger, more complex, and self-inserts (obvious ones anyway) disappeared around the time I (more or less) grew up and ( at least somewhat) figured my identity out.\n\n2._I believe I can see what was the trigger for my creative awakening - the decision to stop playing video games for 12 months as a 2022 New Year resolution. It freed a lot of time, sparked my creative potential and indirectly pushed me to go back to drawing, something I abandoned back in school without achieving much. A realization crystallized in my mind -  the world is full of beauty and I want to capture it. And  beauty perceived visually is what I'm most interested in. \n\nThis naturally complements my day-dreaming - Now I not only dream of ideas, stories, characters, but also visuals. Visions I want to capture and make my own, if only to stop them from tormenting me. Yes, that's right. They *demand my attention*, and I'm itching to get enough skill to satisfy this demand. What I intend to specialize in is visual storytelling. I guess something like a comic book, however, the most obvious example -  Western superhero comics like Marvel, is not at all what I have in mind. It's not just that I don't like superhero stories as a theme - they are all pretty much just illustrated novels for adults, completely boring artistically.*\n\nAnother trigger that is nearly as important is Tsutomu Nihei's *Blame!* that I have read few months ago.  It really made me think about what you can achieve with visuals alone.\n\nAlright, I'm getting tired of writing, and you are of reading. Two more thoughts. \n\n3._Let's return to video games.\n\nGames with creative aspect (like making dirt huts in Minecraft) sapped my creative energy, or rather redirected and channeled it in a pleasant yet infertile way.\n\nGames without much creative side (I played my fair share of shooters as well) simply wasted my time. \n\nThe only kind of games I can retrospectively justify is story-reliant ones. \n\nReally, despite some exceptions, gaming is a trap. It's optimized to manipulate you (sorry, u/ZorbaTHut !) and takes advantage of various aspects human nature to keep you staring at pixels on the screen, wasting your very scarce, irretrievable time. \n\n \n\n4._Of course, I'm not an idiot and I know that I need to establish a firm foundation in my life before I fully commit to creative pursuits. Being a starving artist isn't fun.  I need good sources of income, ideally passive income as well, solid financial cushion,  so I could live without working for at least a year if I need to, so on. It's changing my perspective and priorities in a funny way. I never cared much about money - might just be because that I've been poor and I know that money doesn't make you happy and lack of it doesn't guarantee misery, if your basic needs are covered.  I also have an anti-social side to me and I'm really not into playing the human game of proving to everybody how cool and high in the hierarchy I am. I can keep going like that, but the point is that none of the many reasons why people pursue wealth haven't impressed me so far. But now I have found it. Time to enter the race.\n\n.\n\n\n*Though I'm sure there are exceptions, and I'm eager to hear your suggestions for visually interesting Western comics!\n\nEdit: oh, it's the wrong thread. sorry. Hopefully you have found this ramble fun at least in some respect!",
    "permalink": "/r/TheMotte/comments/vosrph/friday_fun_thread_for_july_01_2022/ieksl2o/"
  },
  {
    "kind": "t1",
    "id": "iei8edp",
    "author": "gwern",
    "score": 18,
    "createdUtc": 1656712748,
    "body": "The latest progress in anime neural net generation: [\"Hatsune Miku touching the ground with her hand\"](https://twitter.com/_aixile/status/1542645054946177024) etc ([curated samples](https://www.pixiv.net/en/users/82118785)).",
    "permalink": "/r/TheMotte/comments/vosrph/friday_fun_thread_for_july_01_2022/iei8edp/"
  },
  {
    "kind": "t1",
    "id": "iehrrjr",
    "author": "SecureSignals",
    "score": 9,
    "createdUtc": 1656705610,
    "body": "I just stumbled across the oddest CAPTCHA challenge I've seen, and it has me questioning my intelligence:\n\n&gt;What are the next two in this sequence: 7@three5 26@four6:\n\nThe next two what? Characters? Substrings? Any ideas?",
    "permalink": "/r/TheMotte/comments/vosrph/friday_fun_thread_for_july_01_2022/iehrrjr/"
  },
  {
    "kind": "t1",
    "id": "iehnm0w",
    "author": "orthoxerox",
    "score": 4,
    "createdUtc": 1656703892,
    "body": "I never expected sunglasses with prescription lenses to be such a pain in the ass. I've been wearing prescription glasses for eleven years now, but I've never been a big fan of sunglasses. But something (early onset midlife crisis?) prompted me to get a pair this summer.\n\nFirst of all, modern technology is fucking magical. You sit in front of your computer, switch the webcam on and the website plonks pair after pair on your mug, letting you turn your head to see how you look from every angle. Anyway, after an evening of looking at shades I had an idea of what I wanted: not very big aviators or not very aggressive wraparounds.\n\nSo, armed with this information, I girdle up my loins and hit the friendly neighborhood mini-mall, which has an optical store. \"Sunglasses,\" says I. \"You've come to the right place,\" says the paraoptician. \"*Prescription* sunglasses,\" I clarify. \"Not a problem,\" says the paraoptician, \"what's your prescription?\" I pull out my phone and find the picture of it. \"Not an *insurmountable* problem,\" she hastily corrects herself, \"but you'd better stay away from aviators or wraparound sunglasses with eyes like yours.\" Seeing me visibly deflate after this one-two of hers, she explains that lenses for myopia become too thick at the edges at aviator sizes, you can't just stick them into a thin metal frame, and wraparounds are extremely hard to correct for astigmatism. She leads me to the display case with reasonably flat sunglasses of reasonable size, but I try a few of them on and don't like myself in them one bit.\n\nWe part ways, and entitled to a second opinion, I take the subway to the nearest proper mall with a couple more optical stores. I do the same thing, expecting a different result, and come home disheartened. Then an idea strikes me. Or two ideas, even.\n\nIdea number one: what do the elves of Valinor say about prescription lenses? I dive into the murky depths of SEO-optimized websites of American opticians, amd resurface with a single word: atoric. Which is like aspherical, but for toric lenses (the ones for astigmatism). Unfortunately, no one in Russia knows anything about atoric, atorical, atoroidal lenses.\n\nIdea number two: sports. There *must* be alpine skiers, cyclists, skeet shooters and other people with bad eyesight, and they all want prescription sunglasses glasses of the wraparoundest variety. What's more, they want them to be thin, light and with proper correction across the whole field of vision. I dive into the equally murky depths of SEO-optimized Runet, and bingo! I come back with a few bookmarks for companies that *do* make prescription lenses for active sports.\n\nTo cut a long story short, I am now a not very proud owner of Ray-Ban Baloramas, but the prescription lenses must wait until the summer is over, because otherwise *I* would be waiting for them to get made until the summer was over. Optics are fucking complex, don't let high school physics fool you.",
    "permalink": "/r/TheMotte/comments/vosrph/friday_fun_thread_for_july_01_2022/iehnm0w/"
  },
  {
    "kind": "t1",
    "id": "ieh4771",
    "author": "SituationNo6488",
    "score": 7,
    "createdUtc": 1656695914,
    "body": "Good movies or tv shows lately? Many of them are so boring or woke these days.",
    "permalink": "/r/TheMotte/comments/vosrph/friday_fun_thread_for_july_01_2022/ieh4771/"
  },
  {
    "kind": "t1",
    "id": "iegzixt",
    "author": "Atersed",
    "score": 12,
    "createdUtc": 1656694026,
    "body": "Chain-of-thought prompting not only improves the reasoning ability of language models, but also of 4 year olds:\n\nhttps://www.youtube.com/watch?v=gnArvcWaH6I\n\nI'm only talking about the first 50 seconds, but the whole thing is adorable.",
    "permalink": "/r/TheMotte/comments/vosrph/friday_fun_thread_for_july_01_2022/iegzixt/"
  },
  {
    "kind": "t1",
    "id": "iegc4p2",
    "author": "Medium-Landscape-999",
    "score": 8,
    "createdUtc": 1656684433,
    "body": "I'm way late to the Dall-E party, but does anybody know which historical figure is it that it has such a [low opinion](https://i.imgur.com/wvjTHp8.png) of?",
    "permalink": "/r/TheMotte/comments/vosrph/friday_fun_thread_for_july_01_2022/iegc4p2/"
  },
  {
    "kind": "t1",
    "id": "ieg58kl",
    "author": "WhiningCoil",
    "score": 10,
    "createdUtc": 1656681287,
    "body": "Been a hot minute posting here for me.\n\nKind of been taking a break from games to build the wife a nice 3 bin composter.  She found some plans online, so I invested in the tools, lumber and hardware to get it done.  I actually really had a blast breaking in a ton of power tools.  Picked up a power saw, power sander, brand new cordless power drill.  Then I got a nice cordless oscillating multitool cause it was on sale.  And a shop vac of course because there is going to be sawdust and garbage everywhere in the workshop.  Oh, and you can't forget clamps, squares, saw horses, and other misc woodworking must haves.\n\nI really tried to take my time and do this thing correctly.  Sanded and finished all the parts with raw linseed oil.  Because you need to use something all natural that won't leach into or contaminate the compost.  Each part required 3 coats, with 24 hours of drying time between them, which took forever.  Used a little over 2 quarts.  But the worst part was probably driving by hammer about 200 fence staples to hold the hardware clothe to it.  If I ever do this again, I'm investing in an air compressor and a big ass staple gun.  But nothing is going anywhere with those fence staples in there.\n\nOf course, before I even finished that project, a downburst/tornado, people are still arguing over which, dropped a tree on my car.  Not at all typical for this area, and it's been a big deal how much damage it caused.  They declared a state of emergency and everything.  I don't own a chainsaw yet, so I had to cut the tree off my car with a hand saw so the insurance company could have it towed.  Turns out the car is totaled, which is unsurprising.  Not going to bother buying a new one since it was my family's 3rd car, and oldest, and we really don't **need** a new one, especially in this market.\n\nSo the payout is going to pay off the tree fellers that took down a bunch of other dead and scary looking trees on our property.  The whole county got the same idea more or less.  All day, every day since the storm all you hear is chainsaws and trees falling in the distance.  It was a huge wakeup call.  So now i have a metric fuckton of logs the fellers cut to 18\" to split.  Spent some time on that yesterday and had a blast.  Tried a 12lb splitting maul the previous homeowners left here, along with a splitting diamond.  I'm a pretty robust fellow, but swinging 12lb over my head on a fairly heavy handle wiped me super fast.  And the thing wasn't even that effective.  Wound up just buying a 6lb splitting axe with a fiberglass handle and I've been making quick work since.\n\nI strongly recommend the old school manly virtues of building thing and splitting wood.  It's gotten many an appreciative ogle from the wife.",
    "permalink": "/r/TheMotte/comments/vosrph/friday_fun_thread_for_july_01_2022/ieg58kl/"
  },
  {
    "kind": "t1",
    "id": "ieg2wwj",
    "author": "bl1y",
    "score": 5,
    "createdUtc": 1656680134,
    "body": "Is a nut job the inevitable result of a whack job?",
    "permalink": "/r/TheMotte/comments/vosrph/friday_fun_thread_for_july_01_2022/ieg2wwj/"
  }
]
