[
  {
    "kind": "t1",
    "id": "iil2u16",
    "author": "ItsAPomeloParty",
    "score": 1,
    "createdUtc": 1659402836,
    "body": "I had a 3-month no-drinking promise (I'm that guy (under a new account) who used to write about making promises to God to avoid vices for X amount of time). It lapsed today and I am drunk and so so happy. I have made another promise and am ok with this being something I experience only a few times a year (since chasing that dragon clearly leads only to horrible things).\n\nJust wanna say hi to y'all. Love to everybody.\n\nI wish this were something sustainable. But it is what it is. God has made it so. Chemical happiness is temporary and poisonous and it has to be.",
    "permalink": "/r/TheMotte/comments/waw03g/friday_fun_thread_for_july_29_2022/iil2u16/"
  },
  {
    "kind": "t1",
    "id": "iicjaqt",
    "author": "bulksalty",
    "score": 5,
    "createdUtc": 1659244288,
    "body": "Crazy story about a property developer in LA whose hubris led to bankruptcy and a swanky mansion.  \n\nhttps://archive.ph/5pncd\n\nChalk up another tale that reminds me that property development seems like an absolutely insane business.",
    "permalink": "/r/TheMotte/comments/waw03g/friday_fun_thread_for_july_29_2022/iicjaqt/"
  },
  {
    "kind": "t1",
    "id": "iibil29",
    "author": "slothlikesamwise",
    "score": 7,
    "createdUtc": 1659225267,
    "body": "Does anyone use decentralized apps?\n\nI've poked around again and the survivors of the big boom a few years ago seems to be Dat protocol and IPFS. Any cool uses for them that aren't just filesharing?",
    "permalink": "/r/TheMotte/comments/waw03g/friday_fun_thread_for_july_29_2022/iibil29/"
  },
  {
    "kind": "t1",
    "id": "iian6cu",
    "author": "cjet79",
    "score": 2,
    "createdUtc": 1659210832,
    "body": "Looking for gaming suggestions:\n\n1. Has progression elements. Buying upgrades, gaining experience, etc.\n2. Has skill elements. Like an FPS, action rpg, or some other game that requires some skill.\n3. You can become God like. By the end of it I want my cumulative game skill and upgrades to make the game stupidly easy. Slaughtering foes without a thought, and only the hardest of bosses presenting the slightest challenge.\n\nI can find plenty of games with the first two elements. It's the third element that is difficult to find.",
    "permalink": "/r/TheMotte/comments/waw03g/friday_fun_thread_for_july_29_2022/iian6cu/"
  },
  {
    "kind": "t1",
    "id": "ii6wb1t",
    "author": "ItsAPomeloParty",
    "score": 3,
    "createdUtc": 1659136133,
    "body": "Anybody got any genius miracle cures for \"brain fog\"?\n\nI can't explain why but it feels like screen time might be the culprit so might try to limit that since it is the weekend",
    "permalink": "/r/TheMotte/comments/waw03g/friday_fun_thread_for_july_29_2022/ii6wb1t/"
  },
  {
    "kind": "t1",
    "id": "ii63rde",
    "author": "netstack_",
    "score": 5,
    "createdUtc": 1659124054,
    "body": "Yesterday, I switched to a new Internet provider and got decent speed. Not coincidentally I also reinstalled *League of Legends* for a few rounds with my brother.\n\nIt’s popular enough that this kind of gets taken for granted, but the premise is really clever.\nOn one hand, there’s the distillation of an RPG into each game: do tasks, numbers go up, steer the character to a style you want. There’s a balance between fundamental gameplay loops to improve and broader game *knowledge* to accrue. On the other is the pure PvP aspect using humans as a seed to keep things fresh.\n\nBut what really gets me is the specialization. I like a game which gives a specific job, a part of the machine. You get to play to strengths and watch the whole thing come together. And *League* does this better than a lot of games.\n\nAnyone care to share recommendations in this “specialist” genre?",
    "permalink": "/r/TheMotte/comments/waw03g/friday_fun_thread_for_july_29_2022/ii63rde/"
  },
  {
    "kind": "t1",
    "id": "ii60d0o",
    "author": "SeeeVeee",
    "score": 3,
    "createdUtc": 1659122691,
    "body": "Does anybody have a link to Yarvin's essay that covers why he thinks modern poetry sucks?",
    "permalink": "/r/TheMotte/comments/waw03g/friday_fun_thread_for_july_29_2022/ii60d0o/"
  },
  {
    "kind": "t1",
    "id": "ii5ks9g",
    "author": "eBenTrovato",
    "score": 7,
    "createdUtc": 1659116503,
    "body": "What are your go-to hotel chains, where you always feel like you get good service, a clean room, and your full money’s worth? i.e., what’s the Chick-Fil-A of hotels?",
    "permalink": "/r/TheMotte/comments/waw03g/friday_fun_thread_for_july_29_2022/ii5ks9g/"
  },
  {
    "kind": "t1",
    "id": "ii5i4vr",
    "author": "DWXXV",
    "score": 17,
    "createdUtc": 1659115478,
    "body": "Ready for a deep dive into something completely random?\n\nOkay: Those Who Fight Further\n\nIn 1997 a little game came out called “Final Fantasy 7.” You may have heard of it. The game is wildly influential, often considered one of the best games of all time…and has aged like moderately fine vinegar. If you weren’t active in gaming at the time it’s hard to overstate the influence of the game. It was fantastic, for many people it changed what they thought games were capable of, and one of the spoilers was for decades afterwards (although less so now) was often uttered along with “Vader, father” as one of the top spoilers of all time.\n\nA big part of the game was the music. Nobuo Uematsu and the rest of the sound team had been doing fantastic work with severe technical limitations for ten years at that point, and some of the music from this era transcends videogaming to become some of the best music period (I’d argue Chrono Trigger for this one). Uematsu loved progressive rock, and while he was excellent at classical compositions he loved to inject a flavor that was rare at the time into his music. Compare Dragon Quest with the average Final Fantasy battle theme. \n\nThe music of FF 7 was fantastic. “One Winged Angel” (https://www.youtube.com/watch?v=Ce7gVYs7Em0) is still considered one of if not the best compositions in gaming. “Bombing Mission” (https://www.youtube.com/watch?v=VCcSmvGrGx8) can be unironically (and has been) performed by a massive orchestra. \n\nExcellent battle tracks have always been a tradition in JRPGs, since you’ll be hearing a lot of them, and in the old days you had to stretch one track for almost all the fights in the game.\n\nThe battle track for FF 7 is “Tatakau Monotachi” (https://www.youtube.com/watch?v=DotavimguEU). Limitations in fan translation resources and official releases resulted in this being generally translated (literally) as “Those Who Fight” if you wanted to pirate a MIDI and listen to it on a Walkman or something like that. Sometimes it would be translated as “Fighting” and later, official releases would land on “Let the Battles Begin!”\n\nIt’s fine. Not the best FF has done, but it wouldn’t get that stale for most people. Most encounters are short anyway.\n\nNot so for boss battles. The boss battle theme needs to be a banger, especially in a game that mostly uses one theme for all the bosses.\n\nAND IT FUCKING IS.  \n\n“Sara ni Tatakau Monotachi” (https://www.youtube.com/watch?v=z_GUWdkJQgw) is still excellent, if limited by the technology of the time. Translated literally as “Those Who Fight Further” and occasionally as “Still More Fighting” the song often appears in top FF battle music lists. Later official translations would label it “Fight On!” which I think is a shame since it loses the character of the initial battle/boss battle names. Listening to it now you can tell that something great is hidden in this track limited by technology.\n\nAnd we’ll get there.\n\nIn the years since the initial release FF 7 has remained influential. The music has been remixed thousands of times, it’s been a fixture in orchestral video game concerts, and Nobuo even made a metal band that plays some of these songs (https://www.youtube.com/watch?v=NzFh9GuE0rA). Gamers have been clamoring for a remake of the game. In 2020 they got it.\n\nThe game is controversial for reasons we won’t get into, but the music is not. With a massive team including the original composer they made a truly next gen sound track for a next gen game. Fans had some trepidation, these songs had been remixed by the community, professional composers, and the man himself tons of times. What were they going to do?\n\nWell the answer was use everything learned about these songs and game composition over the last 20+ years. The soundtrack is absurdly good. From modern takes like an atmospheric exploration theme that turns into a battle theme when a fight starts (https://www.youtube.com/watch?v=x5S49M40hv4) , to taking a one note joke enemy and turning it into an absurd and energetic boss battle (https://www.youtube.com/watch?v=eQgXZ2HDiCQ). The game has everything.\n\nThe original battle theme still lives all over the game (https://www.youtube.com/watch?v=Lu-dHQxxv4w), with variations to fit the mood and location of interest. But they hold back on the boss battle music. Yeah it shows up at the end of the first chapter (https://www.youtube.com/watch?v=AdGOnPsE-Xs). And it’s good. But is this it? Is this the epic remix?\n\nNo.\n\nAt the end of chapter 7 you fight a boss that was pretty much a joke in the original game. The fight is epic. And this fucking plays (https://www.youtube.com/watch?v=cQDLBKpbXQU). It has everything. I challenge you to drive the speed limit with this on. They held back, made you think they pretty whiffed on the remix for the boss theme, but they fucking stuck the landing. \n\nThe rest of the soundtrack has some damn good tracks, but nothing injected nostalgia directly into my veins like The Airbuster. \n\nNever forget how powerful music can be.\n\nThank you for coming to my Ted Talk.\n\nDW out. \n\nAnyone who has anything they want to add or correct is welcome!",
    "permalink": "/r/TheMotte/comments/waw03g/friday_fun_thread_for_july_29_2022/ii5i4vr/"
  },
  {
    "kind": "t1",
    "id": "ii4mf7k",
    "author": "margotsaidso",
    "score": 4,
    "createdUtc": 1659103105,
    "body": "/u/2cimarafa Did you ever find that subreddit about obscure test taking? Seemed like a great Friday Fun Thread topic.",
    "permalink": "/r/TheMotte/comments/waw03g/friday_fun_thread_for_july_29_2022/ii4mf7k/"
  },
  {
    "kind": "t1",
    "id": "ii3sijm",
    "author": "orthoxerox",
    "score": 12,
    "createdUtc": 1659085406,
    "body": "I am really enjoying the new army logistics series on aCoUP: https://acoup.blog/2022/07/29/collections-logistics-how-did-they-do-it-part-ii-foraging/",
    "permalink": "/r/TheMotte/comments/waw03g/friday_fun_thread_for_july_29_2022/ii3sijm/"
  },
  {
    "kind": "t1",
    "id": "ii3jab4",
    "author": "DandyPandemonium",
    "score": 10,
    "createdUtc": 1659078173,
    "body": "Recently for the first time, I tried alcohol. The high was really pleasurable and I felt extremely guilty about the hedonistic behaviour. It's only for this reason that I was hesitant about trying an inebriating substance, afraid that I might get addicted. But, any suggestions for fun activity/activities while being high, preferably something eye opening? I usually just listen to tool and other metal songs on shuffle and go into a peaceful zone.",
    "permalink": "/r/TheMotte/comments/waw03g/friday_fun_thread_for_july_29_2022/ii3jab4/"
  },
  {
    "kind": "t1",
    "id": "ii3exax",
    "author": "sonyaellenmann",
    "score": 5,
    "createdUtc": 1659075122,
    "body": "[two Bay Area meetups in August](https://sonya.substack.com/p/august-2022-picnics) that are perhaps of interest to the rest of you dorks as well &lt;3",
    "permalink": "/r/TheMotte/comments/waw03g/friday_fun_thread_for_july_29_2022/ii3exax/"
  }
]
