[
  {
    "kind": "t1",
    "id": "il1dgn9",
    "author": "kcu51",
    "score": 4,
    "createdUtc": 1660977372,
    "body": "How plausible is a scenario where a patient world-optimizing AGI develops the technology and capacity to create an synthetic human representative; and from then on works as much as possible through synth proxies (or natural humans directed by the synths)?",
    "permalink": "/r/TheMotte/comments/ws5dhg/friday_fun_thread_for_august_19_2022/il1dgn9/"
  },
  {
    "kind": "t1",
    "id": "ikxlm5f",
    "author": "yofuckreddit",
    "score": 15,
    "createdUtc": 1660916537,
    "body": "I'm attempting to smoke two huge pork shoulders that are a total of 16 lbs this weekend. The story of my smoking experiences with pork are ones of being off by multiple hours in terms of completion, so I'm working a whole day ahead of time. If I get done early, which has never happened, I'll wrap the meat in aluminum trays and keep it warm. \n\nSince most of y'all are on the west coast I assume the proclivity for cooking vast cuts of meat this way isn't as popular as it is around my neck of the woods. But right now I have a small electric Masterbilt smoker. It was unbelievably affordable in my estimation, it's relatively easy to clean, but I've been electrocuted while it's sprinkling a couple times and I've always wondered if I should be stepping up to a pellet grill at some point. Any comment from someone who's made the move would be welcome. I only smoke stuff 6-7 times a year, so perhaps it's a luxury I shouldn't be considering anyway.",
    "permalink": "/r/TheMotte/comments/ws5dhg/friday_fun_thread_for_august_19_2022/ikxlm5f/"
  },
  {
    "kind": "t1",
    "id": "ikwl5po",
    "author": "practical_romantic",
    "score": 30,
    "createdUtc": 1660893552,
    "body": "It's Janmashtami today. Janmashtami is the day when Lord Krishna was born. He is an incarnation of Lord Vishnu and is one of the most beloved deity.\n\nHe was the charioteer for the supreme warrior Arjun during the Mahabharat. Arjuna didn't want to fight the war and Lord Krishna had a long conversation with him about life which is known as the Gita, the supreme Scripture for many Hindus.\n\nI shall fast today and spend time with my family, read some theology thanks to Gita Press Gorakhpur.\n\nThe very first thing this commentary on the Gita says  is that one must appreciate being born a human. We can experience, conceive and feel divinity, something no other being can do and no matter how bad things are, we will always be lucky as compared to most animals.\n\nThis isn't the same as me going out for talking to girls or consuming substances but I like this a lot. I find theology quite profound and enjoyable to read. I find it more than just fun and hence the motif to post about today here.\n\nMay Lord Krishna bless us all. Happy Janmashtami to everyone reading this.\n\nJai Shri Krishna.",
    "permalink": "/r/TheMotte/comments/ws5dhg/friday_fun_thread_for_august_19_2022/ikwl5po/"
  }
]
