[
  {
    "kind": "t1",
    "id": "ihkt65w",
    "author": "GavinSkulldrinker",
    "score": 4,
    "createdUtc": 1658757173,
    "body": "Here's a writing prompt: \n\nSince I now view Star Wars as a dead franchise, the only thing left fun to do with it is armchair-write-produce-direct it.\n\nWrite a better version of The Last Jedi.  (Which means Force Awakened happened.  Deal with it)\n\nHardmode: Keep as much of the original film's elements as possible.\n\nFunmode: You get to Ignore The Force Awakens.  Do whatever you want with a new Star Wars trilogy",
    "permalink": "/r/TheMotte/comments/w524ad/friday_fun_thread_for_july_22_2022/ihkt65w/"
  },
  {
    "kind": "t1",
    "id": "ihekf5a",
    "author": "f3zinker",
    "score": 2,
    "createdUtc": 1658632426,
    "body": "A post on the CW thread trying to survey the mottes general knowledge and \"IQ\" got removed for supposedly being a troll. I didn't get to look at the questions, so I can't vouch for that.\n\nI am thinking of making an actual general knowledge survey with sections on math, physics, biology, geogpraphy,economics and CS.\n\nI plan to only include multiple choice questions that are straight forward and can be answered using intuition alone, no esoteric knowledge or trap questions. \n\nAny suggestions on other topics? Or how to frame the questions?\n\nI might cross post to a lot of different subreddits and compile the results of each subreddit at the end.",
    "permalink": "/r/TheMotte/comments/w524ad/friday_fun_thread_for_july_22_2022/ihekf5a/"
  },
  {
    "kind": "t1",
    "id": "ihcj6ub",
    "author": "Navalgazer420XX",
    "score": 15,
    "createdUtc": 1658598755,
    "body": "I take back everything I said about the LOTR TV series\\*. I'm already getting half a billion dollars worth of [entertainment](https://pbs.twimg.com/media/FYS5d_YUEAAPl2D?format=jpg&amp;name=orig) from it, and I'm not even gonna watch.\n\nAlso my deeply closeted white trash middle school boyfriend turning out to be Sauron is an acceptable twist, if a lazy and obvious one.\n\n&gt; \\* note: I have previously said nothing about the LOTR TV series",
    "permalink": "/r/TheMotte/comments/w524ad/friday_fun_thread_for_july_22_2022/ihcj6ub/"
  },
  {
    "kind": "t1",
    "id": "ih8alu4",
    "author": "nagilfarswake",
    "score": 4,
    "createdUtc": 1658518654,
    "body": "After not listening to it for several years, I've recently revisited \"Vessels\" by the Australian melodic death metal band Be'lakor. It is a brilliant record; I think it's one of the crowning jewels of the genre both musically and in lyrical poetry.\n\nIt's a concept album, tracing the journey of the energy of a photon of light. Each song is its own self-contained story, starting with the entrance of this bit of energy into a life and ending with the extinguishing of that life's light and the energy's departure. It starts in the fusion forges of the sun, in [An Ember's Arc](https://www.youtube.com/watch?v=IyuDOVm8TG4):\n\n&gt; This cascade of embers,\n\n&gt; Fused into a star's ignition\n\n&gt; A crucible for their collapse,\n\n&gt; Seething crux of its ambition\n\n&gt; ---\n\n&gt; The axiom of this expanse,\n\n&gt; Unrelenting pressure\n\n&gt; Every moment, in each place,\n\n&gt; Collisions beyond measure\n\n&gt; ---\n\n&gt; An ordinary pair that met,\n\n&gt; Whilst merging into one,\n\n&gt; Heaved and spat a mote of light,\n\n&gt; Adrift within the Sun\n\nand it ends in the funeral pyre of a man in [The Smoke of Many Fires](https://www.youtube.com/watch?v=ARI0XyTiips):\n\n&gt; Like billions before him regardless of form\n\n&gt; It ended as chance had decided\n\n&gt; So briefly contained an inferno's refrain\n\n&gt; Having powered and angered and guided\n\n&gt; ---\n\n&gt; At the heart of the blaze awareness dissolved\n\n&gt; Light ascended devoid of desire\n\n&gt; From a trail intertwined life and death strewn behind\n\n&gt; To the stars it returned from the fire",
    "permalink": "/r/TheMotte/comments/w524ad/friday_fun_thread_for_july_22_2022/ih8alu4/"
  },
  {
    "kind": "t1",
    "id": "ih7phca",
    "author": "Difficult_Ad_3879",
    "score": 5,
    "createdUtc": 1658510424,
    "body": "What’s the simplest, most barebones game you can think of? I can’t think of anything simpler than Snake.",
    "permalink": "/r/TheMotte/comments/w524ad/friday_fun_thread_for_july_22_2022/ih7phca/"
  },
  {
    "kind": "t1",
    "id": "ih5t22k",
    "author": "charizard_monster",
    "score": 22,
    "createdUtc": 1658474712,
    "body": "So last week I jumped on a ferry and spent the day touring various sites around the D Day landings. \n\nThis was partly designed as a bonding experience with my dad and partly because it feels to me like the liberation of France is arguably Western democracy’s finest hour.\n\nIn short, I’d recommend the trip. A number of the sites are extremely high quality and clearly received considerable investment from the US government. I almost skipped it, but I’m glad I stopped at the [cemetery at Omaha beach ](https://en.m.wikipedia.org/wiki/Normandy_American_Cemetery_and_Memorial). The grounds are beautiful, and I found the experience of seeing the graves of so many young men surprisingly moving.",
    "permalink": "/r/TheMotte/comments/w524ad/friday_fun_thread_for_july_22_2022/ih5t22k/"
  }
]
