[
  {
    "kind": "t1",
    "id": "ij9ge8b",
    "author": "Ilforte",
    "score": 1,
    "createdUtc": 1659838793,
    "body": "Today – well, yesterday – will become a big day in the history of human creativity. \n\nStable Diffusion, the AI model for text-to-image generation funded by stability.ai's mysterious deep-pocketed sponsors, is live, for now accessible to beta users through a Discord bot; model checkpoint will be released soon.  \nIt's more wonky than DALL-E 2, noticeably «dumber» than something like Google Imagen or Parti when it comes to understanding composition or conceptual merging (likely because it doesn't contain a standalone text encoder model), lazier (in that it leans towards low-order [gluing-things-together](https://cdn.discordapp.com/attachments/1005597086756122644/1005652508036845568/cat_with_bird_wings_-S_244964435_ts-1659836641_idx-0.png), [like Dall-e 2](https://news.ycombinator.com/item?id=32342550) but worse, and filter-like style transfer), with a number of unfortunate failure modes, and far inferior to Midjourney in out-of-the-box aesthetic quality.  \n...But it is the most powerful model we can expect to be able to run on consumer hardware in the foreseeable future, **by far**; it will keep getting better (by upgrading from its naive classifier-free guidance, at least in forks); it will be adopted, adapted and finetuned by companies like Midjourney; and it doesn't engage in censorship (though Discord owners *will* bonk you for stuff they don't like; read Emad's announcements).   \n\nAnd it's so, so very inhumanly broad (taking its stated size of like 5 GB into account), it keeps blowing my mind. It has a reasonably good knowledge of... well, everything, every bit of visual trash we've put on the interwebs over the years, from Unreal Engine *interface* screenshots to Big Chungus and Gigachad memes to styles of particular digital era artists to dumb American celeb portraits and anime waifus; with a disappointingly strong bias towards normie interests, but also a stunning ability to reach coherence, even photorealism – not only is it broad, but it has straight up *memorized* a ton of stuff, to the point it discards less definite aspects (consider [\"painting by Edmund Blair Leighton of a beautiful barmaid in old silky clothes sitting on the floor, looking sad, detailed face, touching her clothes and her face, the interior of a medieval castle in the background, 4k oil on linen by Edmund Blair Leighton, highly detailed, soft lighting 8k resolution\"](https://cdn.discordapp.com/attachments/1005595971306127470/1005639368322588863/painting_by_Edmund_Blair_Leighton_of_a_beautiful_barmaid_in_old_silky_clothes_sitting_on_the_floor_looking_sad_detailed_face_touching_her_clothes_and_her_-n_9_-S_2965080456_ts-1659833507_idx-0.png) or [HDRI of Nier Automata landscape, Unreal Engine, Artstation](https://cdn.discordapp.com/attachments/1005596415755554866/1005653583062106213/HDRI_of_Nier_Automata_landscape_Unreal_Engine_Artstation_-W_1024_-n_9_-S_3050328502_ts-1659836890_idx-0.png)). \n\nAnd it's *not* hopeless to keep playing around with prompt wording and arguments (particularly after finding [a nice seed](https://twitter.com/TomLikesRobots/status/1555466892759941122) – it is *unbelievably* obedient to the seed, consider these iterations [1](https://cdn.discordapp.com/attachments/1005626617982357614/1005655065383669811/Detailed_masterpiece_concept_art_of_Cyberpunk_Princess_Zelda_in_a_gritty_world_hyperdetailed_concept_art_by_Ross_Tran_and_Greg_Rutkowski_hig_-H_768_-C_3.0_-s_120_-S_4145381887_ts-1659837249_idx-0.png), [2](https://cdn.discordapp.com/attachments/1005626617982357614/1005655300302458990/Detailed_masterpiece_concept_art_of_Cyberpunk_Princess_Zelda_in_a_gritty_world_hyperdetailed_concept_art_by_Ross_Tran_and_Greg_Rutkowski_high_quali_-H_768_-C_6.0_-S_4145381887_ts-1659837306_idx-0.png), [3](https://cdn.discordapp.com/attachments/1005626617982357614/1005655540506050681/Detailed_masterpiece_concept_art_of_Princess_Zelda_in_a_gritty_fantasy_world_hyperdetailed_concept_art_by_Ross_Tran_and_Greg_Rutkowski_high_quality_DnD_il_-H_768_-S_4145381887_ts-1659837364_idx-0.png)), because the search space is vast; you may well discover a stunning gem in the multidimensional sea of ugly machine nonsense.\n\nUnlike Midjourney which can make up its own story out of any sequence of characters (usually by defaulting to the characteristic cyan-magenta-orange «pretty» palette, cute women and some blurry castles in the mountains, or to «abstract symmetries»), it seems to play better with maximalist prompting (i.e. specifying as many attributes as possible). \n\nSome pics I've liked out of the endless stream powered by 4000 A100s (sharing explicitly allowed by rules): [a painted landscape](https://cdn.discordapp.com/attachments/1002331558453198878/1005509893886844998/unknown.png), [a disney style alien landscape](https://cdn.discordapp.com/attachments/1005505757367775353/1005649560414212196/alien_landscape_in_disney_style__lots_of_flowers_and_vegetation_cinematic_lighting_-H_704_-W_1280_-n_4_-S_1536751999_ts-1659835936_idx-0.png), [another one](https://cdn.discordapp.com/attachments/1005626910941904916/1005657405331341352/a_lake_surrounded_by_magical_flowers_and_fireflies_reflecting_a_starry_night_sky_-n_4_-S_2082651028_ts-1659837809_idx-0.png), [Bike monks](https://cdn.discordapp.com/attachments/1005512133070557194/1005650387283476500/A_monk_in_a_tan_trenchcoat_with_an_anime_face_sitting_next_to_his_motorbike_in_a_dark_forest_by_the_fireside_on_the_top_of_a_mountain_looki_-H_704_-W_1280_-n_6_-i_-S_3162738296_ts-1659836133_idx-0.png), [some nice Korean food](https://cdn.discordapp.com/attachments/1005505757367775353/1005648186574131260/Korean_chilaquiles_food_photography_-n_9_-i_-S_413881088_ts-1659835609_idx-2.png), [generic fantasy girl](https://cdn.discordapp.com/attachments/1005512133070557194/1005651507611447447/beautiful_female_warrior_by_Stanley_Artgerm_Lau_WLOP_Rossdraws_James_Jean_Andrei_Riabovitchev_Marc_Simonetti_tranding_on_artstation_-n_4_-i_-S_2072669443_ts-1659836399_idx-1.png), [a gamer's cozy bedroom drawing](https://cdn.discordapp.com/attachments/1005627087513714739/1005642349533200434/A_bedroom_from_the_80s_by_Kung_Fury_by_Ready_Player_One_volumetric_lighting_rendered_by_Octane_highly_realistic_4k_wallpaper_trending_on_Artstation_-W_1024_-S_2451384805_ts-1659834219_idx-0.png), [Leonardo DiCaprio as Doctor Strange](https://cdn.discordapp.com/attachments/1005543895024812062/1005651132070248468/Leonardo_Di_Caprio_as_Doctor_Strange_-H_1024_-W_768_-n_9_-i_-S_3492117381_ts-1659836312_idx-0.png), [Walter White in Overwatch](https://cdn.discordapp.com/attachments/1005543938293244006/1005649734058389616/walter_white_in_overwatch_-n_9_-i_-S_3285161354_ts-1659835980_idx-4.png), [a duck in the city](https://cdn.discordapp.com/attachments/1005596500845404301/1005655136380669972/a_high_quality_low_wide_angle_photo_of_a_Greylag_Goose_on_the_streets_of_a_cyberpunk_city_rainy_reflective_ground_neon_lights_realism_8k_-n_6_-i_-S_281958669_ts-1659837268_idx-0.png), [some video game sprite assets](https://cdn.discordapp.com/attachments/1005596709113561198/1005643987039817749/video_game_sprite_trees_hd_high_resolution_stylized_game_art_-H_768_-n_3_-S_957499865_ts-1659834607_idx-0.png), [surrealism](https://cdn.discordapp.com/attachments/1005626576169357313/1005656328183762954/a_hd_surrealism_painting_of_3d_cast_glass_galactic_hypercube_sculptures_buildings_by_salvia_dali_the_second_salvador_dalis_much_more_talented_painter_co_-n_4_-i_-S_1171909367_ts-1659837552_idx-1.png), [stock market crash](https://cdn.discordapp.com/attachments/1005596318267363488/1005616485324046409/stock_market_collapse_red_charts_recession_fantasy_matte_painting_office_trader_-H_768_-n_9_-i_-S_4254594815_ts-1659828050_idx-6.png)... \n\nCherrypicks readily available on [Twitter](https://twitter.com/hashtag/stablediffusion?src=hashtag_click) or /r/MediaSynthesis. \n\nIn case somebody still doubted: the age of creative post-scarcity is here. This is not a drill. This will not be contained. This will not hit a wall.  \nHave fun.",
    "permalink": "/r/TheMotte/comments/wgmqqy/friday_fun_thread_for_august_05_2022/ij9ge8b/"
  },
  {
    "kind": "t1",
    "id": "ij6btm0",
    "author": "orthoxerox",
    "score": 1,
    "createdUtc": 1659786818,
    "body": "I've just spent some pleasant minutes eating gooseberries and yostaberries straight off my bushes, which is the best way to eat berries. Blackcurrants are out of season, and blackberries are just starting to darken. Do you have any berry bushes, what's in season right now where you live?",
    "permalink": "/r/TheMotte/comments/wgmqqy/friday_fun_thread_for_august_05_2022/ij6btm0/"
  },
  {
    "kind": "t1",
    "id": "ij5zec7",
    "author": "-gipple",
    "score": 1,
    "createdUtc": 1659777008,
    "body": "Does anyone have any book recommendations for doing business in South East Asia? Or any information in general?",
    "permalink": "/r/TheMotte/comments/wgmqqy/friday_fun_thread_for_august_05_2022/ij5zec7/"
  },
  {
    "kind": "t1",
    "id": "ij42xvx",
    "author": "russokumo",
    "score": 4,
    "createdUtc": 1659737804,
    "body": "What are the \"best value\" public school districts in the USA?let's define the numerator of value as the likelihood that your child achieves top 1% income or prestige in their lifetime relative to the rest of people their age in the country. Let's define the denominator as how much it would cost you to either buy or rent in that school district for the duration of your child's schooling.\n\nWe will make a very very bold and impossible assumption that the parents have remote jobs and can work anywhere in the country and don't have family members or friends they care about for network effects.\n\nI don't have specifics, but my strong suspicion is the top high schools would all be in the flyover country part of America vs somewhere like Scarsdale NY or Palo Alto. Main reason being that undergraduate colleges care about class rank as well as geographic diversity and it's much easier for an admissions officer to justify giving an offer to the only red headed trombone player with a 1600 SAT from Nebraska, vs the 20 they can find in Lowell high School in SF.\n\n\nOne of the other posters belows question on schools got me curious so thanks for inspiring me!",
    "permalink": "/r/TheMotte/comments/wgmqqy/friday_fun_thread_for_august_05_2022/ij42xvx/"
  },
  {
    "kind": "t1",
    "id": "ij2pval",
    "author": "cjet79",
    "score": 12,
    "createdUtc": 1659718510,
    "body": "Last week [I asked for gaming suggestions](https://www.reddit.com/r/TheMotte/comments/waw03g/friday_fun_thread_for_july_29_2022/iian6cu/). Thanks again to everyone that left suggestions. I started with [Hades](https://store.steampowered.com/app/1145360/Hades/), suggested by u/S18656IFL. And I've been loving the game. But after about a dozen hours of gameplay I've started trying to mod the game. I want MORE POWER! And I'm doing it by adding more levels to the meta power system, and trying to give myself more rooms to go through for each level. I will either break this game or achieve ultimate power.",
    "permalink": "/r/TheMotte/comments/wgmqqy/friday_fun_thread_for_august_05_2022/ij2pval/"
  },
  {
    "kind": "t1",
    "id": "ij2jm67",
    "author": "Just_Natural_9027",
    "score": 10,
    "createdUtc": 1659716125,
    "body": "What is some of the most interesting research you have come across that is not widely known it can be from your field of expertise or just something you found while browsing google scholar.",
    "permalink": "/r/TheMotte/comments/wgmqqy/friday_fun_thread_for_august_05_2022/ij2jm67/"
  },
  {
    "kind": "t1",
    "id": "ij22sho",
    "author": "thisismymilitaryalt",
    "score": 33,
    "createdUtc": 1659709521,
    "body": "Here's a list of fun things I've discovered trawling historical documents over the last month:\n\n* A Navy civilian employee during the Kennedy administration filed a series of grievances against her supervisor. The resulting investigation, hearings, and appeals eventually generated nearly 5000 pages of documents, or enough to fill about two banker's boxes. After losing her final appeal, she then requested copies of all associated material and mailed said material to the White House, along with a letter addressed to JFK in which she asked the President to intercede on her behalf and over-rule the appeals board. Nothing I reviewed indicates whether or not JFK ever personally looked into the matter. May we all be so dedicated to the causes we hold dear.\n\n* The DoD once bought 7-figures worth of locomotives for another country only to discover they were incompatible with that country's existing rail system.\n\n* Two Admirals spent a month arguing whose department would pay for the installation of a $300 telephone system (roughly $2900 dollars today).\n\n* In a DoD survival guide to [REDACTED], service personnel were advised against accepting a \"tribal virgin\" a friendly tribal chief might offer them, not for ethical reasons, but because a tribal warrior might challenge them to trial-by-combat.",
    "permalink": "/r/TheMotte/comments/wgmqqy/friday_fun_thread_for_august_05_2022/ij22sho/"
  },
  {
    "kind": "t1",
    "id": "ij1vpdj",
    "author": "f3zinker",
    "score": 11,
    "createdUtc": 1659706535,
    "body": "Lex Fridman released a [5 hour long podcast](https://www.youtube.com/watch?v=I845O57ZSy4) with John Carmack (probably one of the best programmers ever). Definitely a treat for programmers of various stripes.\n\n_______________________________________\n\nOn a side-note I want to discuss a potential weakness/strength of rationalist discourse. \n\nAt one point in this podcast Lex says \"maybe aliens will visit us sometime in the future and they will see almost everything is running on javascript\". Basically wrapping \"at the rate things are going, its probable that everything will run on javascript eventually\" with a cute little story. \n\nI realized I would be much more impulsively skeptical if told the latter than the former. I want to know if anyone else would have this tendency as well. \n\nI mean wrapping ideas and concepts in stories is quite literally culture, but I think its something that should be done judiciously when the ideas are not as universally agreeable, the rationalists do have a habit of doing this a whole lot. And thinking in stories and wrapping your internal thought process in them might just make you more susceptible to bullshit.",
    "permalink": "/r/TheMotte/comments/wgmqqy/friday_fun_thread_for_august_05_2022/ij1vpdj/"
  },
  {
    "kind": "t1",
    "id": "ij1o0b2",
    "author": "orthoxerox",
    "score": 22,
    "createdUtc": 1659702903,
    "body": "[Old jokes](https://dynomight.net/old-jokes/)",
    "permalink": "/r/TheMotte/comments/wgmqqy/friday_fun_thread_for_august_05_2022/ij1o0b2/"
  },
  {
    "kind": "t1",
    "id": "ij1nc57",
    "author": "WhiningCoil",
    "score": 12,
    "createdUtc": 1659702552,
    "body": "So I found one of those rare, modern PC games I don't hate.\n\nAt first I was curious about, and then enthralled by Hardspace: Shipbreaker.  It's a game where you tear down derelict spacecraft for scrap.  Feels like peeling a very intricate onion, with lots of hazards that will burn, freeze, electrocute, crush or explode you.  But generally if you are careful and thoughtful, none of those things happen.  Well, generally.  Sometimes there is no avoiding an explosive decompression.\n\nI \"beat\" that right before Xenoblade Chronicles 3 came out.  I'm actually really appreciating the pacing of this one way more than XC2.  I swear it was what, 10 hours into the game they were still explaining core mechanics to you?  Now don't get me wrong.  XC3 is still throwing a new mechanic at me every play session.  But it just feels a bit more evenly paced?\n\nAnyways, I'll probably have more thoughts as I go through it, but if you liked XC2 it's a strong recommend.",
    "permalink": "/r/TheMotte/comments/wgmqqy/friday_fun_thread_for_august_05_2022/ij1nc57/"
  },
  {
    "kind": "t1",
    "id": "ij1hg9v",
    "author": "Difficult_Ad_3879",
    "score": 16,
    "createdUtc": 1659699259,
    "body": "As I am continuing my long pursuit to learn all the obscurities of reinforcement and punishment psychology,  here are a couple fun tidbits I’ve come across:\n\n* The stimulus that signals the end of a punishment, or is even *more toward the end* of a punishment, takes on positive valence in flies, mice, and (debated) humans. Not just *within the context of punishment*, but outside the context too. If you zap a mouse for a couple minutes and toward the end of the zap you play a certain sound, the mouse will “like” this sound and approach it outside the context. This is a kind of relief learning, where we begin to desire things that are associated with relief. \n\n* It’s commonly understood that exposing yourself to a fearful thing will gradually erase the fear, however the duration in which you expose yourself is crucial. In experiments of mice and men, short and sporadic exposures to a conditioned fear without the accompanying fearful thing can actually *increase fear* more than no exposure. And unlike in reinforcement learning, spaced trials are inferior to massed trials (although spaced mass trials are best). This seems extremely under appreciated because it indicates that merely thinking about your fear in short durations will increase it, something that a lot of people do. For the extinction of a fear to occur, a sufficiently prolonged exposure is necessary (for humans 15+min), ideally in massed trails (15min repeatedly).",
    "permalink": "/r/TheMotte/comments/wgmqqy/friday_fun_thread_for_august_05_2022/ij1hg9v/"
  },
  {
    "kind": "t1",
    "id": "ij14qs2",
    "author": "Imaginary-Cable9022",
    "score": 12,
    "createdUtc": 1659689956,
    "body": "Where can I find a list of American high schools by average SAT (or ACT) score?\n\n(The background for this is I'm looking to move in the next year and buy a house to raise my kids in.  I am not tied to any location for work; I care mostly about the education and the culture and the peers my kids will interact with.  When comparing schools and districts, there are lots of dimensions to compare, but most are subjective, difficult to measure, or difficult to compare across states.  SAT scores are cold hard facts that correlate to a lot of things I care about, but they're hard to find.  Niche.com, for instance, posts scores, but they're survey answer questions.)",
    "permalink": "/r/TheMotte/comments/wgmqqy/friday_fun_thread_for_august_05_2022/ij14qs2/"
  },
  {
    "kind": "t1",
    "id": "ij137le",
    "author": "Lsdwhale",
    "score": 9,
    "createdUtc": 1659688698,
    "body": "**Telegram chat status update**\n\n\nRemember [that](https://t.me/quokkas_den)? It's still around, yes. Recently we got semi-recognition and a link in the subreddit's sidebar.\n\nRefresher:\n\n*Q: What is the point?*\n\nLower inhibition, lower effort conversations. While civility and order is maintained,  most of TheMotte rules do not apply. Why? Well, we do already have a place where they apply. Motte rules produce good discussions, but also constrain, so I thought there is value in  experimenting with something a little different. Chat format is a good fit for that - it has different architecture and features compared to a forum like this one. \n\n*Q: Is it private?*\n\nNope. At least don't treat it like it is - Telegram asks your phone number. Possible remedy for those of us unfortunate to live in places where this might be a concern - buy a burner phone, you might need it anyway. Or try to suppress the urge to speak blasphemies, I guess?",
    "permalink": "/r/TheMotte/comments/wgmqqy/friday_fun_thread_for_august_05_2022/ij137le/"
  },
  {
    "kind": "t1",
    "id": "ij0qba8",
    "author": "DuplexFields",
    "score": 9,
    "createdUtc": 1659678854,
    "body": "\"The first step in escaping a prison is realizing you're in a prison.\"\n\n\"...Why would the simulation want me to punch a baby?\"\n\nAuralnauts Star Wars: [Existential Stormtroopers episode 1](https://www.youtube.com/watch?v=gKppwACQ-qk) and [episode 2](https://www.youtube.com/watch?v=eoU_7Xg3Zzw) - lots of spoilers for The Mandalorian series\n\n\"If the consequences of self-awareness are super-powered genocide babies, then maybe it's not worth it.\"",
    "permalink": "/r/TheMotte/comments/wgmqqy/friday_fun_thread_for_august_05_2022/ij0qba8/"
  }
]
