[
  {
    "kind": "t1",
    "id": "ib52hlw",
    "author": "Im_not_JB",
    "score": 1,
    "createdUtc": 1654345736,
    "body": "How do y'all browse reddit on mobile? I'm pure old reddit + RES on a laptop, but have never really liked reddit on mobile. I prefer not to get the app. I'm thinking of switching to Firefox Nightly on my phone in order to get at other extensions/settings, so now is the perfect time to reconsider what I want out of reddit on my phone. My habit is mostly just TheMotte and a couple image meme subs like programmerhumor.",
    "permalink": "/r/TheMotte/comments/v3s27m/friday_fun_thread_for_june_03_2022/ib52hlw/"
  },
  {
    "kind": "t1",
    "id": "ib2wft2",
    "author": "cjet79",
    "score": 1,
    "createdUtc": 1654289843,
    "body": "I've been playing [V Rising](https://store.steampowered.com/app/1604030/V_Rising/) lately.\n\nIt is a vampire survival game. You build forts, hunt down people for their blood, fight bosses, and unlock gear to improve your character.\n\nI've had a decent amount of fun, but I've also been at war with the game's expected way of playing. \n\nV Rising is meant to be a multiplayer game. All of the default game and difficulty settings are meant for multiplayer. A boss that might be fodder in front of three players is nearly impossible alone. There are also built in time and resource sinks, which require quite a bit of grinding. Some of those time and resource sinks are shared sinks. So if you build a castle for you and your friends to keep that castle running you need to collect \"blood essence\". But its a shared sink, so if you need 1000 blood essence a night then that is 1000 blood essence if you are alone, and 200 blood essence if you split it with 4 other players. There are other similar resource and time sinks that become strictly easier with more people.\n\nAnyways, its hard for me to convince my friends to play games with me. My idea of a commitment to play together is averaging 1-2 hours a night playing the game. Their idea of a commitment to play together is two hours a week (and no more time spent, because then I will get too far ahead of them).\n\nSo I play the game in single player mode. I had to start over after my first playthrough because even though I made all the settings easier on myself, I didn't go nearly far enough. Kudos to V Rising for allowing me to change the settings. But I can't help but be a little annoyed that great multiplayer games feel shut off to me.",
    "permalink": "/r/TheMotte/comments/v3s27m/friday_fun_thread_for_june_03_2022/ib2wft2/"
  },
  {
    "kind": "t1",
    "id": "ib2t4nk",
    "author": "eBenTrovato",
    "score": 1,
    "createdUtc": 1654288198,
    "body": "I'm a big fan of the anthology series *Inside No. 9*, a BBC show from the brilliant Reece Shearsmith and Steve Pemberton. The show is now in its seventh season and has undergone a transformative process that always fascinates me in long-running media: the same \"piece\" of entertainment essentially becoming a new work inside of itself.\n\nDue to some combination of COVID restrictions around filming and the self-professed burnout/fatigue of its creators, the last two seasons of *Inside No. 9* have taken on a less whimsical, more indecipherable, and far more referential air than the preceding five (clearly paying homage to events or storylines from real life/other series as the creators grasp for ideas). I realized while trying to rank my favorite episodes that the series has evolved to the point where it's very difficult to compare the most recent episode to those from the opening season.\n\nIt's always interesting when this happens; I'm thinking of things like *The Simpsons* trying to adapt to a world with *South Park* and *Family Guy* and losing its own identity in the process, *Game of Thrones* and its infamous failure to create any original material with the quality and complexity of the book series it could no longer adapt, *Pirates of the Caribbean* and *Star Wars* and *Fantastic Beasts* and many others starting out as action-packed interesting stories that had a need to be told and transforming into episodic serials with nothing at stake (indeed, this basically happened to Disney-Pixar as a company), *Succession* and *It's Always Sunny* starting out as tight-knit (if insane) character dramas and dissolving into flanderized versions of themselves as the creators burned out. What other works come to mind? Is this always a downward process toward worse material or has an entertainment property ever evolved into something better than its beginning stage over a long period of time?\n\nBut this all brings me to my bigger point: I believe that **creative burnout** will be the defining label of entertainment, business, and society as a whole in our current age. If woke, surface-level storylines with all the artistic quality of 1990s Christian family films have come to dominate the streaming menus and theatre marquees, I would argue that it's only because a total drought of creative energy preceded them. *Star Wars* became a paint-by-numbers corporate convention skit because there was no *creative urgency*; no **need** to innovate and tell a great story in a great way. That concept - **to be creatively great in a great way** - now seems to be a relic of the past (think how pathetic the legitimately great aspirational idealism of Walt Disney or Leonard Bernstein or Steve Jobs would sound in a corporate boardroom today at Disney or the New York Philharmonic or Apple). I don't see that creative *chutzpah* returning with Generation Z, the most conformist and politically-militant youth generation since children wore [patches depicting bundles of wood](https://en.wikipedia.org/wiki/Fasces#/media/File:Fasces.svg) on their jackets, so what's the outlook? Was this just an American postwar flash-in-the-pan? Are we bound to see the problem get worse or will there be an uptick in aspirational originality without the obsession of \"originality,\" in so many words?",
    "permalink": "/r/TheMotte/comments/v3s27m/friday_fun_thread_for_june_03_2022/ib2t4nk/"
  },
  {
    "kind": "t1",
    "id": "ib26uec",
    "author": "disposablehead001",
    "score": 4,
    "createdUtc": 1654277719,
    "body": "I went to karaoke recently and realized a huge number of the songs I’ve memorized aren’t in the lists. I’m going to again soon, and I’m trying to formulate a list of stuff I know well enough and would actually be available. I’m essentially down to 90’s-00’s rap hits and some Sinatra songs. Any recommendations?\n\nBtw [Hot in Herre](https://m.youtube.com/watch?v=GeZZr_p6vB8) still holds up. Total bop.",
    "permalink": "/r/TheMotte/comments/v3s27m/friday_fun_thread_for_june_03_2022/ib26uec/"
  },
  {
    "kind": "t1",
    "id": "ib20sai",
    "author": "HighResolutionSleep",
    "score": 9,
    "createdUtc": 1654275084,
    "body": "me: life is pointless and has no meaning\n\nalso me (clueless): *listens to the first half of pantheon's theme song one time*\n\nme: i cast my excuses into the dirt",
    "permalink": "/r/TheMotte/comments/v3s27m/friday_fun_thread_for_june_03_2022/ib20sai/"
  },
  {
    "kind": "t1",
    "id": "ib1qp8g",
    "author": "FiveHourMarathon",
    "score": 12,
    "createdUtc": 1654270833,
    "body": "So stuck at home with Covid, I watched the entire [first season of *Love Island Australia*](https://en.wikipedia.org/wiki/Love_Island_Australia) with my wife across the last week. **Never has there been a more perfect demonstration of how male confidence functions than this show.**\n\nFor those of you unaware, Love Island is a dating game show, where you find a bunch of female and male tanned sluts who want to get on tv and aren't peculiarly bright, and you lock 12 of them at a time in a vacation villa. Everyone has to form a couple, and the producers add and subtract people as they go, with new people having to find a partner and the odd-men-out getting booted (or sometimes getting booted by contestant/public votes). The last couple left wins the cash prize. So everyone is always trying to either strengthen the relationship they have, or seek out a new one if they don't think the current one is going anywhere.\n\nFor whatever reason, on this particular season of Love Island, there was very little love. Connections were not made by the majority of contestants, and by halfway through it was obvious who would win because there were only like two couples and the girls had formed this weird culture of rejecting every new guy that came in. But what was still interesting was the way the process impacted the contestants. One after another, you had these jacked and tan Aussie gigachads coming into the Villa full of piss and vinegar and confidence, dead certain they would get any girl they wanted, probably because that's their experience in the real world. You had [tall jacked techno DJs](https://loveisland.fandom.com/wiki/John_James_Parton), [literal Harley riding male strippers](https://loveisland.fandom.com/wiki/Jaxon_Human), and [mutiple](https://loveisland.fandom.com/wiki/Elias_Chigros) [Male Models](https://loveisland.fandom.com/wiki/Justin_Lacko). One after another they all strike out completely, and you could just watch their confidence drain out of them as they stayed week after week. A lot of these guys either self-eliminated and went home on their own, or just gave up and stopped trying to hit on anyone, because they had gotten rejected so many times so harshly. You could watch as their approaches went from \"Hey babe, want to oil my muscles\" to fawning and overeager, and listen to the girls talk about how the desperation was a turnoff.\n\nI feel like there's a valuable lesson for single men trying to figure out dating somewhere in there. Something like, confidence is situational, and nothing will provide you with objective confidence in all situations, you just need to maintain your self-worth and play your part. Josh, who ultimately finished third despite not getting any romantic connections until late in the season, stayed within himself and adapted to his part, so when a new girl came in he didn't fuck it up. Jaxon let it get to him, and became so desperate he started second guessing himself, and didn't stand a chance. So maybe you can find some wisdom in odd places.",
    "permalink": "/r/TheMotte/comments/v3s27m/friday_fun_thread_for_june_03_2022/ib1qp8g/"
  },
  {
    "kind": "t1",
    "id": "ib1plfi",
    "author": "Difficult_Ad_3879",
    "score": 8,
    "createdUtc": 1654270357,
    "body": "I’m fascinated in how gambling is addictive. I watched some Twitch drama videos because a streamer (XQC) gambled and lost two million dollars. In the era of MMORPGs and MOBAs, which are highly sophisticated reinforcement platforms with gambling mechanisms, people still play slots. \n\nFrom my understanding, if you look at slots, the crucial aspect is the *quickly repeated behavior* with clear reward/punishment. The fast repetition and multi-sensory (auditory/visual) focus makes these reward/punishment states very salient, so the mind can strongly distinguish between the two, growing the desire for the reward and dislike of the punishment. Slots use movement, which probably enhances visual focus. The randomness of the reward increases craving by modulating attention; the “near-misses” build anticipation by creating a sense of proximity to reward, staving off discouragement. The flashy lights and sounds add a little bit of reward as well as focus. All this leads to the reward of winning becoming as clear as any possible behavior, and then strengthened with every repetition. I’m surprised they don’t add more reinforcing agents like warming your seat but keeping the air cool, or releasing a scent they increases alertness when you win, or — well, don’t want to give anyone ideas. But I’d wager they can make gambling 20% more addictive.\n\nI think the lynchpin for this all working is that, unlike a video game, money is already imbued with value. A video game has to invest value in certain rewards over time by repeated association, but when you gamble the reward is already maximally invested with value, because everyone knows the value of $100. And so, as you care more about money (looking at your paycheck), the thrill of gambling is *increased*. Finally, the more you gamble, the *less salient* the value of money is, because you’re hyperfocused in a context where the numeral value of a dollar is blurred with the inherently rewarding behavior of engaging in the gamble loop. Someone hyperfocused on slots is not going to be able to immediately call to mind the value of $20 for (say) their kid, because their attentional resources are focused on the association of money with the game they are playing.\n\nSort of insane that this is legal.",
    "permalink": "/r/TheMotte/comments/v3s27m/friday_fun_thread_for_june_03_2022/ib1plfi/"
  },
  {
    "kind": "t1",
    "id": "ib1cux9",
    "author": "OrangeCatolicBible",
    "score": 1,
    "createdUtc": 1654264693,
    "body": "[Bees Are Fish, California Court Rules.](https://www.vice.com/amp/en/article/5dgnn8/bees-are-fish-california-court-rules)",
    "permalink": "/r/TheMotte/comments/v3s27m/friday_fun_thread_for_june_03_2022/ib1cux9/"
  }
]
