[
  {
    "kind": "t1",
    "id": "ilyae70",
    "author": "KulakRevolt",
    "score": 1,
    "createdUtc": 1661566546,
    "body": "A poem from Yours Truly on the Occasion of u/Tracingwoodgrains wedding  \n\n\n[https://anarchonomicon.substack.com/p/the-fox-and-the-hen?sd=pf](https://anarchonomicon.substack.com/p/the-fox-and-the-hen?sd=pf)",
    "permalink": "/r/TheMotte/comments/wy0c32/friday_fun_thread_for_august_26_2022/ilyae70/"
  },
  {
    "kind": "t1",
    "id": "ilxhahm",
    "author": "rolabond",
    "score": 1,
    "createdUtc": 1661552909,
    "body": "It seems like no amount of technological progress makes moving less terrible. I hate it. Listening to emo music because it fits the mood as I pack. Thank you MCR.",
    "permalink": "/r/TheMotte/comments/wy0c32/friday_fun_thread_for_august_26_2022/ilxhahm/"
  },
  {
    "kind": "t1",
    "id": "ilxgm3j",
    "author": "Atersed",
    "score": 1,
    "createdUtc": 1661552615,
    "body": "This week I learned that the original *The Sims* game manual came with recommended reading. https://archive.org/details/The_Sims/page/n43/mode/2up\n\nReproduced in full: \n\n&gt; RECOMMENDED READING\n&gt; Here are some titles that might enhance your understanding of some of the background and sociai issues entertained in The Sims.\n&gt; \n&gt; Warning: all are filled with provocative ideas; Maxis disavows any responsibility for encouraging deep thought.\n&gt; \n&gt; - Home: A Short History of an Idea by Witoid Rybczynski (Juiy 1 987), Penguin USA; ISBN: 0140102310\n&gt; \n&gt; - Notes on the Synthesis of Form by Christopher W. Alexander (June 1970), Harvard University Press; ISBN: 0674627512\n&gt; \n&gt; - A Pattern Language : Towns, Buildings, Construction by Christopher Alexander, Sara Ishikawa, Murray Silverstein (1977), Oxford University Press (Trade); iSBN: 0195019199\n&gt; \n&gt; - Architecture : Form, Space, &amp; Order by Frank D. K. Ching, Francis D. Ching (February 1996), John Wiiey &amp; Sons; ISBN: 0471286168\n&gt; \n&gt; - Housing by Lifestyle : The Component Method of Residential Design by James W. Wentling (November 1994) McGraw-Hill; ISBN: 0070692939\n&gt; \n&gt; - Time for Life : The Surprising Ways Americans Use Their Time by John P Robinson, Geoffrey Godbey (Contributor), Robert Putnam (June 1997)Pennsylvania State University Press (Trade); ISBN: 0271016523\n&gt; \n&gt; - Maps of the Mind by C. Hampden-Turner (March 1982), MacMillan Publishing Company; ISBN: 0025477404\n&gt; \n&gt; - Hidden Order: The Economics of Everyday Life by David D. Friedman (September 1997), HarperCollins; ISBN: 0887308856\n&gt; \n&gt; - Making the Most of Your Llama by Linda C. Beattie (Editor), Araneen Witmer (Illustrator), Kathyrn Doll (Editor), Dr. Linda Beattie (September 1998), Kopacetic Ink; ISBN: 0961963417 \n&gt; \n&gt; - Finding Your Perfect Love by Arthur Clark, Cassandra Skouras (January 1998), Rosebud Press; ISBN: 0965276902\n&gt; \n&gt; - The User Illusion : Cutting Consciousness Down to Size by Tor Norretranders, Jonathan Sydenham (Translator) (April 1998), Viking Press; ISBN: 0670875791\n\n----\n\nIn other news, Will Macaskill worked as a stripper? \n\nhttps://www.newyorker.com/magazine/2022/08/15/the-reluctant-prophet-of-effective-altruism\n\n&gt; In graduate school, “I started giving three per cent, and then five per cent, of my income,” he said. This wasn’t much—he was then living on a university stipend. “I think it’s O.K. to tell you this: I supplemented my income with nude modelling for life-drawing classes.” The postures left him free to philosophize. Later, he moved on to bachelorette parties, where he could make twice the money “for way easier poses.”\n\n----\n\nAnd finally, after playing with Stable Diffusion, I am blown away. A wholly original work of art created inside a minute. Yes, it is hit or miss, but it is amazing that it can hit at all. \n\nYou are probably already saturated with AI art, but [here are a few of my favourites](https://imgur.com/a/lti20Ia). Perhaps you can tell something about a person from the kind of art they generate. Feel free to share your creations.",
    "permalink": "/r/TheMotte/comments/wy0c32/friday_fun_thread_for_august_26_2022/ilxgm3j/"
  },
  {
    "kind": "t1",
    "id": "ilx0jd2",
    "author": "Karibil_Watar",
    "score": 1,
    "createdUtc": 1661545948,
    "body": "I'm making a stupid parody game that I'm planning to have devolve into a horror scenario with humor elements, before circling the entire thing around to be a jab at a certain politician in another country with whom I have no beef. Anyway, via the game [Space Funeral](https://thecatamites.itch.io/space-funeral), which is a free and excellent two to three hour experience that feels like you're traversing a slightly humorous nightmare, I've become more interested in older experimental music as a means of communicating an atmosphere of horror so that I can bundle it up with my already growing pile of copyright infringement. This has led me down the rabbit hole of early synthesizer music, starting with [Delia Derbyshire](https://www.youtube.com/watch?v=XVsqxNy8kkg) with the BBC Radiophonic Workshop. Most recently, I've been delving into Japanese Synthesizer stuff, which is frequently very pretty...\n\n[https://www.youtube.com/watch?v=hRZch8wSeII](https://www.youtube.com/watch?v=hRZch8wSeII)\n\n[https://www.youtube.com/watch?v=lj9CARDiBj8](https://www.youtube.com/watch?v=lj9CARDiBj8)\n\n[https://www.youtube.com/watch?v=fIqrqqKt12Q](https://www.youtube.com/watch?v=fIqrqqKt12Q)\n\nAnd then, there's 70s-80s French experimental music, which is good at stoking a sense of terror and sometimes downright miserable to listen to (as also is Derbyshire)\n\n[https://www.youtube.com/watch?v=pQL8GHzkcwM](https://www.youtube.com/watch?v=pQL8GHzkcwM)\n\n[https://www.youtube.com/watch?v=NHudu1Am6oQ](https://www.youtube.com/watch?v=NHudu1Am6oQ)\n\n[https://www.youtube.com/watch?v=ay2yxt08Ed0](https://www.youtube.com/watch?v=ay2yxt08Ed0)\n\nNot all the music I've posted is good. A lot of it is discordant. But Space Funeral is pretty fun and if you know any other cool early synthesizer stuff that's good at creating an ambience, please shoot it over. Anyways, I am complete newb to this stuff and am not sure of how much interest it would be to anyone else. At very least, it you need to terrorize trick or treaters or your significant other during Halloween, some of these tracks will do a good job.",
    "permalink": "/r/TheMotte/comments/wy0c32/friday_fun_thread_for_august_26_2022/ilx0jd2/"
  },
  {
    "kind": "t1",
    "id": "ilvmmbv",
    "author": "WhiningCoil",
    "score": 1,
    "createdUtc": 1661526301,
    "body": "So I'm still greatly enjoying Xenoblade Chronicles 3, but I had to take a week off to travel.\n\nThe job system hasn't really opened up as much as I'd hoped.  I'm like, 40 hours into the game, and all my jobs are still capped at level 10.  I can clearly see they go up to level 20, I just have no idea when/how I uncap them.  Will it be story related, or a sidequest?  I guess I'll find out.  But that obnoxious cap turns the job system from something fun, to a chore where I'm constantly rejiggering my party's jobs because someone hit their cap, and I don't want XP to goto waste.  I can't fucking wait for the cap to go away.\n\nThe story is **very** Xenoblade.  If you've played one, you know what I mean.\n\nThe geography and world design at first seemed very bog standard.  It's gotten much more creative and alien as I've gone along.  It's funny though, because Xenoblade 1 and 2 both started off with monologs about \"This game takes place on the back of a giant titan(s)\".  Xenoblade 3 just throws you in, with no explanation about the construction or orientation of the world.  I think it's still taking place on a titan?  Maybe the corpses of the titans from the first two games?  I don't know.  It'll be interesting if they just never fucking tell you, but I think I'd like at least a few more hints.",
    "permalink": "/r/TheMotte/comments/wy0c32/friday_fun_thread_for_august_26_2022/ilvmmbv/"
  },
  {
    "kind": "t1",
    "id": "ilvknaj",
    "author": "DevonAndChris",
    "score": 1,
    "createdUtc": 1661525518,
    "body": "They did it.\n\nThey made the internet worse: https://i.imgur.com/TysX2LI.png\n\n&gt;!The arrow was fucking *bouncing* in the original.!&lt;",
    "permalink": "/r/TheMotte/comments/wy0c32/friday_fun_thread_for_august_26_2022/ilvknaj/"
  },
  {
    "kind": "t1",
    "id": "iluqofd",
    "author": "FiveHourMarathon",
    "score": 1,
    "createdUtc": 1661511002,
    "body": "Is there such a thing as a family with higher/lower genetic variance?\n\nI was at a funeral, big Irish family, and all the men in the family seemed to be at extremes. Either 6'3\" or taller and muscular, owned businesses or served in the marines; or on disability with some variety of genetic defect that prevented them from ever holding a job. It was a striking pattern, I meet one son who has had nine heart surgeries, the other son is on a scholarship and looks like the guy she tells you not to worry about. One daughter has muscular dystrophy, her sister is a judge.\n\nI'm thinking of other examples in my life. Twins on my little league team, one batted third and one batted ninth. Law school classmates in the top-5 of our class, who had siblings in nursing homes.\n\nIs there any logic to this or am I just seeing random statistical noise? Any studies or theories?",
    "permalink": "/r/TheMotte/comments/wy0c32/friday_fun_thread_for_august_26_2022/iluqofd/"
  },
  {
    "kind": "t1",
    "id": "ilu3sxx",
    "author": "LeftNebula1226",
    "score": 1,
    "createdUtc": 1661492955,
    "body": "Why does conciousness matter anyway? It seems terribly inefficient for something that we have so much trouble understanding, without any real benefits. Couldn't we reason and all that good stuff without this crummy \"what is it like to be a human?\" nonsense attached to it?",
    "permalink": "/r/TheMotte/comments/wy0c32/friday_fun_thread_for_august_26_2022/ilu3sxx/"
  }
]
