[
  {
    "kind": "t1",
    "id": "igu27zk",
    "author": "Fruckbucklington",
    "score": 1,
    "createdUtc": 1658266766,
    "body": "So who has watched the first episode of Nathan Fielder's new HBO show The Rehearsal? If you haven't, go watch it. Don't read up on it, don't even watch a trailer, go in blind and watch it. If you are prone to overthinking things - aka a motter - I can almost guarantee you will like it. It is amazing. Like all my favourite things, it is both really smart and beyond idiotic. I want to try to keep this spoiler free so I will be a little circumspect - do you think he confessed at the end? Would you?",
    "permalink": "/r/TheMotte/comments/vzgha1/friday_fun_thread_for_july_15_2022/igu27zk/"
  },
  {
    "kind": "t1",
    "id": "ighen4v",
    "author": "CD-ROM_INSTRUCTOR",
    "score": 15,
    "createdUtc": 1658033404,
    "body": "Ahmad ibn Fadlan [recounts the funeral rites of the Varangians](https://ethicsofsuicide.lib.utah.edu/selections/ibn-fadlan/):\n\n&gt; I had been told that when their chieftains died cremation was the least [sic?] part of their whole funeral procedure, and I was, therefore, very much interested to find out more about this.  One day I heard that one of their leaders had died.  They laid him forthwith in a grave which they covered up for ten days till they had finished cutting-out and sewing his costume.  If the dead man is poor they make a little ship, put him in it, and burn it.  If he is wealthy, however, they divide his property and goods into three parts: one for his family, one to pay for his costume, and one to make nabid [probably a Scandinavian type of beer] which they drink on the day when the slave woman of the dead man is killed and burnt together with her master.  They are deeply addicted to nabid, drinking it night and day; and often one of them has been found dead with a beaker in his hand.  When a chieftain among them has died, his family demands of his slave women and servants: ‘Which of you wishes to die with him?’  Then one of them says: ‘I do’; and having said that the person concerned is forced to do so, and no backing out is possible.  Even if he wished to he would not be allowed to.  Those who are willing are mostly the slave women.\n&gt; \n&gt; So when this man died they said to his slave women: ‘Which of you wants to die with him?’  One of them answered, ‘I do.’ From that moment she was put in the constant care of two other women servants who took care of her to the extent of washing her feet with their own hands.  They began to get things ready for the dead man, to cut his costume and so on, while every day the doomed woman drank and sang as though in anticipation of a joyous event.\n&gt; \n&gt; When the day arrived on which the chieftain and his slave woman were going to be burnt, I went to the river where his ship was moored.  It had been hauled ashore and four posts were made for it of birch and other wood.  Further there was arranged around it what looked like a big store of wood.  Then the ship was hauled near and placed on the wood.  People now began to walk about talking in a language I could not understand, and the corpse still lay in the grave; they had not taken it out.  They then produced a wooden bench, placed it on the ship, and covered it with carpets of Byzantine dibag [painted silk] and with cushions of Byzantine dibag.  Then came an old woman whom they call ‘the Angel of Death’, and she spread these cushions out over the bench.  She was in charge of the whole affair from dressing the corpse to the killing of the slave woman.  I noticed that she was an old giant-woman, a massive and grim figure.  When they came to his grave they removed the earth from the wooden frame and they also took the frame away.  They then divested the corpse of the clothes in which he had died.  The body, I noticed, had turned black because of the intense frost.  When they first put him in the grave, they had also given him beer, fruit, and a lute, all of which they now removed.  Strangely enough the corpse did not smell, nor had anything about him changed save the colour of his flesh.  They now proceeded to dress him in hose, and trousers, boots, coat, and a mantle of dibag adorned with gold buttons; put on his head a cap of dibag and sable fur; and carried him to the tent on the ship, where they put him on the blanket and supported him with cushions.  They then produced nabid, fruit, and aromatic plants, and put these round his body; and they also brought bread, meat, and onions which they flung before him.  Next they took a dog, cut it in half, and flung the pieces into the ship, and after this they took all his weapons and placed them beside him.  Next they brought two horses and ran them about until they were in a sweat, after which they cut them to pieces with swords and flung their meat in to the ship; this also happened to two cows.  Then they produced a cock and a hen, killed them, and threw them in.  Meanwhile the slave woman who wished to be killed walked up and down, going into one tent after the other, and the owner of each tent had sexual intercourse with her, saying: ‘Tell you master I did this out of love for him.’\n&gt; \n&gt; It was now Friday afternoon and they took the slave woman away to something which they had made resembling a doorframe. Then she placed her legs on the palms of the men and reached high enough to look over the frame, and she said something in a foreign language, after which they took her down.  And they lifted her again and she did the same as the first time.  Then they took her down and lifted her a third time and she did the same as the first and the second times.  Then they gave her a chicken and she cut its head off and threw it away; they took the hen and threw it into the ship.  Then I asked the interpreter what she had done.  He answered: ‘The first time they lifted her she said: “Look!  I see my father and mother.”  The second time she said: “Look!  I see all my dead relatives sitting round.”  The third time she said: “Look!  I see my master inParadise, andParadiseis beautiful and green and together with him are men and young boys.  He calls me.  Let me join him then!”’\n&gt; \n&gt; They now led her towards the ship.  Then she took off two bracelets she was wearing and gave them to the old woman, ‘the Angel of Death’, the one who was going to kill her.  She next took off two anklets she was wearing and gave them to the daughters of that woman known by the name ‘the Angel of Death’.  They then led her to the ship but did not allow her inside the tent.  Then a number of men carrying wooden shields and sticks arrived, and gave her a beaker with nabid.  She sang over it and emptied it.  The interpreter then said to me, ‘Now with that she is bidding farewell to all her women friends.’  Then she was given another beaker.  She took it and sang a lengthy song; but the old woman told her to hurry and drink up and enter the tent where her master was.  When I looked at her she seemed completely bewildered.  She wanted to enter the tent and she put her head between it and the ship.  There the woman took her head and managed to get it inside the tent, and the woman herself followed.  Then the men began to beat the shields with the wooden sticks, to deaden her shouts so that the other girls would not become afraid and shrink from dying with their masters.  Six men entered the tent and all of them had intercourse with her.  Therefore they laid her by the side of her dead master.  Two held her hands and two her feet, and the woman called ‘the Angel of Death’ put a cord round the girl’s neck, doubled with an end at each side, and gave it to two men to pull.  Then she advanced holding a small dagger with a broad blade and began to plunge it between the girl’s ribs to and from while the two men choked her with the cord till she died.\n&gt; \n&gt; The dead man’s nearest kinsman now appeared.  He took a piece of wood and ignited it.  Then he walked backwards, his back towards the ship and his face towards the crowd, holding the piece of wood in one hand and the other hand on his buttock; and he was naked.  In this way the wood was ignited which they had place under the ship after they had laid the slave woman, whom they had killed, beside her master.  Then people came with branches and wood; each brought a burning brand and threw it on the pyre, so that the fire took hold of the wood, then the ship, then the tent and the man and slave woman and all.  Thereafter a strong and terrible wind rose so that the flame stirred and the fire blazed still more.\n&gt; \n&gt; I heard one of the Rus folk, standing by, say something to my interpreter, and when I inquired what he had said, my interpreter answered: ‘He said: “You Arabs are foolish.”’  ‘Why?’  I asked.  ‘Well, because you throw those you love and honour to the ground where the earth and the maggots and fields devour them, whereas we, on the other hand, burn them up quickly and they go toParadisethat very moment.’  The man burst out laughing, and on being asked why, he said: ‘His Lord, out of love for him, has sent this wind to take him away within the hour!’  And so it proved, for within that time the ship and the pyre, the girl and the corpse had all become ashes and then dust.  On the spot where the ship stood after having been hauled ashore, they built something like a round mound.  In the middle of it they raised a large post of birch-wood on which they wrote the names of the dead man and of the king of the Rus, and then the crowd dispersed.",
    "permalink": "/r/TheMotte/comments/vzgha1/friday_fun_thread_for_july_15_2022/ighen4v/"
  },
  {
    "kind": "t1",
    "id": "igg1gya",
    "author": "[deleted]",
    "score": 2,
    "createdUtc": 1658008142,
    "body": "Got an old network attached storage device, HDD-based, that I'd like to securely erase. There doesn't seem to be any low-level way to access it and DBAN it. Do you think just writing a script to fill it to the brim with txt files a few times over would do the trick? Seems like it should but curious about opinions here.",
    "permalink": "/r/TheMotte/comments/vzgha1/friday_fun_thread_for_july_15_2022/igg1gya/"
  },
  {
    "kind": "t1",
    "id": "igb5i4r",
    "author": "EdenicFaithful",
    "score": 6,
    "createdUtc": 1657916862,
    "body": "Anyone know any fun academic terms or concepts?\n\nEmic and etic are used for the \"inside view\" and \"outside view\" of a group respectively.\n\nThe gnomic aspect is the tense of aphorism.\n\nE' (E-Prime) ~~is~~ means English without using the verb \"to be.\"",
    "permalink": "/r/TheMotte/comments/vzgha1/friday_fun_thread_for_july_15_2022/igb5i4r/"
  },
  {
    "kind": "t1",
    "id": "igac6mg",
    "author": "Atersed",
    "score": 11,
    "createdUtc": 1657905107,
    "body": "\"There are reports that the Defense Advanced Research Projects Agency (DARPA) at one point banned the game from the ARPANET due to its popularity.\"\n\nhttps://en.wikipedia.org/wiki/Maze_(1973_video_game)",
    "permalink": "/r/TheMotte/comments/vzgha1/friday_fun_thread_for_july_15_2022/igac6mg/"
  },
  {
    "kind": "t1",
    "id": "ig9dgwd",
    "author": "Difficult_Ad_3879",
    "score": 14,
    "createdUtc": 1657890872,
    "body": "Adding to the theme of FFT gaming posts. There’s been talk online about [how video games aren’t as fun as they used to be](https://youtu.be/j4QKSCushmo). The ascribed reasons vary, from differences in design to superstimuli alternatives like Tik Tok. But there’s an important element that has been missed: the fun of video games is in some sense *charged* from the boredom of everyday life. The more boredom you have habituated to in daily life, the more fun video games will be.\n\nWhen childhood life around the 00’s and before consisted of boring schoolwork and activities, and you did not have the ability to find anything on YouTube and message your friends 24/7, the fun factor of video games stands out. This fun factor is relative to your default living condition. When you’re at school, simply getting free time to eat lunch and stand outside for recess is fun, or watching a boring documentary on a crappy TV. But over summer vacation this fun factor no longer stands out. Fun is relative to what we are accustomed to. And so back when life was more boring, the fun of a Halo or other game is stronger and more memorable. \n\nYou might remember seeing your first “modern” television, and how captivating the image was. Maybe you remember when YouTube switched from 720p to 1080p. Maybe you remember recording a show on TiVo and being able to skip through commercials (!). The pleasantness and novelty of this is also relative. \n\nThe importance of understanding this dynamic is that it proves to us a certain vanity of pleasure. A fun video game is fun, but it makes real life less intrinsically fun. A colorful dramatic television drama is engaging, but it makes our real life relationships less engaging. “Fun” is our mind being lit up by easy pleasure. Going from boring middle school life to GTA San Andreas is overwhelmingly fun. Going from modern GTA to San Andreas is no fun at all. Waking up on Christmas and playing Oblivion is fun; going from modded Skyrim to Oblivion is less fun. And don’t get me started on Chess. \n\nThis fun differential is most evident in open world games, because the fun of the open world game is charged from real life participation; but open world games sap our pleasure from real life participation, to some degree.\n\nThis explanation is the least fun answer to the question of why video games are no longer fun. Because like a Renaissance vanitas painting it shows us clearly the vanity of games. Sum total fun was not increased in your life from your game playing, it was just transferred from real life to an artificial consumer product.",
    "permalink": "/r/TheMotte/comments/vzgha1/friday_fun_thread_for_july_15_2022/ig9dgwd/"
  },
  {
    "kind": "t1",
    "id": "ig9bzx0",
    "author": "NondualGenie",
    "score": 24,
    "createdUtc": 1657890167,
    "body": "What are your favorite examples of famous quotes whose meaning changes a lot in context? Two I learned this week (coincidentally both about religion) are:\n\nMarx’s “religion is the opium of the masses” is actually  \"Religion is the sigh of the oppressed creature, the heart of a heartless world, and the soul of soulless conditions. It is the opium of the people.\" Also opium was much more widely accepted in Europe at the time.\n\nJohn Adam’s quote about how “the US is in no way a Christian nation” was from a treaty signed with Muslim Tripoli and guaranteed by the Ottomans. The full quote is: “the Government of the United States of America is not, in any sense, founded on the Christian religion,—as it has in itself no character of enmity against the laws, religion, or tranquility, of Mussulmen [Muslims],—and as the said States never entered into any war or act of hostility against any Mahometan [Mohammedan] nation, it is declared by the parties that no pretext arising from religious opinions shall ever produce an interruption of the harmony existing between the two countries.” Adams himself was a deeply religious, church-going Unitarian.",
    "permalink": "/r/TheMotte/comments/vzgha1/friday_fun_thread_for_july_15_2022/ig9bzx0/"
  },
  {
    "kind": "t1",
    "id": "ig9bwz9",
    "author": "orthoxerox",
    "score": 5,
    "createdUtc": 1657890128,
    "body": "Polo shirts: tucked or untucked?",
    "permalink": "/r/TheMotte/comments/vzgha1/friday_fun_thread_for_july_15_2022/ig9bwz9/"
  },
  {
    "kind": "t1",
    "id": "ig956er",
    "author": "bl1y",
    "score": 4,
    "createdUtc": 1657886617,
    "body": "Been spending a bunch of time working on a homebrew D&amp;D campaign. [Got roughly half of it planned out now.](https://imgur.com/O1CjK2x) Got two groups that'll be starting in a couple weeks. Sort of exciting, sort of panic inducing.",
    "permalink": "/r/TheMotte/comments/vzgha1/friday_fun_thread_for_july_15_2022/ig956er/"
  },
  {
    "kind": "t1",
    "id": "ig8o333",
    "author": "wunr",
    "score": 16,
    "createdUtc": 1657874196,
    "body": "Though I'm a big proponent of video game modding, there's a part of me that misses the era of video games where data mining and leaks weren't so prevalent and people actually had to search for secrets. Playground rumors of Sonic in Smash Bros Melee, creepypastas centered around unsettling things in otherwise cheery and colorful games, the multi-year community effort to search for [a last big secret in Shadow of the Colossus.](https://youtu.be/jQNeYbBiCKw) There's a certain magic to it all that I can't quite put into words, and I don't think younger generations of gamers will be able to experience that kind of thing firsthand. There's been an endless amount of examples in recent years where a game developer attempts to hide interesting secrets behind tough puzzles in their game only to have all the secrets datamined within hours of release.",
    "permalink": "/r/TheMotte/comments/vzgha1/friday_fun_thread_for_july_15_2022/ig8o333/"
  }
]
