[
  {
    "kind": "t1",
    "id": "ihhgg4l",
    "author": "EdenicFaithful",
    "score": 1,
    "createdUtc": 1658690884,
    "body": "So, what are you reading?\n\nI'm picking up Dreyfus' *Underground*, which is about black hat hackers in the 90s. It seems that it was researched by none other than Julian Assange himself, who was one of the handle-owning hackers featured.",
    "permalink": "/r/TheMotte/comments/w6otlm/smallscale_question_sunday_for_july_24_2022/ihhgg4l/"
  },
  {
    "kind": "t1",
    "id": "ihgvakg",
    "author": "Jeccems",
    "score": 1,
    "createdUtc": 1658681983,
    "body": "I'm under the impression that small culture war laden questions are permissible - I'm mostly just looking for a reference.  Apologies if I'm mistaken.  \n\nLynching.  I'm trying to understand the extent and severity.  Is there a good resource for understanding the historical phenomenon as it occurred in the United States?  Hopefully with some high level of detail and specificity?  I am of the impression that it's incredibly inflated in the minds of modern individuals - occurring a few thousand times over the course of a century, to people of various ethnicities.  Most specifically, I am interested in the reasonableness (for lack of a better word) of the actions.  Extrajudicial violence is, in and of itself, somewhat unreasonable a priori, but how many victims were random citizens taken off the street, and how many were communally killed before the legal system would have (likely) found them guilty of the alleged crimes?  Is there any accounting of this?  Is looking for as much frivolous?",
    "permalink": "/r/TheMotte/comments/w6otlm/smallscale_question_sunday_for_july_24_2022/ihgvakg/"
  },
  {
    "kind": "t1",
    "id": "ihgexto",
    "author": "DuplexFields",
    "score": 1,
    "createdUtc": 1658675083,
    "body": "iTunes broke my Windows 10 laptop.\n\nBefore installing iTunes on my HP laptop with Core i5 7th Gen Intel, I could watch fullscreen video without judder, I could have dozens of tabs open simultaneously, I could play video games.\n\nThen I installed iTunes for a work project. Fullscreen video runs at one frame per second, and embedded videos almost as slowly. Even two tabs on Firefox makes it nearly impossible to move my mouse cursor, which moves, freezes, and then reappears halfway across screen.\n\nNow, even after uninstalling iTunes (and its associated tools) and a day later reinstalling my Intel onboard graphics driver, the problems remain. Since I can't afford a new computer, I'm stuck with this one for now, and I'll need to use it next weekend to run an RPG, so the clock is ticking. Any suggestions?",
    "permalink": "/r/TheMotte/comments/w6otlm/smallscale_question_sunday_for_july_24_2022/ihgexto/"
  },
  {
    "kind": "t1",
    "id": "ihgdg5n",
    "author": "MacaqueOfTheNorth",
    "score": 1,
    "createdUtc": 1658674444,
    "body": "Where can I find stats on how many IVF babies have been born each year going back to the 70s?",
    "permalink": "/r/TheMotte/comments/w6otlm/smallscale_question_sunday_for_july_24_2022/ihgdg5n/"
  },
  {
    "kind": "t1",
    "id": "ihg1ec7",
    "author": "Difficult_Ad_3879",
    "score": 1,
    "createdUtc": 1658668958,
    "body": "Are there any major image/media search/collection websites that are not Pinterest/Tumblr?",
    "permalink": "/r/TheMotte/comments/w6otlm/smallscale_question_sunday_for_july_24_2022/ihg1ec7/"
  },
  {
    "kind": "t1",
    "id": "ihg15n2",
    "author": "Difficult_Ad_3879",
    "score": 1,
    "createdUtc": 1658668832,
    "body": "Is there any value to thirst-fasting, eg going x hours of your day without hydration? It would seem to fall in line with other kinds of “fasting” that have health benefits (caloric fasting, sleep restriction to increase sleep efficiency). The closest I could find is a study where *not* hydrating *within* an exercise session (but a little after) led to increased cardiovascular gains. My intuition is that there is probably some health benefit to ~8 hours of the day refraining from hydration, followed by over-hydration.",
    "permalink": "/r/TheMotte/comments/w6otlm/smallscale_question_sunday_for_july_24_2022/ihg15n2/"
  },
  {
    "kind": "t1",
    "id": "ihfxd76",
    "author": "orthoxerox",
    "score": 1,
    "createdUtc": 1658666742,
    "body": "What's the most right-wing quote from a work of fiction you can think of?\n\nMine is from *No Country for Old Men*:\n\n&gt; \"Dope. They sell that shit to schoolkids.\"\n&gt; \n&gt; \"It's worse than that.\"\n&gt; \n&gt; \"How's that?\"\n&gt; \n&gt; \"Schoolkids buy it.\"",
    "permalink": "/r/TheMotte/comments/w6otlm/smallscale_question_sunday_for_july_24_2022/ihfxd76/"
  },
  {
    "kind": "t1",
    "id": "ihfgrug",
    "author": "cat-astropher",
    "score": 1,
    "createdUtc": 1658654613,
    "body": "Freddie deBoer's \"More Commenting Sadness\" post:\n&gt; \"Comments are off again until I decide otherwise. You know why. I have had enough.\"\n\nI wasn't paying attention and don't know why.\n\nI don't and shouldn't even need to know, but now I want to.",
    "permalink": "/r/TheMotte/comments/w6otlm/smallscale_question_sunday_for_july_24_2022/ihfgrug/"
  },
  {
    "kind": "t1",
    "id": "ihfbi4i",
    "author": "DandyPandemonium",
    "score": 1,
    "createdUtc": 1658650280,
    "body": "Tips or resources by which I can improve my English speaking? To be more specific, to speak more coherently.",
    "permalink": "/r/TheMotte/comments/w6otlm/smallscale_question_sunday_for_july_24_2022/ihfbi4i/"
  }
]
