[
  {
    "kind": "t1",
    "id": "im6axzq",
    "author": "TaiaoToitu",
    "score": 1,
    "createdUtc": 1661720217,
    "body": "Catching up on a range of things at the moment, so apologies for being so late to the party on this one: Regarding the discussion around ['What we owe the future'](https://astralcodexten.substack.com/p/book-review-what-we-owe-the-future), was there any discussion of discounting future humans I'm the same way we discount future cash flows (though obviously at a different rate)?\n\nThe argument about the glass shard strikes me as very odd. Of course it makes a difference if the child comes 5 days hence or a millennia. Within a few years we can probably expect the shard to be buried and rendered harmless. Within a century we can assign a reasonably high probability that the forest track has changed route due to natural subsidences etc. Within a millennia, who knows if any humans will be around at all? So valuing a clear and present threat equally with some theoretical future one seems utterly absurd to me.\n\nJust as the impact of any action we might take is affected by compounding uncertainties, human life is also. Is it not clear that the life of somebody actually alive today is worth more than somebody who's parents are yet to be born? As one looks further forward, there is less certainty that the hypothetical people your action seeks to aid actually exist! Or even if they do, maybe they are genocidal maniacs that killed your descendants, or otherwise so alien in their values that you wouldn't Uncertainty in both regards compounds over time.\n\nPeople obviously care deeply about their grand kids, and thinking of the US Revolution for example, have been willing to make great sacrifices to secure a future for many generations of strangers to come. The discount rate need not be extreme, and probably properly even varies depending on the circumstance (discounting one's own descendants less steeply than those of your extended family/community/nation/culture/species for example). Of course, one need not do this formally or numerically at all, but if you're going to build a numerical case for a particular idea, then it seems disingenuous not to at least consider including it as a term.\n\nThis sort of thinking is intuitive to me, and I think lines up well as a formalisation of actual human values and behaviour, but I'm curious that I'm not seeing anything like this discussed in the likes of Scott's OP or follow up 'highlights' post for example. Perhaps I'm off base?",
    "permalink": "/r/TheMotte/comments/wzobg4/smallscale_question_sunday_for_august_28_2022/im6axzq/"
  },
  {
    "kind": "t1",
    "id": "im5ub2m",
    "author": "EdenicFaithful",
    "score": 1,
    "createdUtc": 1661713275,
    "body": "So, what are you reading?\n\nI'm picking up Pinker's *Rationality*. I attempted a while back to get through his Harvard lectures, but couldn't maintain interest. Perhaps I'll do better in text. Seems to have a fair amount of overlap with LessWrong-style thinking. I confess that I read these kinds of texts more like a medieval logic treatise that needs interpretation to get some use out of in one's life, than actually trying to learn how to think. Still, perhaps I'll learn something.",
    "permalink": "/r/TheMotte/comments/wzobg4/smallscale_question_sunday_for_august_28_2022/im5ub2m/"
  },
  {
    "kind": "t1",
    "id": "im4v7tx",
    "author": "RGbudvit",
    "score": 1,
    "createdUtc": 1661698917,
    "body": "Does anyone know of a good politically minded critique of the double entry accounting system?\n\nIt's a little odd to me that one of the main mechanisms of business and one of the key ways states control industry seems to have so little focus.\n\nEdit - there doesn't seem to be such a critique and I am not doing the best job of explaining my issue. Thanks folks I'll come back to this later if I can martial my thoughts more coherently.",
    "permalink": "/r/TheMotte/comments/wzobg4/smallscale_question_sunday_for_august_28_2022/im4v7tx/"
  },
  {
    "kind": "t1",
    "id": "im4fqz4",
    "author": "ItsAPomeloParty",
    "score": 1,
    "createdUtc": 1661691673,
    "body": "Has the Catholic Church ever admitted fault as an institution, or admitted as an institution having been wrong about something?",
    "permalink": "/r/TheMotte/comments/wzobg4/smallscale_question_sunday_for_august_28_2022/im4fqz4/"
  },
  {
    "kind": "t1",
    "id": "im3q30m",
    "author": "D1m1tr1Rascalov",
    "score": 1,
    "createdUtc": 1661672262,
    "body": "So, what's up with [excess mortality across Europe](https://www.euromomo.eu/graphs-and-maps#excess-mortality)? This dataset received an update last week and has since created a lot of buzz in the vaccine-skeptic/anti-vaxx circles on reddit, Substack and Twitter, while receiving comparatively little airtime on more mainstream publications in relation to the (perceived) importance of the phenomenon. The basic finding is that elevated mortality has continued into 2022 and is currently on track to surpass both 2020 and 2021. This is particularly surprising given that we'd expect a decrease in mortality now that a whole lot of vulnerable people have died already. Also note the sharp increase of mortality for people below the age of 44 and especially below the age of 14.\n\nSo far, the possible explanations I've seen are:\n\n* it's the heat wave,\n* it's COVID itself or its long-term effects,\n* it's the consequences from lockdowns, including staff shortages, treatment delays, economical and mental health fallout etc.\n* and, most controversially of course, it's the vaccines\n\nNone of these seem particularly convincing to me. Why would e.g. heat waves and treatment delays be causing unusual levels of excess mortality for people below the age of 18? If it were the vaccines or lockdowns, the timing seems off. Europe is back open, mass vaccination happened last year at roughly the same scale and time in every European country, so why is Portugal's mortality going trough the roof right now while Denmark is mostly staying where it's at? COVID-infections might be contributing, but confirmed deaths are way down in basically every country and it's also not a known killer of young people. That widespread infections sort of shifted the general population health Bell Curve towards worse outcomes seems plausible, but studies on the side effects that don't look at vulnerable or severely ill subpopulations tend to come up with pretty unconvincing results IMO and again it wouldn't make sense for this to affect specifically young people.\n\nDoes anyone have a good idea for what's going on right now? Is it a combination of some of the mentioned possibilities? Or something else entirely? Or is it overblown, we should just wait a few months/a year or two and mortality will normalize?",
    "permalink": "/r/TheMotte/comments/wzobg4/smallscale_question_sunday_for_august_28_2022/im3q30m/"
  }
]
