[
  {
    "kind": "t1",
    "id": "imvpnz4",
    "author": "Navalgazer420XX",
    "score": 1,
    "createdUtc": 1662173062,
    "body": "**Probation of European Criminals**\n\nAfter playing a game that made fun of him, I read that Josef Fritzl, [World's Least Popular Austrian (silver medalist)](https://en.wikipedia.org/wiki/Fritzl_case) might be eligible for probation next year, after 15 years in prison for the whole multi-generation incest rape dungeon business.  \nIt made me curious: what's the media environment in european countries like when this happens? Does the press pay any attention to it at all? Do people ever talk seriously about maybe bus-full-of-nuns-murderers needing to spend more time in prison?  \nIn the UK it's usually only the Daily Mail that notices/comes out with headlines about bringing back hanging, while the US sometimes manages some hand-wringing from the serious people papers if the stars and skin colours align (which is fairly rare due to the 7 million year sentences in such cases). Is it basically the same in Europe?",
    "permalink": "/r/TheMotte/comments/wzobg4/smallscale_question_sunday_for_august_28_2022/imvpnz4/"
  },
  {
    "kind": "t1",
    "id": "imgeml1",
    "author": "DrManhattan16",
    "score": 3,
    "createdUtc": 1661903009,
    "body": "Reposting my question from the last thread to see if it just needed more visibility.\n\nSo, I've got a burning question about the whole \"Money corrupts politics?\" debate. It seems like whenever someone says it does, the response is to point to studies looking at whether it can change who the person in power. These studies point to the answer being no.\n\nMy question, then, is whether anyone has looked at this from the perspective of a politician?\n\n1. Politicians want to have more votes and more money to run their campaigns. Having someone drop out of supporting you is something they should be sensitive to. Politicians may weigh their incentives and goals if two or more contradict, but I don't think any politician declares a level of support beyond which they will not allow any donations/support to change their policy goals.\n\n2. Politicians may believe that campaign spending does affect the outcome of an election, so they act as if it does and strive to not lose large donators.\n\nNow, these are just hypothesis, so I'm looking to see if there are any studies testing them for validity.",
    "permalink": "/r/TheMotte/comments/wzobg4/smallscale_question_sunday_for_august_28_2022/imgeml1/"
  },
  {
    "kind": "t1",
    "id": "ime67pd",
    "author": "Primaprimaprima",
    "score": 4,
    "createdUtc": 1661871245,
    "body": "What problems do you think are AGI-complete?",
    "permalink": "/r/TheMotte/comments/wzobg4/smallscale_question_sunday_for_august_28_2022/ime67pd/"
  },
  {
    "kind": "t1",
    "id": "imdah89",
    "author": "zfinder",
    "score": 8,
    "createdUtc": 1661854960,
    "body": "Does anyone have a good theory about why antivaxxers are anti**vaxxers**, specifically?\n\n\nPeople are ready to build statistical models, recheck scientific PDFs, run monothematic blogs with long texts filled with apocalyptic vocabulary, quarrel with friends. I don't see similar emotions regarding other medicines, including rather dubious ones, other medical manipulations, salt iodization, antibiotics in animal husbandry, contaminants in water (impurifying our precious bodily fluids) and in the atmosphere, inefficiencies in the healthcare system, unnecessary wars, all sorts of other aspects of corruption.\n\n\nIs this a random feature of my information bubble, or is there really something visceral in vaccinations that affects some depths of consciousness?",
    "permalink": "/r/TheMotte/comments/wzobg4/smallscale_question_sunday_for_august_28_2022/imdah89/"
  },
  {
    "kind": "t1",
    "id": "imbozoj",
    "author": "QuinoaHawkDude",
    "score": 14,
    "createdUtc": 1661818710,
    "body": "I'm not sure this question is small-scale...well, the question is, since I'm not willing to put a lot of effort into asking the question.  The scale of the answer(s) might be pretty expansive.\n\nWhy does the Left hate Ronald Reagan so damn much?\n\nOr, more specifically, what did Reagan do, exactly, to earn so much opprobrium from progressives?\n\nI see it all the time online, people who are on the left/progressive side of politics casually dropping a \"Reagan started the destruction of the American middle class\" into a conversation with no explanation or context.\n\nI was was born in the late 70's so I don't have any memory of what times were like before the Reagan Era.  I'd ask my parents, but their perspectives are probably skewed by the fact that they were only just growing up and starting their adult lives before 1980, plus they came from pretty poor backgrounds and bootstrapped their way into the upper-middle-class by way of being smart (smart enough to work in computer programming in my dad's case, and smart enough to marry a computer programmer and get the hell away from her white trash family in my mom's case).  My grandparents are dead so I can't ask them.\n\nThat caveat aside, an admittedly naive reading of American history from the end of WW2 through today seems like: 1950s, we're doing great, mostly because we're the only major power that didn't get bombed to smithereens during the war; 1960s still okay but slowing down, Vietnam is a real drag and blow to our egos; 1970's things start looking genuinely crappy, the oil crisis, inflation, urban decay, crime waves, etc.  Lots of people around the world genuinely thinking that the USSR might be the better place to live.  Then Reagan comes along in the 1980s and America gets its groove back, and within ten years the Berlin wall is falling and the Soviet Union is collapsing and living standards are getting way better.\n\nI'm not naive enough to think that everything good that happened between 1980 and 1988 was because of Reagan, but this general story is more or less accepted among cultural conservatives of what I guess I'll call the \"Tom Clancy set\".\n\nThe main knocks on Reagan (in terms of actual economic policy, ignoring things like D.A.R.E and his handling of the AIDS crisis and the Iran-Contra affair) I'm vaguely aware of are:  \n\n\n1. Tax cuts on the top margin, the so-called \"trickle-down economics\".\n2. Certain anti-union actions, e.g. the air traffic controllers\n\nThat's it.  So, the economic left's sacred cows are high taxes on the rich and unions?  I guess it wasn't that hard to answer my own question.  But is there more to it than that?  How has this \"destroyed the American middle class\"?  My mom's aforementioned relatives are all solidly middle class (none of them went to college and they work retail or manual labor jobs) and they all, in 2022, live in decent houses with newish cars and wear name-brand clothing and get to go out to dinner multiple times a year.  They wouldn't have been doing that in the 1970s!  Not working the same kinds of jobs they do now.  What am I missing?",
    "permalink": "/r/TheMotte/comments/wzobg4/smallscale_question_sunday_for_august_28_2022/imbozoj/"
  },
  {
    "kind": "t1",
    "id": "imau220",
    "author": "greyenlightenment",
    "score": 4,
    "createdUtc": 1661804712,
    "body": "Why is it so hard to invent a good sugar substitute?\n\nAll the economic incentives are  in place, you got many companies that stand to make probably  hundreds of billions of dollars. Yet a century later, despite collective billions of R&amp;D and some of the smartest chemists,   nothing even comes close. We're talking imitating sugar, not trying to cure cancer. The policy implications of this are huge: helping to fix global obesity, for example. Yet why can't it be done?\n\nTrying to lose weight and this would be a godsend.",
    "permalink": "/r/TheMotte/comments/wzobg4/smallscale_question_sunday_for_august_28_2022/imau220/"
  },
  {
    "kind": "t1",
    "id": "imadzpj",
    "author": "MacaqueOfTheNorth",
    "score": 4,
    "createdUtc": 1661797971,
    "body": "Why do almost all videos on the internet have subtitles all of a sudden?",
    "permalink": "/r/TheMotte/comments/wzobg4/smallscale_question_sunday_for_august_28_2022/imadzpj/"
  },
  {
    "kind": "t1",
    "id": "im9jjgo",
    "author": "Im_not_JB",
    "score": 4,
    "createdUtc": 1661785864,
    "body": "Related to the moving topic in the Friday thread on moving, we're moving soon. Kicker: don't know what state we're going to yet. We're currently trying to juggle a couple job offers. How do people manage moving to a different state when you already have a significant amount of stuff? (Prior moves have either been small amounts of stuff or to a place where we already had a domicile.)\n\nI think the traditional thing is to go and scope out a place, get it arranged to rent or whatever, maybe live out of a hotel and work there some while your family stays back where you used to live, and so on. We're renting, and while we have some flexibility, we want to just leave this place pretty quickly. We're considering doing PODS, just packing up basically everything, having them store them in a facility somewhere, then live out of suitcases in an AirBNB in the new area for a few weeks or a month or whatever until we decide on and negotiate a new place to live.\n\nHas anyone done this? Even if not, any thoughts?",
    "permalink": "/r/TheMotte/comments/wzobg4/smallscale_question_sunday_for_august_28_2022/im9jjgo/"
  },
  {
    "kind": "t1",
    "id": "im7wnuv",
    "author": "TJ11240",
    "score": 4,
    "createdUtc": 1661748119,
    "body": "So what should I be cooking with? Ghee?",
    "permalink": "/r/TheMotte/comments/wzobg4/smallscale_question_sunday_for_august_28_2022/im7wnuv/"
  },
  {
    "kind": "t1",
    "id": "im6axzq",
    "author": "TaiaoToitu",
    "score": 6,
    "createdUtc": 1661720217,
    "body": "Catching up on a range of things at the moment, so apologies for being so late to the party on this one: Regarding the discussion around ['What we owe the future'](https://astralcodexten.substack.com/p/book-review-what-we-owe-the-future), was there any discussion of discounting future humans I'm the same way we discount future cash flows (though obviously at a different rate)?\n\nThe argument about the glass shard strikes me as very odd. Of course it makes a difference if the child comes 5 days hence or a millennia. Within a few years we can probably expect the shard to be buried and rendered harmless. Within a century we can assign a reasonably high probability that the forest track has changed route due to natural subsidences etc. Within a millennia, who knows if any humans will be around at all? So valuing a clear and present threat equally with some theoretical future one seems utterly absurd to me.\n\nJust as the impact of any action we might take is affected by compounding uncertainties, human life is also. Is it not clear that the life of somebody actually alive today is worth more than somebody who's parents are yet to be born? As one looks further forward, there is less certainty that the hypothetical people your action seeks to aid actually exist! Or even if they do, maybe they are genocidal maniacs that killed your descendants, or otherwise so alien in their values that you wouldn't Uncertainty in both regards compounds over time.\n\nPeople obviously care deeply about their grand kids, and thinking of the US Revolution for example, have been willing to make great sacrifices to secure a future for many generations of strangers to come. The discount rate need not be extreme, and probably properly even varies depending on the circumstance (discounting one's own descendants less steeply than those of your extended family/community/nation/culture/species for example). Of course, one need not do this formally or numerically at all, but if you're going to build a numerical case for a particular idea, then it seems disingenuous not to at least consider including it as a term.\n\nThis sort of thinking is intuitive to me, and I think lines up well as a formalisation of actual human values and behaviour, but I'm curious that I'm not seeing anything like this discussed in the likes of Scott's OP or follow up 'highlights' post for example. Perhaps I'm off base?",
    "permalink": "/r/TheMotte/comments/wzobg4/smallscale_question_sunday_for_august_28_2022/im6axzq/"
  },
  {
    "kind": "t1",
    "id": "im5ub2m",
    "author": "EdenicFaithful",
    "score": 12,
    "createdUtc": 1661713275,
    "body": "So, what are you reading?\n\nI'm picking up Pinker's *Rationality*. I attempted a while back to get through his Harvard lectures, but couldn't maintain interest. Perhaps I'll do better in text. Seems to have a fair amount of overlap with LessWrong-style thinking. I confess that I read these kinds of texts more like a medieval logic treatise that needs interpretation to get some use out of in one's life, than actually trying to learn how to think. Still, perhaps I'll learn something.",
    "permalink": "/r/TheMotte/comments/wzobg4/smallscale_question_sunday_for_august_28_2022/im5ub2m/"
  },
  {
    "kind": "t1",
    "id": "im4v7tx",
    "author": "RGbudvit",
    "score": 0,
    "createdUtc": 1661698917,
    "body": "Does anyone know of a good politically minded critique of the double entry accounting system?\n\nIt's a little odd to me that one of the main mechanisms of business and one of the key ways states control industry seems to have so little focus.\n\nEdit - there doesn't seem to be such a critique and I am not doing the best job of explaining my issue. Thanks folks I'll come back to this later if I can martial my thoughts more coherently.",
    "permalink": "/r/TheMotte/comments/wzobg4/smallscale_question_sunday_for_august_28_2022/im4v7tx/"
  },
  {
    "kind": "t1",
    "id": "im4fqz4",
    "author": "ItsAPomeloParty",
    "score": 1,
    "createdUtc": 1661691673,
    "body": "Has the Catholic Church ever admitted fault as an institution, or admitted as an institution having been wrong about something?",
    "permalink": "/r/TheMotte/comments/wzobg4/smallscale_question_sunday_for_august_28_2022/im4fqz4/"
  },
  {
    "kind": "t1",
    "id": "im3q30m",
    "author": "D1m1tr1Rascalov",
    "score": 15,
    "createdUtc": 1661672262,
    "body": "So, what's up with [excess mortality across Europe](https://www.euromomo.eu/graphs-and-maps#excess-mortality)? This dataset received an update last week and has since created a lot of buzz in the vaccine-skeptic/anti-vaxx circles on reddit, Substack and Twitter, while receiving comparatively little airtime on more mainstream publications in relation to the (perceived) importance of the phenomenon. The basic finding is that elevated mortality has continued into 2022 and is currently on track to surpass both 2020 and 2021. This is particularly surprising given that we'd expect a decrease in mortality now that a whole lot of vulnerable people have died already. Also note the sharp increase of mortality for people below the age of 44 and especially below the age of 14.\n\nSo far, the possible explanations I've seen are:\n\n* it's the heat wave,\n* it's COVID itself or its long-term effects,\n* it's the consequences from lockdowns, including staff shortages, treatment delays, economical and mental health fallout etc.\n* and, most controversially of course, it's the vaccines\n\nNone of these seem particularly convincing to me. Why would e.g. heat waves and treatment delays be causing unusual levels of excess mortality for people below the age of 18? If it were the vaccines or lockdowns, the timing seems off. Europe is back open, mass vaccination happened last year at roughly the same scale and time in every European country, so why is Portugal's mortality going trough the roof right now while Denmark is mostly staying where it's at? COVID-infections might be contributing, but confirmed deaths are way down in basically every country and it's also not a known killer of young people. That widespread infections sort of shifted the general population health Bell Curve towards worse outcomes seems plausible, but studies on the side effects that don't look at vulnerable or severely ill subpopulations tend to come up with pretty unconvincing results IMO and again it wouldn't make sense for this to affect specifically young people.\n\nDoes anyone have a good idea for what's going on right now? Is it a combination of some of the mentioned possibilities? Or something else entirely? Or is it overblown, we should just wait a few months/a year or two and mortality will normalize?",
    "permalink": "/r/TheMotte/comments/wzobg4/smallscale_question_sunday_for_august_28_2022/im3q30m/"
  }
]
