[
  {
    "kind": "t1",
    "id": "iglayom",
    "author": "bored_at_work_guy",
    "score": 1,
    "createdUtc": 1658109197,
    "body": "Weird question, but does anyone having dining room chairs they recommend?   I hate mine, but I'm afraid I'd hate whatever replacements I got as well.\n\nFactors: Comfort, appearance, durability, slides across floor nicely.",
    "permalink": "/r/TheMotte/comments/w10nh1/smallscale_question_sunday_for_july_17_2022/iglayom/"
  },
  {
    "kind": "t1",
    "id": "igl6cyu",
    "author": "cant-feel_my-face",
    "score": 1,
    "createdUtc": 1658106930,
    "body": "What is the best physical state to be in when studying? Alone, with someone else, at home, outside?",
    "permalink": "/r/TheMotte/comments/w10nh1/smallscale_question_sunday_for_july_17_2022/igl6cyu/"
  },
  {
    "kind": "t1",
    "id": "igkfte0",
    "author": "bl1y",
    "score": 1,
    "createdUtc": 1658094391,
    "body": "What are the odds the center-left and center-right adopt the traditional gay pride flag as a way to signal opposition to the far-left positions on gender and sexuality?\n\nIt could be flown to mean *Not* The Progress Flag, but at the same time, the left would have a really hard time throwing -phobic labels at someone flying the rainbow flag.",
    "permalink": "/r/TheMotte/comments/w10nh1/smallscale_question_sunday_for_july_17_2022/igkfte0/"
  },
  {
    "kind": "t1",
    "id": "igjsk8b",
    "author": "FiveHourMarathon",
    "score": 1,
    "createdUtc": 1658084384,
    "body": "What are your vices?\n\nFor me personally, compulsive snooping. I can't not snoop. When I start a job, I tell people, look I'm a snoop, don't leave files open a file on my computer and expect me not to read it, don't leave a confidential letter open on the conference table when we're meeting there, don't have a \"private\" conversation in the car with me, I will read/listen/etc. Can't help myself. My wife and I are the same way, and as a result we've always kept phone passwords because we just can't help ourselves and it's too much information to share.",
    "permalink": "/r/TheMotte/comments/w10nh1/smallscale_question_sunday_for_july_17_2022/igjsk8b/"
  },
  {
    "kind": "t1",
    "id": "igjglwo",
    "author": "EdenicFaithful",
    "score": 1,
    "createdUtc": 1658079260,
    "body": "So, what are you reading?\n\nI'm reading Nystrom's *Project of a New System of Arithmetic*, which makes the case for switching to a hexadecimal system for things like clocks (seems like a 16-hour day with 90 decimal minutes per hour?). Skimming it shows that he somehow applies hexadecimal to other things like music. Does not seem like anyone has ever taken it seriously, but it's short and maybe interesting.",
    "permalink": "/r/TheMotte/comments/w10nh1/smallscale_question_sunday_for_july_17_2022/igjglwo/"
  },
  {
    "kind": "t1",
    "id": "igjflgq",
    "author": "cae_jones",
    "score": 1,
    "createdUtc": 1658078819,
    "body": "I dislike earbuds with earplug-nipple-things. It seems like the brands that didn't use them might be moving in that direction, though. What's a reliable no-plug wireless earbud brand? Preferably cheap and unlikely to disappear in the next x years?",
    "permalink": "/r/TheMotte/comments/w10nh1/smallscale_question_sunday_for_july_17_2022/igjflgq/"
  },
  {
    "kind": "t1",
    "id": "igj1y51",
    "author": "NondualGenie",
    "score": 1,
    "createdUtc": 1658072807,
    "body": "Theists of the Motte, what are your thoughts on the Problem of Evil?",
    "permalink": "/r/TheMotte/comments/w10nh1/smallscale_question_sunday_for_july_17_2022/igj1y51/"
  },
  {
    "kind": "t1",
    "id": "igj1bj9",
    "author": "ShouldHaveVotedGore",
    "score": 1,
    "createdUtc": 1658072529,
    "body": "Is eating organic good for anything besides draining your bank account?\n\nCurious how much of a sucker I've been for the past ~1 year",
    "permalink": "/r/TheMotte/comments/w10nh1/smallscale_question_sunday_for_july_17_2022/igj1bj9/"
  },
  {
    "kind": "t1",
    "id": "igikeu1",
    "author": "Difficult_Ad_3879",
    "score": 1,
    "createdUtc": 1658064450,
    "body": "Why is it so uncommon to factor for the malleability of value in our beliefs?\n\nFor instance, if I am a feminist, it’s important to factor in the fact that people can be reared to value *either* feminist values *or* traditional values. Humans are this malleable, that they can be raised to value particular things according to what they consume and how they model rewards. Men, for instance, can be raised to value the Spartan way of life, the Athenian way of life, or the Puritan way of life. By simply changing some variables we can have people value different things.\n\nThis is important, because it means we can just think dispassionately “what is best for the whole of society”, without much care for what people happen to value at this particular point, ourselves included. I have little doubt that if I were born a Spartan I would love war and that if I were born a Puritan I would love prayer. People did not historically deviate from their culture’s values except in times of strong propaganda against the values, eg counterculture 60’s with their strong and vivid media.",
    "permalink": "/r/TheMotte/comments/w10nh1/smallscale_question_sunday_for_july_17_2022/igikeu1/"
  },
  {
    "kind": "t1",
    "id": "igifq3r",
    "author": "ChrisPrattAlphaRaptr",
    "score": 1,
    "createdUtc": 1658061780,
    "body": "How many people here actually own a firearm, and if you don't mind saying, is it a hunting rifle/handgun/AR style whatever?",
    "permalink": "/r/TheMotte/comments/w10nh1/smallscale_question_sunday_for_july_17_2022/igifq3r/"
  }
]
