[
  {
    "kind": "t1",
    "id": "igem6kf",
    "author": "Greenei",
    "score": 1,
    "createdUtc": 1657986010,
    "body": "I'm looking for a study that shows that teaching quality is more important for good students than bad students, i.e. the learning achievements of good students increase more quickly with teacher quality. Scott may have linked it once as well. Anyone know where to find it?",
    "permalink": "/r/TheMotte/comments/vvl5yv/smallscale_question_sunday_for_july_10_2022/igem6kf/"
  },
  {
    "kind": "t1",
    "id": "igbrw54",
    "author": "Armadiljon",
    "score": 1,
    "createdUtc": 1657926526,
    "body": "Do trans people write to this sub? Could anyone point me to some of their comments regarding transgenderism?",
    "permalink": "/r/TheMotte/comments/vvl5yv/smallscale_question_sunday_for_july_10_2022/igbrw54/"
  },
  {
    "kind": "t1",
    "id": "ig2zc7f",
    "author": "buttfaceszn",
    "score": 2,
    "createdUtc": 1657769107,
    "body": "Forgive me if this is too low-effort and unsourced- but does anyone else think that CTE (Chronic Traumatic Encephalopathy) is fake? Or at the very least unconfirmed and asserted as fact?  \n\nI say this after a post in the NFL subreddit about a quote from Hall of Fame linebacker Brian Urlacher, where he says that retired players are falsely claiming CTE to get money from a lawsuit. Now Urlacher is wrong on a key point, in that the NFL’s settlement was paid out to all retired players and there is no pending lawsuit against the NFL. But many if not most of the comments on the post took issue with the fact that Urlacher says there are players falsely proclaiming they have CTE. The most discussed study about CTE, at least among low-information sources like Reddit, was an examination of the brains of 113 former NFL players, of which 112 apparently had CTE. Some people point out that the methodology was flawed, as the sample was sourced from families who suspected their deceased relative had CTE. But even with the sampling bias, it still seems wildly implausible to me.  \n\nI did a very low effort examination of the research, as in I read the abstracts of a few papers about CTE on pubmed, and it does seem as if there is some skepticism among researchers about it. The reported symptoms are all over the place: brain fog, memory loss, depression, anxiety, su*cidal thoughts, erratic behavior, mood swings, difficulty thinking, etc. Now all of these symptoms sound unverifiable and difficult to link to CTE, they also seem like things that are particularly suggestible and prone to confirmation bias, as in if you are told you likely have CTE, it’d be very easy to report having had some of these symptoms even if they were unrelated. The more serious, or at least more easily observable symptoms are early onset dementia/Alzheimer’s, or at least something that seems similar and is similarly linked to a degenerative brain disease. But if 99% of NFL players have CTE, or even 50%, wouldn’t it be very obvious if they were suffering from early degenerative brain diseases at a higher rate than the population? Is there any evidence of this?  \n\n\nSome of my skepticism also relates to the diagnostic criteria. I am completely unqualified to comment on any of this- but my understanding is that CTE is reportedly caused by an accumulation of tau protein tangles or bundles, and that these are also linked with other degenerative brain diseases. But AIUI, these also naturally occur to some extent in everybody as we age. So is there some threshold of the amount of tau protein that qualifies as CTE, or is it something that you can always find if you look for it? Is there a study comparing the prevalence of this in former athletes against a representative sample of non-athletes?   \n\n\nAs far as I can tell, almost none of the questions I posed have been studied or have a clear answer. Yet for years people have been claiming that they will never let their children play football, that football should be illegal, that every time a former player commits a crime or does something weird that it’s because of their CTE. But to me it seems at least unproven, and very well may not be an issue at all. The long list of vague symptoms seems to sound a lot like some psychosomatic illnesses, or things that could be caused by a number of other issues. Note, the current hypothesis about CTE is that it is caused by repeated, low impact collisions to the head, like from soccer players heading the ball or routine blocks and tackles in football. This is separate from the brain damage caused by repeated concussions, which I am not at all skeptical about. Wondering if anyone else has thought about this?",
    "permalink": "/r/TheMotte/comments/vvl5yv/smallscale_question_sunday_for_july_10_2022/ig2zc7f/"
  },
  {
    "kind": "t1",
    "id": "ifxa7hd",
    "author": "NotATleilaxuGhola",
    "score": 3,
    "createdUtc": 1657669152,
    "body": "Does anyone recall a post on the idea that \"midwits are the lieutenants of society\" or something like that?  The thrust was that midwits get a bad rap because they serve an important, load-bearing function in society by being smart enough to do useful work but not so smart that they question the narrative and destabilize things.",
    "permalink": "/r/TheMotte/comments/vvl5yv/smallscale_question_sunday_for_july_10_2022/ifxa7hd/"
  },
  {
    "kind": "t1",
    "id": "ifwjyxh",
    "author": "herzenslied",
    "score": 2,
    "createdUtc": 1657658245,
    "body": "Does anybody have experience with, and/or can recommend, apps for forming online friendships with people nearby-ish?\n\nI've had some decent amount of success with language learning apps like HelloTalk and Tandem, but seeing as these are gained primarily towards language *learning*, I don't really meet people in *my own* country/region via them - only foreigners. This kinda bums me out as every single one of my friends is too far away to visit comfortably, and I don't currently see the need to increase that number further.\n\nThis is something I'd like to change, but I can't really think of any apps that suit the bill. Unfortunately, the app market is of the \"95% shit, 5% decent\" variety, so any tips that could speed up my process of going through the seemingly inexhaustible list of garbage-quality \"friend finding apps\" on the play store would be greatly appreciated.\n\nSpecifically, I'm looking for something that *isn't* just another dating app clone Tinder-wannabe (like the top search results for \"friends\" on the play store all seem to be). But something more like the apps I mentioned above, where you can actually send messages to people, reach out, and form friendships based on common interests.",
    "permalink": "/r/TheMotte/comments/vvl5yv/smallscale_question_sunday_for_july_10_2022/ifwjyxh/"
  },
  {
    "kind": "t1",
    "id": "ifvndpf",
    "author": "PokerPirate",
    "score": 3,
    "createdUtc": 1657645358,
    "body": "I have a quick question about birth order effects that I think people here might be able to answer.  Specifically, how can I reconcile the following two observations:\n\n1. first borns tend to have higher achievement (as measured by wealth/education/etc) as adults\n\n1. the 2nd/3rd/etc child will tend to walk/talk earlier than the first because they are trying \"to keep up\" with their big brother/sister\n\nWhy is it the case that having an older sibling is helpful for young infant development, but not in the latter years?  Or am I misinterpreting these results and that's not actually the case?",
    "permalink": "/r/TheMotte/comments/vvl5yv/smallscale_question_sunday_for_july_10_2022/ifvndpf/"
  },
  {
    "kind": "t1",
    "id": "iftth4n",
    "author": "retireaus",
    "score": 7,
    "createdUtc": 1657608715,
    "body": "What does it mean for someone to \"find themselves\"? I see this phrase used all the time in contexts that seem almost oppposite.\n\nJoe is a 27 year old dentist, highly successful, but got into dentistry because his parents wanted him to. He decides to take a 6 month holiday in south america to \"find himself\", hiking, partying and travelling, and comes back refreshed and ready to grind dentistry for another 5 years.\n\nSam is a 25 year old loser stereotype. Lives with his parents playing world of warcraft while working 30 hours a week as assistant manager at the local burger king. Started a degree in computer science but never finished it. Sam decides to \"find himself\", a process which involves joining a gym, taking steroids, and getting into bodybuilder culture. He later competes as an amateur bodybuilder and starts an instagram, and appears to have higher self esteem, though the excessive focus on bodybuilding and steroids seems slightly unsavoury. His newfound lifestyle at least allows him to start dating, though he still lives with his mum and has racked up a problematic credit card debt.\n\nAnne is a practicing surgeon and has a high pressure full time job. Anne decides to take on higher paying contract work for 12 months, which is similarly high pressured, which she describes as \"finding herself\".\n\nSo finding yourself sort of seems like reevaluating your priorities in life, possibly changing them, possibly keeping them the same but with a firmer grasp on the underlying reasons, possibly changing your behaviours slightly but leaving your personality largely unchanged with slightly more money or sex partners, possibly focusing on short term financial goals to defer more profound goals until later.\n\nI sort of see threads of commonality, but it also feels functionally like a just-so story for any set of behaviours whatsoever. Self improvement? Find yourself. 6 month holiday? Find yourself. Divorce and start dating fresh? Find yourself. Take on higher paying contract role? Find yourself.",
    "permalink": "/r/TheMotte/comments/vvl5yv/smallscale_question_sunday_for_july_10_2022/iftth4n/"
  },
  {
    "kind": "t1",
    "id": "ifqfwcp",
    "author": "escherofescher",
    "score": 6,
    "createdUtc": 1657554065,
    "body": "I would appreciate if someone could provide feedback on this line of thinking. It's something that occurred to me during a long evening walk and I can't decide whether this is a somewhat accurate map of the territory or a complete fabrication of some baser part of my mind.\n\nCollectivism as a different mode of being. I had always assumed that people who lean toward it do so through a conscious choice, that they think through some sort of mini social contract, judge the benefits, and accept/reject it on merit before joining a group. Also, they're conscious and watchful while part of some group so that if the group breaks the contract, they would leave it.\n\nBut what if it's not a conscious choice? What if, whoever dips their head under the collectivist waterline, surrenders their \"self\" and their brain becomes a substrate for running the collective's distributed OS?\n\nPerhaps it will help if I describe what lead me to this train of thought. I imagined a person deeply enmeshed in some collective identity. If you're in the US, imagine a woman with short blue hair, her face full of piercings, a t-shirt that says \"long live Che\", a pair of Doc Marten's, and NPR blaring on her headphones. Or, to balance things out, imagine an obese man driving a leased pickup truck with one American and one Gadsden flag, listening to a radio version of One America Network's report about election fraud.\n\nWhat these two stereotype images have in common is that it seems both of these people have surrendered their minds to a collective. In other words, they outsource their opinion-formation and worldview out to a group of people. Do they still reason? Are they critical of new information? Do they introspect? Or do they merely think what their chosen collective tells them to think?\n\nI've met many people that fall somewhere farther or closer to these stereotypes. And one characteristic that always strikes me is that they communicate in the same way: repeating slogans or headlines from their preferred media source (or social media milieu), ie. they're outputting canned rhetoric someone cooked up for them. Because of that, they can't actually engage in a discussion because they can't respond to arguments. They can only shoot back these prepackaged messages.\n\nGoing down this slippery slope, talking with people like this doesn't mean engaging with a reasoning individual, but with a tentacle of a much larger organism. Basically, an alien.\n\nEh, I know that to some this must sound like an edgy 16 yo's, \"2deep4you\" line of thinking. I think I bring it up because it's dawning on me just how differently different people think and it's freaking me out. I think one of my core beliefs was that people reason more or less in the same way, but observing people is shaking things up in my mind.\n\nSo, is there any merit to this? Any threads in the form of reading I could pull to understand this side of humanity better? Any gross mistakes in this view?",
    "permalink": "/r/TheMotte/comments/vvl5yv/smallscale_question_sunday_for_july_10_2022/ifqfwcp/"
  },
  {
    "kind": "t1",
    "id": "ifp0lwd",
    "author": "RadicalizeMeCaptain",
    "score": 10,
    "createdUtc": 1657522896,
    "body": "According to [this graph ](https://nitter.net/QuarantinedCoof/status/1546185145698353154#m), Biden's approval rating took a big dip after the Afghanistan pullout. Why? I thought people generally wanted the US to pull out.",
    "permalink": "/r/TheMotte/comments/vvl5yv/smallscale_question_sunday_for_july_10_2022/ifp0lwd/"
  },
  {
    "kind": "t1",
    "id": "ifnth1f",
    "author": "Ilforte",
    "score": 15,
    "createdUtc": 1657498605,
    "body": "What happens to thinking people who are clearly wrong but [whose heads haven't exploded](https://www.ted.com/talks/dan_dennett_the_illusion_of_consciousness?language=en)? \n\nThe (imo) stupid adage that science advances one funeral at a time is so old that I think it has finally [overstayed its welcome](https://rootsofprogress.org/how-curing-aging-could-help-progress) and, with any luck, we'll bid it final goodbyes soon enough. \n\nYes sometimes, often even, it is right on the money. There are walking scholarly zombies all around: people who've bet it all on a hypothesis, have been publicly and convincingly proven wrong (or had the ground move under them to the point their entire map became obsolete) and have not recanted. Indeed, some double down or just begin to ignore all criticism. \n\nWhat do we know about such cases and such people? Are they just cognitively rigid and emotionally invested? Bound like slaves to a cottage factory that has been built around their assumptions, perhaps? Does the stress of debunking alter their reasoning somehow, degrade it maybe? How does it feel from the inside? I've seen some curious patterns, but don't want to bias you. \n\nThe easy recent example: Hofstadter and GPT-3, see [Scott's 53rd point](https://astralcodexten.substack.com/p/links-for-june-1e7) and [my comment](https://www.reddit.com/r/TheMotte/comments/vp23id/quality_contributions_report_for_june_2022/iej8xel/).  \n\nWhat are your examples? And if you know any more systematic sources: I'd be much obliged. Sounds like something Lesswrong ought to have done a lot of work on.",
    "permalink": "/r/TheMotte/comments/vvl5yv/smallscale_question_sunday_for_july_10_2022/ifnth1f/"
  },
  {
    "kind": "t1",
    "id": "ifnimbw",
    "author": "[deleted]",
    "score": 7,
    "createdUtc": 1657493445,
    "body": "[deleted]",
    "permalink": "/r/TheMotte/comments/vvl5yv/smallscale_question_sunday_for_july_10_2022/ifnimbw/"
  },
  {
    "kind": "t1",
    "id": "ifmdv53",
    "author": "jacksonjules",
    "score": 10,
    "createdUtc": 1657475715,
    "body": "Anyone know what happened to [A New Radical Centrism](https://web.archive.org/web/20220420073405/https://twitter.com/a_centrism)? (Posted an old archive link for clarity about who they are).\n\nI assume they got banned for breaking Twitter's content rules on race and trans stuff. Do they have a new landing site?",
    "permalink": "/r/TheMotte/comments/vvl5yv/smallscale_question_sunday_for_july_10_2022/ifmdv53/"
  },
  {
    "kind": "t1",
    "id": "ifm9qxr",
    "author": "EdenicFaithful",
    "score": 8,
    "createdUtc": 1657473948,
    "body": "So, what are you reading?\n\nI'm reading Schwab's *The Fourth Industrial Revolution*. I've only heard of him filtered through anti-lockdown perspectives, but I admit that I find it hard to hate someone who dresses, as they say, like a Bond villain.",
    "permalink": "/r/TheMotte/comments/vvl5yv/smallscale_question_sunday_for_july_10_2022/ifm9qxr/"
  },
  {
    "kind": "t1",
    "id": "ifm3k67",
    "author": "Capital_Room",
    "score": 6,
    "createdUtc": 1657471314,
    "body": "When one is a useless, defective parasite upon the body public, who provides nothing, contributes nothing, does nothing meaningful, and who (socially speaking) already practically doesn't exist, why should one bother suffering through 30+ years of increasing misery and futility, rather than just skipping to the inevitable conclusion now?",
    "permalink": "/r/TheMotte/comments/vvl5yv/smallscale_question_sunday_for_july_10_2022/ifm3k67/"
  },
  {
    "kind": "t1",
    "id": "iflhxov",
    "author": "ShouldHaveVotedGore",
    "score": 8,
    "createdUtc": 1657461851,
    "body": "It appears I'm going to acquire a decent sum of money soon. Nothing too crazy but more than I'd be comfortable with just sitting around in a checking account. How would you suggest \"storing\" it? Mutual funds? Multiple approaches to \"diversify\" against single point of failure?",
    "permalink": "/r/TheMotte/comments/vvl5yv/smallscale_question_sunday_for_july_10_2022/iflhxov/"
  },
  {
    "kind": "t1",
    "id": "iflcie0",
    "author": "NotATleilaxuGhola",
    "score": 12,
    "createdUtc": 1657459130,
    "body": "What podcasts are you into these days?  CW stuff is good, but I'm open to anything that goes deep.\n  \nOnly thing I can't tolerate is excessive bantering and bullshit, I don't like feeling like a stranger listening in on a bunch of bros cracking inside jokes.",
    "permalink": "/r/TheMotte/comments/vvl5yv/smallscale_question_sunday_for_july_10_2022/iflcie0/"
  },
  {
    "kind": "t1",
    "id": "iflb2gs",
    "author": "Difficult_Ad_3879",
    "score": 3,
    "createdUtc": 1657458350,
    "body": "Did Christianity produce a “domesticating” effect in Europeans?\n\nI was reading about that [Russian fox experiment](https://en.m.wikipedia.org/wiki/Domesticated_silver_fox). Domesticated traits started to occur only after the second generation. After six generations you had a few hyper-domesticated foxes and by the 20th generation 30% of foxes constituted this hyper-domesticated status. \n\nThe Christian social system appears especially conducive to domestication.  Only those with especially prosocial tendencies will get the most out of services; those with especially “domesticated” qualities will be graded best by peers according to the Christian rubric of grading another’s behavior; greater voluntary activity within the church would draw in the especially prosocial, creating prosocial pairings similar to in the Fox experiment. Those who best internalized the behavioral proscriptions of the Church had the highest status, and this obedience is a kind of domestication. Traits like intelligence, humor, and athleticism have no real value in the historically Christian social system, although a minimum amount of intelligence was probably necessary to secure a mate.\n\nCompare to what (little) we know about Paganism. Paganism had no such fixation on domesticated qualities.",
    "permalink": "/r/TheMotte/comments/vvl5yv/smallscale_question_sunday_for_july_10_2022/iflb2gs/"
  },
  {
    "kind": "t1",
    "id": "ifkwy7m",
    "author": "2cimarafa",
    "score": 19,
    "createdUtc": 1657448489,
    "body": "Are some smart people just naturally gullible? My boyfriend is extremely gullible. Sometimes he'll send me instagram posts of literal fake news (not really partisan, more like tabloid-esque 'the Queen has cancer and 30 days to live' headlines, or 'PROOF Rishi Sunak responsible for taking Partygate photos', ie., things that are plausible but also functionally made-up by the post); he sometimes struggles to tell whether some mockumentaries are fictional until 10-15 minutes in. Objectively he's very intelligent according to widely held IQ proxies, test scores, grades, his job and so on. But I'm sometimes stunned at his lack of scepticism, I'm actually very worried that one day someone could trick him into a stupid investment or into being mugged by leading him into an alleyway under false pretences or something. \n\nDo you know people like this (maybe you're together with one)? Is there a solution or do I just have to live with this concern?",
    "permalink": "/r/TheMotte/comments/vvl5yv/smallscale_question_sunday_for_july_10_2022/ifkwy7m/"
  }
]
