[
  {
    "kind": "t1",
    "id": "ikvg8f1",
    "author": "thejawaknight",
    "score": 1,
    "createdUtc": 1660870753,
    "body": "Posted on culture war thread but told I should put here:\n\nI have a friend who's suddenly gone very far to the left and she believes that we need a violent revolution against today's \"systems.\" She also thinks she needs to constantly keep a \"revolutionary mindset\" in order to overthrow the government. Has anyone else had experience with friends becoming this radical?\n\n I still intend to stay friends with her but I just wanted to see what experiences other people might have had with this.",
    "permalink": "/r/TheMotte/comments/wnz8wv/smallscale_question_sunday_for_august_14_2022/ikvg8f1/"
  },
  {
    "kind": "t1",
    "id": "ikeni69",
    "author": "escherofescher",
    "score": 6,
    "createdUtc": 1660584082,
    "body": "I asked this in the [previous thread](https://www.reddit.com/r/TheMotte/comments/wi8rc4/smallscale_question_sunday_for_august_07_2022/ijl6gb9/) but got no hits. I'll ask one more time, hoping that maybe this time it'll get more eyeballs, then commit myself to silence:\n\nIs there a modern expansion or critique to Popper's \"Open Society and Its Enemies\"?\n\nI've found his arguments strongly convincing. Even if I disregard the large part about historicism, the open/individual vs closed/collectivist model continue to make sense to me.\n\nI wonder if someone picked up his ideas and continued to develop them? Or if someone found flaws?\n\nI know Soros published some books in the same area (open society/capitalism reform), but haven't looked at any of them yet.",
    "permalink": "/r/TheMotte/comments/wnz8wv/smallscale_question_sunday_for_august_14_2022/ikeni69/"
  },
  {
    "kind": "t1",
    "id": "ike0zu9",
    "author": "DevonAndChris",
    "score": 5,
    "createdUtc": 1660575208,
    "body": "How do you teach a kid learning algebra to recognize square numbers?\n\nMy kid knows how to factor `a^2 - b^2` but cannot recognize that `121x^2 - y^2` is of that form.\n\nI do not know how to *not* see 121 as a ~~prime~~ square number, so I am not much help here.",
    "permalink": "/r/TheMotte/comments/wnz8wv/smallscale_question_sunday_for_august_14_2022/ike0zu9/"
  },
  {
    "kind": "t1",
    "id": "ikaie1b",
    "author": "Blacknsilver1",
    "score": 5,
    "createdUtc": 1660506165,
    "body": "Any recommendations for worthwhile subreddits? Or other forums?",
    "permalink": "/r/TheMotte/comments/wnz8wv/smallscale_question_sunday_for_august_14_2022/ikaie1b/"
  },
  {
    "kind": "t1",
    "id": "ikac6ei",
    "author": "EdenicFaithful",
    "score": 19,
    "createdUtc": 1660503581,
    "body": "So, what are you reading?\n\nI'm picking up Vernor Vinge's *A Fire Upon the Deep*. I've been hearing about this book for years, but finally decided to read it when I realized that it's the same person who wrote the well-known paper *The Coming Technological Singularity*.",
    "permalink": "/r/TheMotte/comments/wnz8wv/smallscale_question_sunday_for_august_14_2022/ikac6ei/"
  },
  {
    "kind": "t1",
    "id": "ika0y4x",
    "author": "Walterodim79",
    "score": 23,
    "createdUtc": 1660498951,
    "body": "The second story of my home, where I have my desk and computer set up, overlooks a park. I've considered this one of the nicer features of my home, particularly given how many cityscapes don't have all that nice of views. In the past couple months, a group of indigents have taken up residence in the park and seem to be escalating their degree of permanence; what started with someone sleeping with their head on their suitcase moved to having a couple mattresses, and today I see that a tent has been added. During the day, more of their friends show up and spread out more mattresses and blankets and drink all day. \n\nWhat's the appropriate reaction to this? How would you feel and react to it? I've done nothing about it at present other than comment to my wife that I think it's going nowhere good, but I'm trying to process whether I should be doing anything about it or just dealing with the fact that this is just how American cities are.",
    "permalink": "/r/TheMotte/comments/wnz8wv/smallscale_question_sunday_for_august_14_2022/ika0y4x/"
  },
  {
    "kind": "t1",
    "id": "ik995xh",
    "author": "Difficult_Ad_3879",
    "score": 7,
    "createdUtc": 1660487364,
    "body": "Could anyone familiar with chemistry and neurobiology tell me how bad [S-Reticuline](https://en.m.wikipedia.org/wiki/Reticuline) is for neurons?  I’m trying to figure out whether reticuline is neurotoxic like alcohol or something more serious. There’s some cool herbalism involving it but I don’t want to take chances.\n\nI can only find its toxicity in relation to Annonacin where it’s written “annonacin is a thousand times (1000x) more toxic to cultured neuronal cells than reticuline”. Regarding annonacin, “Studies in rodents indicate that consumption of annonacin (3.8 and 7.6 mg per kg per day for 28 days) caused brain lesions consistent with Parkinson's disease. An adult who consumes a fruit or can of nectar daily over the course of a year is estimated to ingest the same amount of annonacin that induced brain lesions in the rodents receiving purified annonacin intravenously.”\n\nOne study has,\n\n&gt;we exposed mesencephalic dopaminergic neurons in culture to the total extract (totum) of alkaloids from Annona muricata root bark and to two of the most abundant subfractions, corexi- mine and reticuline. After 24 hours, 50% of dopaminergic neu- rons degenerated with 18 􏰀g/ml totum, 4.3 􏰀g/ml (13 􏰀M) coreximine, or 100 􏰀g/ml (304 􏰀M) reticuline.\n\nNow a lancet correspondence from 99 says,\n\n&gt; Although the two studies did conclude that simple 1-benzylated TIQs are “relatively weak neurotoxins” that can cause behavioural signs of parkinsonism in animal models, they did not examine the structurally more complex reticuline, a morphinan precursor (or any of its N-methylated alkaloidal derivatives or metabolites). As with many isoquinoline alkaloids, reticuline has pharmacological activity at diverse neurotransmitter synapses and uptake sites. However, a myriad of studies going back nearly 30 years have never revealed it to be neurotoxic. If anything, with its phenolic groups, reticuline is more likely to be a n t i o x i d a t i v e 4 , 5 a n d , t h u s, n e u r o - protective against the free radical- initiated toxicity that is commonly linked to neurodegenerative mechanisms.\n\nThe cell culture study looks pretty bad though.",
    "permalink": "/r/TheMotte/comments/wnz8wv/smallscale_question_sunday_for_august_14_2022/ik995xh/"
  },
  {
    "kind": "t1",
    "id": "ik8mt3g",
    "author": "George_E_Hale",
    "score": 4,
    "createdUtc": 1660474338,
    "body": "Has the world gone fucking insane?  \n\nIs this an appropriate question?\n\nEdit： Apparently it's not an appropriate question.",
    "permalink": "/r/TheMotte/comments/wnz8wv/smallscale_question_sunday_for_august_14_2022/ik8mt3g/"
  },
  {
    "kind": "t1",
    "id": "ik8ht6s",
    "author": "throwaway-7744",
    "score": 7,
    "createdUtc": 1660470209,
    "body": "Does the FBI and/or CIA have it in for Donald Trump? And if so, why?",
    "permalink": "/r/TheMotte/comments/wnz8wv/smallscale_question_sunday_for_august_14_2022/ik8ht6s/"
  }
]
