[
  {
    "kind": "t1",
    "id": "iiq9xjh",
    "author": "FiveHourMarathon",
    "score": 1,
    "createdUtc": 1659492885,
    "body": "Late to the party: Best audiobooks you've heard recently? I have some audible credits I need to burn so I can pause the subscription. I like classics, I like history, I'd love something beach-read-y (listen-y?), I like long.",
    "permalink": "/r/TheMotte/comments/wchwo3/smallscale_question_sunday_for_july_31_2022/iiq9xjh/"
  },
  {
    "kind": "t1",
    "id": "iiq99mq",
    "author": "netstack_",
    "score": 1,
    "createdUtc": 1659492580,
    "body": "The new inflation bill says price controls are supposed to be handled by:\n\n&gt; ‘‘(6) The sharing with the Secretary of the\n10 Treasury of such information as is necessary to determine the tax imposed by section 4192 of the Internal Revenue Code of 1986 (relating to enforcement of this part).\n\nIf that's referring to 26 USC § 4192, uh, [it was repealed in 1965](https://www.law.cornell.edu/uscode/text/26/subtitle-D/chapter-32/subchapter-E).\nI don't think this source is supposed to be a historical snapshot.\nSo where's the section?",
    "permalink": "/r/TheMotte/comments/wchwo3/smallscale_question_sunday_for_july_31_2022/iiq99mq/"
  },
  {
    "kind": "t1",
    "id": "iiomw7g",
    "author": "Im_not_JB",
    "score": 1,
    "createdUtc": 1659468637,
    "body": "What is the best resource/advice you have seen for how to negotiate a new job offer?",
    "permalink": "/r/TheMotte/comments/wchwo3/smallscale_question_sunday_for_july_31_2022/iiomw7g/"
  },
  {
    "kind": "t1",
    "id": "iinihgc",
    "author": "Navalgazer420XX",
    "score": 1,
    "createdUtc": 1659453532,
    "body": "Online banking security: how?\n\nWhat are the actual, _realistic_ threats you have to deal when banking through mobile apps? Is there real potential for half a mil to get transferred out of my brokerage account because I was using a slightly too old version of android?\n\nI'm not worried about credit cards, because you have over a month to notice and take care of it. It's the idea of losing everything that really spooks me.",
    "permalink": "/r/TheMotte/comments/wchwo3/smallscale_question_sunday_for_july_31_2022/iinihgc/"
  },
  {
    "kind": "t1",
    "id": "iikjjz1",
    "author": "SomewhatEmbarassed",
    "score": 0,
    "createdUtc": 1659394277,
    "body": "how do I tell radical leftists that their idea of centrism as a facist-allied passivity is inherently intolerant of any views different from their own",
    "permalink": "/r/TheMotte/comments/wchwo3/smallscale_question_sunday_for_july_31_2022/iikjjz1/"
  },
  {
    "kind": "t1",
    "id": "iiith8t",
    "author": "EdenicFaithful",
    "score": 5,
    "createdUtc": 1659370108,
    "body": "Anyone know any good books on social media design?\n\nThe total elimination of compulsive browsing in my life has led me to see clearly how one's mind adapts to the things he interacts with. Social media seems to be the way things are because I use it, not because it is the way things are. Browsing seems like an effective means of getting information because it's the most present way that I'm exposed to information, not because it is an effective means of getting information. And it's the most present way because something went wrong between the human-computer interaction.\n\nI feel the need for something more compatible with this zen state of not hating everything. Even the things I actually care about are slipping away from my life unless I take the effort to hurt myself by reading garbage, so maybe I need something better.\n\nHopefully there are recognizable classics out there? Looking for anything: theories about interfaces, how to manage users, inside stories like that one about how they designed r/place...especially looking for ones that widely influenced the current industry, however annoyingly mainstream they are, and also any academic tomes that are well put together. The best I've found is [this](https://www.researchgate.net/post/Any-good-books-about-designing-social-media) link, but everything else seems to be about marketing on social media.",
    "permalink": "/r/TheMotte/comments/wchwo3/smallscale_question_sunday_for_july_31_2022/iiith8t/"
  },
  {
    "kind": "t1",
    "id": "iigbkjf",
    "author": "SunRaSquarePants",
    "score": 10,
    "createdUtc": 1659316425,
    "body": "Is there a sub with an ongoing discussion of the continuing takeover of /r/science with \"social science\" political agenda posts?",
    "permalink": "/r/TheMotte/comments/wchwo3/smallscale_question_sunday_for_july_31_2022/iigbkjf/"
  },
  {
    "kind": "t1",
    "id": "iifwx1y",
    "author": "exiledouta",
    "score": 6,
    "createdUtc": 1659309278,
    "body": "The main CW thread seems to be roughly half as many comments as usual, any speculation as to why?",
    "permalink": "/r/TheMotte/comments/wchwo3/smallscale_question_sunday_for_july_31_2022/iifwx1y/"
  },
  {
    "kind": "t1",
    "id": "iiewoxb",
    "author": "EdenicFaithful",
    "score": 7,
    "createdUtc": 1659293380,
    "body": "So, what are you reading?\n\nI'm still on Dreyfus' *Underground*, about black hat hackers in the 90s. It's nice to read such a close account of something that I've only vaguely heard of in news reports. So far Par's story has been gripping and sympathetic.",
    "permalink": "/r/TheMotte/comments/wchwo3/smallscale_question_sunday_for_july_31_2022/iiewoxb/"
  },
  {
    "kind": "t1",
    "id": "iie1yph",
    "author": "Just_Natural_9027",
    "score": 12,
    "createdUtc": 1659280425,
    "body": "What’s the issue/position that you’ve most recently changed your mind on?\n\nI'll start with saying each and everyday I am more convinced that ignorance is bliss particular with regards to political and culture war discourse.",
    "permalink": "/r/TheMotte/comments/wchwo3/smallscale_question_sunday_for_july_31_2022/iie1yph/"
  },
  {
    "kind": "t1",
    "id": "iidzg8g",
    "author": "margotsaidso",
    "score": 10,
    "createdUtc": 1659279336,
    "body": "Not sure if it matches the typical Sunday question thread theme, but I'll be visiting San Diego for a few days. Anyone have recommendations for must-see things or something off the beaten path to check out?",
    "permalink": "/r/TheMotte/comments/wchwo3/smallscale_question_sunday_for_july_31_2022/iidzg8g/"
  },
  {
    "kind": "t1",
    "id": "iidvk5l",
    "author": "Difficult_Ad_3879",
    "score": 3,
    "createdUtc": 1659277614,
    "body": "Anyone have cool books or youtubes on psychology they would recommend? Especially related to reinforcement, learning type stuff, more advanced than basic.",
    "permalink": "/r/TheMotte/comments/wchwo3/smallscale_question_sunday_for_july_31_2022/iidvk5l/"
  },
  {
    "kind": "t1",
    "id": "iidoauk",
    "author": "zataomm",
    "score": 8,
    "createdUtc": 1659274162,
    "body": "Is there anything stopping Elon Musk from just buying Twitter stock at the market price before he potentially loses his lawsuit?",
    "permalink": "/r/TheMotte/comments/wchwo3/smallscale_question_sunday_for_july_31_2022/iidoauk/"
  },
  {
    "kind": "t1",
    "id": "iido1sq",
    "author": "LacklustreFriend",
    "score": 11,
    "createdUtc": 1659274030,
    "body": "So I want to ramble out some thoughts about behaviour game theory as it applies to society or morality, or at least that's the best way I can think to describe it. I realise I'm treading philosophical old ground here but it is something I've been thinking about recently.\n\nIn the Prisoner's Dilemma, and the Tragedy of the Commons etc, we have the general case of rational individual actions leading to negative outcomes for everyone.\n\nWhat this really reminds me of egoist, classical realist, amoral (individualist, even) philosophy, perhaps best exemplified by Machiavelli's *The Prince*. That is generally a purely self interested individual with no concern for the common good. But there is a glaring issue with Machiavellian philosophy. No one would ever want to work under the Prince, over him or with him, because he would betray you in a heartbeat, and would be constantly looking for opportunities to undermine you for his own benefit. If everyone took Machiavelli's advice and acted like the perfect Prince, there could be no society. Everyone would just be continuously trying to screw each other over, there can be no true cooperation or common good.\n\nThis has kind of given me the idea of a kind of 'social parasitism' (yes I am aware of the association of the term with Soviet political prisoners - I using it in an different sense. It's an apt label here). Machiavelli's Prince is basically a 'social parasite', in the sense benefiting himself while harming society and others generally. Just like an actual biological parasite, the social parasite needs the host ('society') to thrive, yet if there are too many social parasite, it will leech too much off the host and kill society and itself (metaphorically), causing society to devolve into chaos and bloody anarchy. The Prince can only exist by exploiting the system he is ultimately undermining by his actions.\n\nIf I can think of any benefit that the Prince might provide to society, it might be if there is only one who gains supreme power and thus could theoretically rule competently (after all, this was the original intent for the Prince. But that requires there to only ever be one and only one Prince or would-be Prince. (Maybe you could use this as justification for some kind of elitism)\n\nSociopaths are essentially naturally this, amoral and a callous disregard for others, only concerned with their own benefit, abusing others trust. But too many sociopaths would cause everyone to become distrustful and thus collapsing the whole system that sociopaths love to exploit.\n\nIn some sense, I think this also applies to the constantly debated mistake vs conflict theory around here, with conflict theory obviously representing social parasitism. Conflict theorists can make easy gains by exploiting unassuming mistake theorists, but too much conflict results in dysfunction and collapse of social institutions which the conflict theorists are trying to overtake in the first place. The mistake theorists are the ones actually trying to solve issues, after all. I also wonder if there's a conflict theorist Schelling point, where the number of conflict theorists reaches critical mass, they create more problems than mistake theorists can solve, so mistake theorists are left with a choice, to either: become a conflict theorists and try to grab whatever resources are around before the collapse, or \"die\" a mistake theorist. (e.g. a previously principled scientist becoming politicized to secure his job even if it undermines the integrity and value of said job).\n\nThis is obviously not a new observation, but then moral systems (historically religions) primarily exist as enforcement mechanism, as a means to dissuade people from becoming social parasites. It's the Mafia don in the Prison's Dilemma who threatens the prisoners to keep their mouths shut.\n\nI guess another question is, does social parasitism exist in mostly stable or unstable equilibrium? Does the system tend towards a sustainable number of social parasites, only forced out of balance by extreme external events? Or is there a natural, cyclical boom-bust pattern, where increasing social parasitism will ultimately destroy institutions, and mistake theorists will have to build new institutions from scratch before the cycle repeats.\n\nMaybe I'm looking at it backwards. Maybe the conflict theorists surge *after* the collapse of an institution, rushing to pick at the scraps like a vulture collecting carrion. Attempting to carve out a little niche for themselves, while stunting the ability for mistake theorists to rebuild. Maybe this is what we are seeing with the death of God, decaying social cohesion, and the attempt to establish some new common morality again.\n\nYeah I don't really know where I'm going with this. I would like to hear everyone else's thoughts on this.",
    "permalink": "/r/TheMotte/comments/wchwo3/smallscale_question_sunday_for_july_31_2022/iido1sq/"
  },
  {
    "kind": "t1",
    "id": "iiczkhv",
    "author": "Blacknsilver1",
    "score": 6,
    "createdUtc": 1659256529,
    "body": "When looking at an url for a potentially sketchy website, which end should I be looking at- the front or the back?   \nIn other words, the     \n\n&gt;www.microsoft...    \n\nor the     \n\n&gt;...microsoft.com/    \n\n?    \n\nI'm assuming at least one end can show legitimacy at a glance. I saw [this gif](https://i.redd.it/sgp2jxdqmte91.gif) recently and got curious.",
    "permalink": "/r/TheMotte/comments/wchwo3/smallscale_question_sunday_for_july_31_2022/iiczkhv/"
  },
  {
    "kind": "t1",
    "id": "iicun3i",
    "author": "S18656IFL",
    "score": 17,
    "createdUtc": 1659252547,
    "body": "For our Russian posters:\n\nHow are things in Russia for the average person? How's the mood? How's the personal economy? \n\nThere are a lot of numbers floating around but they often fail to communicate how things are on the ground.",
    "permalink": "/r/TheMotte/comments/wchwo3/smallscale_question_sunday_for_july_31_2022/iicun3i/"
  },
  {
    "kind": "t1",
    "id": "iicqf8c",
    "author": "NotATleilaxuGhola",
    "score": 14,
    "createdUtc": 1659249266,
    "body": "Is there a term for deep happiness and fulfilment spiked with the bitter knowledge that this too shall pass, sic transit gloria mundi, memento mori, remember you are dust?\n  \nThese days I feel like I've achieved nearly all of my life goals, but I'm pained with the knowledge that I can't stay in this particular stage of my life forever.  The summer of my life will one day end, and I'll pass into autumn and winter.  There's a bittersweet beauty to how transient life is and how fleeting moments of fulfillment are.  It's both pleasurable and painful, like just the right amount of DOMS after a good workout.  I wish I were more poetic or artistic so I could express the sensation better than this.",
    "permalink": "/r/TheMotte/comments/wchwo3/smallscale_question_sunday_for_july_31_2022/iicqf8c/"
  }
]
