[
  {
    "kind": "t1",
    "id": "iaytvdb",
    "author": "Ilforte",
    "score": 6,
    "createdUtc": 1654209061,
    "body": "I'm gathering information about Gamergate for a small project of mine, and would like to get recommendations of analysis of that era. Do you remember any decent writeups? Maybe you were politically «awakened» around that time and could explain what it was about? \n\nThe main angle will probably be «apolitical escapists forced to contend with political operators in a space which is the primary habitat for the former and another platform for the latter, with second-order grifters springing to exploit the dissatisfaction». But this is all second-hand, I wasn't too interested in games or CW at that time.",
    "permalink": "/r/TheMotte/comments/v053ii/smallscale_question_sunday_for_may_29_2022/iaytvdb/"
  },
  {
    "kind": "t1",
    "id": "iaq10hk",
    "author": "f3zinker",
    "score": 2,
    "createdUtc": 1654039811,
    "body": "Would operating under a negative utilitarian moral framework lock you into economically left wing positions?\n\nI think so because those on the economic left give greater weight to suffering under economic destitution than negative utility experienced by having to give away large chunks of your income, and that seems to be a well defended motte to be in, its hard to argue for the inverse. \n\nA truly capitalistic system would also entail tremendous short term suffering for some classes of people, for the \"losers\". This does not imply that net utility isn't greater in the long term. But many might not have the stomach to allow for that deadwood to burn out or let those who are destined to fall through the cracks as they would, even if it means for those who wouldn't everything would be a lot better.",
    "permalink": "/r/TheMotte/comments/v053ii/smallscale_question_sunday_for_may_29_2022/iaq10hk/"
  },
  {
    "kind": "t1",
    "id": "iamodfj",
    "author": "AndOnTheNthDay",
    "score": 3,
    "createdUtc": 1653973670,
    "body": "Is Monekypox a cause for concern?",
    "permalink": "/r/TheMotte/comments/v053ii/smallscale_question_sunday_for_may_29_2022/iamodfj/"
  },
  {
    "kind": "t1",
    "id": "iakgnu7",
    "author": "problem_redditor",
    "score": 18,
    "createdUtc": 1653932703,
    "body": "This is perhaps a bit of an odd question, but I'll drop it in nevertheless. I'd like to know if this is a common experience.\n\nOver the past few years, I've actively exposed myself on a regular basis to the writings of critical social justice-leaning people (which is quite a bit when you consider that it's added on top of the basic amount of wokeness that everyone is routinely exposed to through the media, entertainment, and even their own social groups). Something that's necessary if you want to participate in culture war matters is understanding the phenomenon you're critiquing, but properly understanding the perspective and worldview of your opponents has a few long-term consequences.\n\nWhat's maddening about reading and just generally being exposed to a huge array of (fairly absurd) woke perspectives isn't the initial annoyance that it inevitably causes. I do have strong reasons for opposition to their ideas, but if you are exposed to them too much, regardless of how weak you think the arguments are your brain nevertheless starts to incessantly detail how they would interpret and respond to things you see around you. For example, at this point, I'm now able to involuntarily construct - say - a feminist argument in the back of my mind on a daily basis without even intending to do so, and then feel the strong urge to refute what I myself came up with. It's a very common thing that I can simply just think myself angry.\n\nPerhaps I'm uniquely obsessive, but I find it hard to believe that I'm the only person who experiences this.",
    "permalink": "/r/TheMotte/comments/v053ii/smallscale_question_sunday_for_may_29_2022/iakgnu7/"
  },
  {
    "kind": "t1",
    "id": "iak805z",
    "author": "FiveHourMarathon",
    "score": 11,
    "createdUtc": 1653928876,
    "body": "When exactly did Purses become a feminine concept in American culture? It seems like one of the most arbitrary ideas of gender we have in our culture, yet it is one of the most rigid cultural points. A man carrying anything smaller than a backpack or a briefcase is near universally (if lightly) mocked, and I can't think of any good reasoning behind it. I recall this even being formalized at airports and ballgames when I was a kid, where my mom and sister could carry a purse, but my father and I were not, as a matter of policy. What's the history there?",
    "permalink": "/r/TheMotte/comments/v053ii/smallscale_question_sunday_for_may_29_2022/iak805z/"
  },
  {
    "kind": "t1",
    "id": "iaigbp5",
    "author": "Substantial_Layer_13",
    "score": 16,
    "createdUtc": 1653887260,
    "body": "Has anyone read the book \"Woke Racism\" by John McWhorter? And is it any good? I saw it at the bookstore in the staff recommendation section the other day (which frankly surprised the hell out of me). Thought about getting it, but I thought I would see if others here had read it before I drop the cash.",
    "permalink": "/r/TheMotte/comments/v053ii/smallscale_question_sunday_for_may_29_2022/iaigbp5/"
  },
  {
    "kind": "t1",
    "id": "iahrtmb",
    "author": "Difficult_Ad_3879",
    "score": 8,
    "createdUtc": 1653873901,
    "body": "Are there any games (of any sort, offline/online) without a clearly delineated win or loss? What is it about our psychology that we need a clear and indisputable boundary for the desired terminal state of behavior? It seems the more visual and “sensationally obvious” win the better: a ball going through a net, shooting a tin can and hearing its sound, touching a person in tag. And we get upset and taken out of the game when any ambiguity is present, eg tagging a person or “merely tagging their clothes”. If the game were just a measure of skill, such a small gap between tagging skin or clothes should not matter. Instead the win needs to be obvious and indisputable. You would think this could be because interpersonal competition is driving it, but that doesn’t explain all games: games against ourselves (reaching a time while running), and “stunt” games like throwing a basketball backwards blindfolded and trying to make it in the net. Getting 99.99% close to a stunt win is not 99.99% as pleasurable as victory, it’s sometimes even *less* pleasant than if you were never close.\n\nSo is it just some animalistic relic of satisfaction needing to have some sensory “on/off” switch, because this led to greater evolutionary fitness? In other words, the cat that leaps to catch a bird and is 99% close and feels reward may not have been as fit as the bird that only felt reward when 100% hitting. Because feeling reward when merely close to hitting is not as reinforcing as 100% hitting, in terms of hunting prowess. The cat that was rewarded for coming close may stick to that inferior strategy of hunting; the cat that is only rewarded for a clean catch will be rewarded more accurately than a close catch.",
    "permalink": "/r/TheMotte/comments/v053ii/smallscale_question_sunday_for_may_29_2022/iahrtmb/"
  },
  {
    "kind": "t1",
    "id": "iagd0l4",
    "author": "EdenicFaithful",
    "score": 6,
    "createdUtc": 1653848539,
    "body": "So, what are you reading?\n\nI'm picking up Levy's *Hackers*, frankly because I was curious about the strangely eastern touches of many cyberpunk styles one sees in film. Per the [Jargon File](http://www.catb.org/~esr/jargon/),\n\n&gt;...many hackers are influenced to varying degrees by Zen Buddhism or (less commonly) Taoism, and blend them easily with their 'native' religions. There is a definite strain of mystical, almost Gnostic sensibility that shows up even among those hackers not actively involved with neo-paganism, Discordianism, or Zen. Hacker folklore that pays homage to 'wizards' and speaks of incantations and demons has too much psychological truthfulness about it to be entirely a joke.",
    "permalink": "/r/TheMotte/comments/v053ii/smallscale_question_sunday_for_may_29_2022/iagd0l4/"
  },
  {
    "kind": "t1",
    "id": "iagctj8",
    "author": "ChrisPrattAlphaRaptr",
    "score": 5,
    "createdUtc": 1653848449,
    "body": "Are there any good Chinese social media sites that are accessible to people without a mainland Chinese phone number? Or does anyone have workarounds? I've tried Weibo and Wechat without luck so far. Ideally I'm looking for something like reddit, but I'll take whatever.",
    "permalink": "/r/TheMotte/comments/v053ii/smallscale_question_sunday_for_may_29_2022/iagctj8/"
  },
  {
    "kind": "t1",
    "id": "iafupkx",
    "author": "kitanohara",
    "score": 6,
    "createdUtc": 1653840265,
    "body": "What thought experiments shaped your thinking on population ethics?\n\nFrom \"Propositions Concerning Digital Minds and Society\" by Bostrom &amp; Shulman https://www.nickbostrom.com/propositions.pdf\n&gt; Performing two runs of the same program results in “twice as much” conscious experience as one run\n\nThis doesn't make sense to me, I'd be thankful if you fight me on this. If we assume substrate independence (as they do), what exactly might it mean for a conscious experience to be in identical copies?\n\nI have a intuition that if such copying is possible on the substrate level, this alone doesn't make the experience itself duplicate or multiply. And that this is true for any relevant definition of duplication I can think of, including those that matter morally. I also have an intuition that you can only start saying there's \"more than one\" conscious experience to the extent that instances become different from each other. No idea how to argue for something like this though, and also no idea how to integrate this with my other ethical intuitions...",
    "permalink": "/r/TheMotte/comments/v053ii/smallscale_question_sunday_for_may_29_2022/iafupkx/"
  },
  {
    "kind": "t1",
    "id": "iafnubu",
    "author": "NotATleilaxuGhola",
    "score": 11,
    "createdUtc": 1653837176,
    "body": "When do you think countries will drop vaccine requirements for travelers?  What about PCR tests.  AFAICT the public in most countries considers covid to be \"over\" and the international restrictions are still in place simply due to inertia.",
    "permalink": "/r/TheMotte/comments/v053ii/smallscale_question_sunday_for_may_29_2022/iafnubu/"
  },
  {
    "kind": "t1",
    "id": "iafgrus",
    "author": "Spectale",
    "score": 14,
    "createdUtc": 1653833869,
    "body": "Forgive me if this is a bit too silly for this forum, but is anyone else a bit... unnerved that the universe existed for billions of years before anything approaching conscious thought could perceive it? I wonder if it's at all related to my recent interest in panpsychism. There's almost something comforting knowing that even after the death of our universe, someone knew it was there. But if the laws of physics at the big bang were slightly different and life unable to form, it would eventually pass into nothingness and no one would know. There's something almost unsettling about that.",
    "permalink": "/r/TheMotte/comments/v053ii/smallscale_question_sunday_for_may_29_2022/iafgrus/"
  },
  {
    "kind": "t1",
    "id": "iaevkuz",
    "author": "Difficult_Ad_3879",
    "score": 10,
    "createdUtc": 1653820496,
    "body": "* Could mass shootings be the result of an expanded conformist state, where the individual confronts big “S” Society on a daily basis? So whereas in the past, men would commit interpersonal violence against other men in feuds or altercations or gang disputes, men now see an increasingly demanding society personified. This would be due to greater societal demands of conformity and obedience, centralized competition for mates, and reduced small male spaces. Could be, because I noticed China has as many mass school stabbings as we have shootings, relative to their default homicide rate.\n\n* Are we going to see an increase in the commodification of women in the coming decades? I’m noticing a new kind of shameless among young women on social media. Their primary obsession is showing their body in skimpy outfits (since common), but now there’s also complete acceptance of promiscuity, plus Onlyfans culture and reduced wages, and “legitimization” of whoredom (sex work). And then consider the science that will be published in coming decades about immune health and physical attractiveness. All of these combined could lead to a new culture where young women are virtually bought and sold; they advertise their body on social media, bidders pay for escort dates which are a euphemism.",
    "permalink": "/r/TheMotte/comments/v053ii/smallscale_question_sunday_for_may_29_2022/iaevkuz/"
  },
  {
    "kind": "t1",
    "id": "iaeo3hw",
    "author": "surpriseeggyolk",
    "score": 9,
    "createdUtc": 1653813733,
    "body": "I have a hard time understanding why many people seem to find golden-rule style arguments convincing. Basically why \"But what if everyone acted like that?\" should be a good rebuttal to anything. For one if everyone suddenly had (or at least expressed) the same preferences many aspects of our economy would stop functioning. Everyone loves pumpkins all of a sudden? Good look finding affordable pumpkins. This example is a little silly but I think you get my point, diversity of preferences isn't a bad thing.\n\n The other aspect is someone doing something \"bad\" like purchasing a ticket for a cheap flight when they could have used the train. This is causally linked to increased greenhouse gas emissions which is causally linked to more extreme weather events, rising ocean levels and so on. But would the decision to not buy the plane ticket cause one less storm? One less nanometer in sea level rise? All other things being equal this specific person´s decision does not matter at all in the grand scheme of things. It only matters if many people choose to change their lifestyle in some pretty dramatic ways. And so far there is very little evidence of that happening at sufficient scale. So why should anyone be obliged to be the first? Why is there a moral duty to do something that seems to only cause you discomfort with zero benefit (since not enough people are likely to join you). \n\nOf course this is frustrating and it is a kind of a catch-22. Because everyone thinks that not enough people will join few people make the first step, which causes the majority to think that not enough people will join and so on. But does that make the assessment on the individual level wrong? Can you derive a moral duty to act from this? I think you can argue that politicians have a duty to act on this but I really don't see why individuals with their (individually) low-impact choices should be compelled to do anything but act in their own self-interest.",
    "permalink": "/r/TheMotte/comments/v053ii/smallscale_question_sunday_for_may_29_2022/iaeo3hw/"
  }
]
