[
  {
    "kind": "t1",
    "id": "ijl6gb9",
    "author": "escherofescher",
    "score": 1,
    "createdUtc": 1660057439,
    "body": "Is there a modern continuation or critique to Popper's \"Open Society and Its Enemies\"?\n\nI've found his arguments strongly convincing. Even if I disregard the large part about historicism, the open/individual vs closed/collectivist model continue to make sense to me.\n\nI wonder if someone picked up his ideas and continued to develop them? Or if someone found flaws?\n\nI know Soros published some books in the same area (open society/capitalism reform).",
    "permalink": "/r/TheMotte/comments/wi8rc4/smallscale_question_sunday_for_august_07_2022/ijl6gb9/"
  },
  {
    "kind": "t1",
    "id": "ijiapob",
    "author": "Nerd_199",
    "score": 2,
    "createdUtc": 1660000758,
    "body": "I like to get better at discussing politics and  I like to learn the art of propaganda. Could I have some recommendations?",
    "permalink": "/r/TheMotte/comments/wi8rc4/smallscale_question_sunday_for_august_07_2022/ijiapob/"
  },
  {
    "kind": "t1",
    "id": "ijgttes",
    "author": "4bpp",
    "score": 6,
    "createdUtc": 1659979895,
    "body": "\"Cop faces\": to what extent are facial features actually predictive of personality? Do meaningful population substructures among, say, white Anglos exist that would correlate with something like authoritarian personality?\n\nI keep circling back to a certain pattern I seem to see, where a person famous for authoritarian or \"meddlesome violent pro-social\" behaviour turns out to have a facial features that register as similar in some relevant way according to my visual system. The behaviour they exhibit is always a certain palpable glee in public criticism, punishment and humiliation of perceived rule-breakers, especially as such rules are widely agreed upon by society. The cleanest example is the proprietor of [krebsonsecurity](https://krebsonsecurity.com/about/), who is a security blogger who moonlights in investigating random Eastern European credit card flippers and botnet operators and publishes their flailing as they get caught and apologetic letters they seem to send to him personally from jail. Next exhibit is [Mark Rober](https://www.youtube.com/channel/UCY1kMZp36IQSyNx_9h4mpCg), a Youtuber who started out in generic DIY tinkering but then pivoted to overengineered revenge plots against package thieves and online scammers. [Matthew Green](https://isi.jhu.edu/~mgreen/) is a cryptographer recently in the news for attacking another cryptographer for suing the NIST for not releasing details on NSA meddling in the post-quantum cryptography standardisation process (so basically carrying water for the NSA), but he seems to be at the outer edges of the (visual) category to me. [John McCain](https://en.wikipedia.org/wiki/John_McCain) was a famous person whose face is closer to a central example, but I don't know enough about the man beyond him having being a seemingly very principled and rule-bound Republican. On top of that, I seem to see the average of these faces in an endless array of movie FBI agents and real-life US border control. \n\nDoes anyone else see the commonalities there, or is it just me? How plausible is it for a pattern like this to exist, and how specific would it be? Am I just seeing something quite general like Moldbug's Optimates or the distinguishing features one of the tribes of Albion's Seed, whose ethos and appearance both are stark to me by virtue of being culturally foreign? Could it be a narrower (hitherto unidentified, but perhaps actually sufficiently endogamous to maintain itself) genetically identifiable subgroup (of Anglo-Americans) with distinct temperament, or could there perhaps even be an almost inextricable facial correlate of certain personality traits every time selection pops them out, in the same way in which canids get [domestication syndrome](https://en.wikipedia.org/wiki/Domestication_syndrome)?",
    "permalink": "/r/TheMotte/comments/wi8rc4/smallscale_question_sunday_for_august_07_2022/ijgttes/"
  },
  {
    "kind": "t1",
    "id": "ijf8o56",
    "author": "slider5876",
    "score": 10,
    "createdUtc": 1659953125,
    "body": "Two random flight questions.  Since they always try to get more money out of you.\n\n1.  Does anyone pay the $25-50 to get a more forward seat on a plane?  I was on a plane with no middle seat - 2 seats on each sides.  I can understand paying for not middle seat but whose shelling out cash for the same seat 10-15 rows closer to front.\n\n2.  Also noticed a pop up to board early for like $22.  Who pays that?  Personally I generally board last to minimize time inside plane.\n\nIs there something I’m missing where these items are heavily valued?",
    "permalink": "/r/TheMotte/comments/wi8rc4/smallscale_question_sunday_for_august_07_2022/ijf8o56/"
  },
  {
    "kind": "t1",
    "id": "ijeczy5",
    "author": "cjet79",
    "score": 10,
    "createdUtc": 1659930189,
    "body": "How do you become a better writer?\n\nI'm thinking the main step (which I am going to do) is just start writing more stuff. But tactical advice would be appreciated.\n\nI think I specifically want to be a better writer in three areas:\n\n1. Sharing personal stories. This writing will mostly be used to speak with friends and family. Possibly as a diary. Possibly as a dream journal (I have lots of weird dreams, and I think I should start mining some of them for story ideas).\n2. Writing fictional stories. I use to write a story in the past. I maybe burned out, or just lost my passion. But at the time I didn't feel very skilled at it, I'd like to be better if the passion ever takes me again.\n3. Op-ed style writing. Things that can be posted as articles and shared online. I'd like them to be interesting, engaging, factual, and hopefully convincing.",
    "permalink": "/r/TheMotte/comments/wi8rc4/smallscale_question_sunday_for_august_07_2022/ijeczy5/"
  },
  {
    "kind": "t1",
    "id": "ije6sxe",
    "author": "Nerd_199",
    "score": 8,
    "createdUtc": 1659926950,
    "body": "What your thoughts on Hacker news and arc technica. I plan on entering their forums since their have nerd based interest and I am honestly sick of reddit in general.",
    "permalink": "/r/TheMotte/comments/wi8rc4/smallscale_question_sunday_for_august_07_2022/ije6sxe/"
  },
  {
    "kind": "t1",
    "id": "ijdo5fs",
    "author": "Navalgazer420XX",
    "score": 7,
    "createdUtc": 1659917995,
    "body": "So I spent the weekend augering a few test wells around the property, 10 to 25 ft. Found a nice band of gravel &amp; sand at 18 ft in one conveniently close to where I need it. If it goes down a good 10 ft I'm probably set.  \nI have no experience with solar, and wondered if any of our trad homesteaders had any advice about a solar pump setup for irrigation (although it seems like a lot of those guys stopped posting or left for CWR/DSL?)\n\nAm still working out how much water I really need for for the 3 rainless months, and whether a storage pond or ~1gpm shallow well feeding into a smaller tank uphill would be better.",
    "permalink": "/r/TheMotte/comments/wi8rc4/smallscale_question_sunday_for_august_07_2022/ijdo5fs/"
  },
  {
    "kind": "t1",
    "id": "ijdkhcy",
    "author": "bulksalty",
    "score": 2,
    "createdUtc": 1659916256,
    "body": "Two cooking questions:\n\n1.  I like to fry my egg in bacon grease, but the bacon cools while the egg cooks.  Anyone have a good way to keep the bacon warm without getting soggy?\n\n2.  Why do fatty hamburger patties not shrink when you make a thumb indentation in them?",
    "permalink": "/r/TheMotte/comments/wi8rc4/smallscale_question_sunday_for_august_07_2022/ijdkhcy/"
  },
  {
    "kind": "t1",
    "id": "ijdanim",
    "author": "RadicalizeMeCaptain",
    "score": 6,
    "createdUtc": 1659911818,
    "body": "How did Alex Jones get found guilty of libel if he already recanted his views and apologized?",
    "permalink": "/r/TheMotte/comments/wi8rc4/smallscale_question_sunday_for_august_07_2022/ijdanim/"
  },
  {
    "kind": "t1",
    "id": "ijcs2zm",
    "author": "CanIHaveASong",
    "score": 6,
    "createdUtc": 1659904159,
    "body": "Does anybody know if Ame_Damne (not sure of spelling) is still active on reddit?  I have something I think she may like.  PM me if you know how I can get in touch with her.",
    "permalink": "/r/TheMotte/comments/wi8rc4/smallscale_question_sunday_for_august_07_2022/ijcs2zm/"
  },
  {
    "kind": "t1",
    "id": "ijcnrj9",
    "author": "MetroTrumper",
    "score": 17,
    "createdUtc": 1659902375,
    "body": "Something I get curious about - I wonder how many actual physical people there are in the world who really know how to perform certain super-specialized technical tasks that are essential for modern civilization. Like how many people are there who can design and manufacture a modern turbine engine? How many can design, construct, and operate a modern IC fab? Or manufacture new high-precision machine tools from scratch, or design and manufacture a really great truck engine, or any number of other fields I don't even know about.",
    "permalink": "/r/TheMotte/comments/wi8rc4/smallscale_question_sunday_for_august_07_2022/ijcnrj9/"
  },
  {
    "kind": "t1",
    "id": "ijcht7i",
    "author": "EdenicFaithful",
    "score": 10,
    "createdUtc": 1659899922,
    "body": "So, what are you reading?\n\nI'm reading Albert Ellis' *Reason And Emotion In Psychotherapy*, at least for now. Not sure if I'm interested enough, but he was a pioneer in cognitive therapies. So far he seems to have added a layer on top of behavioural conditioning, where the words that people use to \"self-indoctrinate\" themselves function as a reward/punishment mechanism. So even if you use Freudian analysis to reveal the roots of someone's problems, you still have to deal with the mechanism by which those problems are reinforced. He argues that these self-indoctrinating words often hide irrational premises, which, when noticed and challenged, leads to improvement.\n\nTo be honest, the simplicity of the model (I suppose it will get more complex) raises an eyebrow, but perhaps I'll learn something useful. It is true enough that kneading one's resentments like dough is a questionable use of time that often goes unchecked.",
    "permalink": "/r/TheMotte/comments/wi8rc4/smallscale_question_sunday_for_august_07_2022/ijcht7i/"
  },
  {
    "kind": "t1",
    "id": "ijby81g",
    "author": "Difficult_Ad_3879",
    "score": 5,
    "createdUtc": 1659891940,
    "body": "Do you know of anything beyond peppers which gives short intense pain without any actual damage? Anything consumable. The only thing I can think of are peppers, or like a lot of ginger and garlic.",
    "permalink": "/r/TheMotte/comments/wi8rc4/smallscale_question_sunday_for_august_07_2022/ijby81g/"
  },
  {
    "kind": "t1",
    "id": "ijblsnk",
    "author": "LacklustreFriend",
    "score": 27,
    "createdUtc": 1659886836,
    "body": "To engage in a not-serious thought experiment (please don't take this too seriously, it's only for fun, not an actual proposal):\n\n**What if we just banned advertising?**\n\nWith obvious certain exemptions for public service announcements and the like, but no advertising generally for commercial products was allowed. People would be able to seek out information on products and services (via catalogues, websites etc), but this cannot be integrated into media not explicitly meant for that purpose.\n\nThe US advertising industry alone is worth almost US$300 billion. That $300 billion has an opportunity cost - that is theoretically $300 billion of labor, resources etc that could be spent something else to benefit society as a whole. While advertising may generate economic value to an individual or a company competing against others, it doesn't generate *wealth* for the economy as a whole. Advertising isn't producing a good or service that materially benefits society. It may be the case that the advertising industry is a leech on the economy as a whole, sucking away productivity that could be better spent elsewhere.\n\n\nAdvertising has often been described as a Prisoner's Dilemma. Companies constantly spend more and more on marketing and advertising to keep ahead of their competition, and there maybe be a tipping point where the money spent on advertising exceeds gains and all parties would have been better off if no one spend money on advertising in the first place. Of course, one of the ways to solve the Prisoner's Dilemma is to have an external agent force compliance and avoid defection. In this case, the government. \n\nOf course, there are some counter arguments:\n\n1. While advertising doesn't generate wealth itself, it can assist in generating wealth by making people want things (consumerism). When people want things, they will engage in economic activity to acquire said things. This extra economic activity is a net good, and (arguably) leads to innovation and invention. There is a quote I can't quite remember that exactly - \"Advertising is the lifeblood of the economy\". The counter-counter argument to this is a consumerist economy is not a good thing in the first place, and people should be driven by their 'organic' needs and wants rather than what advertising has told them they should want or need. i.e. standard anti-consumerism argument. Additionally, advertising might cause people to engaging in behavior that causes actual harm, with the most poignant example that pharmaceutical advertising may play significant role in the opioid crisis, overmedication of kids etc. The obesity epidemic being fueled by junk/fast food advertising might be another example.\n\n2. Advertising provides a source of funding for industries and institutions that couldn't otherwise exist without it. Journalism, entertainment media, some forms of art, sports might be some examples of this, where a significant part of there revenue is generated from advertising that they couldn't exist without, and we think these things are a net good. The counter-counter argument is that many of those things can exist via alternative (or original!) revenue models (e.g. charging more for a newspaper, ticket sales), and in fact advertising has resulted in perverse incentives that have corrupted those industries and institutions, e.g. advertising in journalism has incentivized clickbait and outrage rather than investigative, 'real' journalism, which causes harm to society, which is a net negative.\n\n3. The advertising industry does provide a benefit by providing insights into human psychology and communication that has benefits for society elsewhere (the same way NASA/the space race provided inventions and innovations that could be adapted to benefit the public, but on a psychological level). The counter-counter argument is that this is hard to quantify, doesn't fully address the issue of opportunity cost, only lessens its impact, and it might actually be a net moral negative as it allows the powers that be to engage in social manipulation and engineering we don't like.",
    "permalink": "/r/TheMotte/comments/wi8rc4/smallscale_question_sunday_for_august_07_2022/ijblsnk/"
  },
  {
    "kind": "t1",
    "id": "ijbl7th",
    "author": "f3zinker",
    "score": 7,
    "createdUtc": 1659886590,
    "body": "This is probably suited better for the Wednesday thread but I'll post anyways because its been bothering me a lot lately. \n\nLately I have been getting a lot of disturbing imagery in my head. Randomly pop up and ruin my mood. Now the part worth noting here is that its not disturbing in the traditional sense; gore, etc.. But in a more metaphysical/psychological sense. To put it shortly similar to how the main character in Crime and Punishment felt. \n\nFor example. Lets say I didn't treat a person the most kindly. Or lost my temper, or acted along those lines. The following weeks. I will get imagery of that person mutilated in a car accident. Or withering away in a hospital bed, or something of the sort. \n\nNow as far as the average person is concerned. I am quite calm and patient. I rarely ever lose my temper, or treat people badly, intentionally. So I really don't know why would my subconscious feel guilt or whatever else. Because I consciously hold myself to what I consider very high standards of interpersonal behavior. \n\nI have meditated on this and come to the conclusion that I will take the burden of being the most calm, the most patient and not bring any harm to anyone even if that means going through great discomfort myself. Not bring any further pain to the world. To rid myself of the \"evil spirit\" or pay any debt *metaphorical* debt I have.\n\nBut I really don't understand what could be the reason for this. I am not too fond on psychoanalysis, but I would be open to some bullshit story that at least explains away some of this.",
    "permalink": "/r/TheMotte/comments/wi8rc4/smallscale_question_sunday_for_august_07_2022/ijbl7th/"
  },
  {
    "kind": "t1",
    "id": "ijbgebk",
    "author": "zoink",
    "score": 23,
    "createdUtc": 1659884539,
    "body": "I visited every Scandinavian country last month and would go out to at least one nice restaurant in each capital. Multiple (three or four) times we were asked if we had a reservation which we didn't (we were winging the whole trip). The host would then get in a huff, say they needed to check if they could squeeze us in, then reluctantly seat us. We'd have our dinner and the restaurant never got above 50% full. Only time I get that in the US is when I walked in to an obviously slammed place or 30 min. before the rush and it's obvious it's going to fill up. Is this an actual thing or did I just get some selection bias?",
    "permalink": "/r/TheMotte/comments/wi8rc4/smallscale_question_sunday_for_august_07_2022/ijbgebk/"
  },
  {
    "kind": "t1",
    "id": "ijbc7lo",
    "author": "Gorf__",
    "score": 12,
    "createdUtc": 1659882711,
    "body": "I just finished _Caliban’s War_, the second book in the Expanse series. I liked it even more than the first one. Any book recommendations for when I finish the series? I like the characters, the near-future-ish tech, and the gritty and lighthearted space opera style. I liked the second book’s political narrative too. The horror stuff is just background to me, I could take it or leave it. \n\nI also love _Dune_. Otherwise I’m pretty new to the sci-fi genre.",
    "permalink": "/r/TheMotte/comments/wi8rc4/smallscale_question_sunday_for_august_07_2022/ijbc7lo/"
  },
  {
    "kind": "t1",
    "id": "ijb74ak",
    "author": "Mantergeistmann",
    "score": 11,
    "createdUtc": 1659880369,
    "body": "I recall reading once that one of the tenets/principles/demands of Italian fascism was specifically better care for the elderly alongside a bunch of other social issues, but my Google-fu seems to be failing me. Am I tripping?",
    "permalink": "/r/TheMotte/comments/wi8rc4/smallscale_question_sunday_for_august_07_2022/ijb74ak/"
  },
  {
    "kind": "t1",
    "id": "ijax4mr",
    "author": "omfalos",
    "score": 11,
    "createdUtc": 1659875026,
    "body": "Why was the Reign of Terror so fiercely anticlerical?",
    "permalink": "/r/TheMotte/comments/wi8rc4/smallscale_question_sunday_for_august_07_2022/ijax4mr/"
  },
  {
    "kind": "t1",
    "id": "ijawrty",
    "author": "nevertheminder",
    "score": 6,
    "createdUtc": 1659874807,
    "body": "Do you subscribe to any news media?  Do you subscribe to any substacks?\n\nI have an NYT and local newspaper subscription. I read some sub stack articles on occasion, but I don’t subscribe or pay money for them.",
    "permalink": "/r/TheMotte/comments/wi8rc4/smallscale_question_sunday_for_august_07_2022/ijawrty/"
  },
  {
    "kind": "t1",
    "id": "ijahxqy",
    "author": "SolarSurfer7",
    "score": 6,
    "createdUtc": 1659863390,
    "body": "How often do you see your parents? I see mine once every two weeks. (31M)",
    "permalink": "/r/TheMotte/comments/wi8rc4/smallscale_question_sunday_for_august_07_2022/ijahxqy/"
  }
]
