[
  {
    "kind": "t1",
    "id": "ifp0lwd",
    "author": "RadicalizeMeCaptain",
    "score": 1,
    "createdUtc": 1657522896,
    "body": "According to [this graph ](https://nitter.net/QuarantinedCoof/status/1546185145698353154#m), Biden's approval rating took a big dip after the Afghanistan pullout. Why? I thought people generally wanted the US to pull out.",
    "permalink": "/r/TheMotte/comments/vvl5yv/smallscale_question_sunday_for_july_10_2022/ifp0lwd/"
  },
  {
    "kind": "t1",
    "id": "ifnth1f",
    "author": "Ilforte",
    "score": 1,
    "createdUtc": 1657498605,
    "body": "What happens to thinking people who are clearly wrong but [whose heads haven't exploded](https://www.ted.com/talks/dan_dennett_the_illusion_of_consciousness?language=en)? \n\nThe (imo) stupid adage that science advances one funeral at a time is so old that I think it has finally [overstayed its welcome](https://rootsofprogress.org/how-curing-aging-could-help-progress) and, with any luck, we'll bid it final goodbyes soon enough. \n\nYes sometimes, often even, it is right on the money. There are walking scholarly zombies all around: people who've bet it all on a hypothesis, have been publicly and convincingly proven wrong (or had the ground move under them to the point their entire map became obsolete) and have not recanted. Indeed, some double down or just begin to ignore all criticism. \n\nWhat do we know about such cases and such people? Are they just cognitively rigid and emotionally invested? Bound like slaves to a cottage factory that has been built around their assumptions, perhaps? Does the stress of debunking alter their reasoning somehow, degrade it maybe? How does it feel from the inside? I've seen some curious patterns, but don't want to bias you. \n\nThe easy recent example: Hofstadter and GPT-3, see [Scott's 53rd point](https://astralcodexten.substack.com/p/links-for-june-1e7) and [my comment](https://www.reddit.com/r/TheMotte/comments/vp23id/quality_contributions_report_for_june_2022/iej8xel/).  \n\nWhat are your examples? And if you know any more systematic sources: I'd be much obliged. Sounds like something Lesswrong ought to have done a lot of work on.",
    "permalink": "/r/TheMotte/comments/vvl5yv/smallscale_question_sunday_for_july_10_2022/ifnth1f/"
  },
  {
    "kind": "t1",
    "id": "ifnimbw",
    "author": "eBenTrovato",
    "score": 1,
    "createdUtc": 1657493445,
    "body": "What is it about the rhetorical use of “right?” **as a vocal tic** in conversation that causes the majorly negative reaction in me as the listener? Is it the false invitation for debate? The presumption of agreement? The narcissistic self-affirmation of the speaker?\n\nEdited for clarification.",
    "permalink": "/r/TheMotte/comments/vvl5yv/smallscale_question_sunday_for_july_10_2022/ifnimbw/"
  },
  {
    "kind": "t1",
    "id": "ifmdv53",
    "author": "jacksonjules",
    "score": 1,
    "createdUtc": 1657475715,
    "body": "Anyone know what happened to [A New Radical Centrism](https://web.archive.org/web/20220420073405/https://twitter.com/a_centrism)? (Posted an old archive link for clarity about who they are).\n\nI assume they got banned for breaking Twitter's content rules on race and trans stuff. Do they have a new landing site?",
    "permalink": "/r/TheMotte/comments/vvl5yv/smallscale_question_sunday_for_july_10_2022/ifmdv53/"
  },
  {
    "kind": "t1",
    "id": "ifm9qxr",
    "author": "EdenicFaithful",
    "score": 1,
    "createdUtc": 1657473948,
    "body": "So, what are you reading?\n\nI'm reading Schwab's *The Fourth Industrial Revolution*. I've only heard of him filtered through anti-lockdown perspectives, but I admit that I find it hard to hate someone who dresses, as they say, like a Bond villain.",
    "permalink": "/r/TheMotte/comments/vvl5yv/smallscale_question_sunday_for_july_10_2022/ifm9qxr/"
  },
  {
    "kind": "t1",
    "id": "ifm3k67",
    "author": "Capital_Room",
    "score": 1,
    "createdUtc": 1657471314,
    "body": "When one is a useless, defective parasite upon the body public, who provides nothing, contributes nothing, does nothing meaningful, and who (socially speaking) already practically doesn't exist, why should one bother suffering through 30+ years of increasing misery and futility, rather than just skipping to the inevitable conclusion now?",
    "permalink": "/r/TheMotte/comments/vvl5yv/smallscale_question_sunday_for_july_10_2022/ifm3k67/"
  },
  {
    "kind": "t1",
    "id": "iflhxov",
    "author": "ShouldHaveVotedGore",
    "score": 8,
    "createdUtc": 1657461851,
    "body": "It appears I'm going to acquire a decent sum of money soon. Nothing too crazy but more than I'd be comfortable with just sitting around in a checking account. How would you suggest \"storing\" it? Mutual funds? Multiple approaches to \"diversify\" against single point of failure?",
    "permalink": "/r/TheMotte/comments/vvl5yv/smallscale_question_sunday_for_july_10_2022/iflhxov/"
  },
  {
    "kind": "t1",
    "id": "iflcie0",
    "author": "NotATleilaxuGhola",
    "score": 11,
    "createdUtc": 1657459130,
    "body": "What podcasts are you into these days?  CW stuff is good, but I'm open to anything that goes deep.\n  \nOnly thing I can't tolerate is excessive bantering and bullshit, I don't like feeling like a stranger listening in on a bunch of bros cracking inside jokes.",
    "permalink": "/r/TheMotte/comments/vvl5yv/smallscale_question_sunday_for_july_10_2022/iflcie0/"
  },
  {
    "kind": "t1",
    "id": "iflb2gs",
    "author": "Difficult_Ad_3879",
    "score": 2,
    "createdUtc": 1657458350,
    "body": "Did Christianity produce a “domesticating” effect in Europeans?\n\nI was reading about that [Russian fox experiment](https://en.m.wikipedia.org/wiki/Domesticated_silver_fox). Domesticated traits started to occur only after the second generation. After six generations you had a few hyper-domesticated foxes and by the 20th generation 30% of foxes constituted this hyper-domesticated status. \n\nThe Christian social system appears especially conducive to domestication.  Only those with especially prosocial tendencies will get the most out of services; those with especially “domesticated” qualities will be graded best by peers according to the Christian rubric of grading another’s behavior; greater voluntary activity within the church would draw in the especially prosocial, creating prosocial pairings similar to in the Fox experiment. Those who best internalized the behavioral proscriptions of the Church had the highest status, and this obedience is a kind of domestication. Traits like intelligence, humor, and athleticism have no real value in the historically Christian social system, although a minimum amount of intelligence was probably necessary to secure a mate.\n\nCompare to what (little) we know about Paganism. Paganism had no such fixation on domesticated qualities.",
    "permalink": "/r/TheMotte/comments/vvl5yv/smallscale_question_sunday_for_july_10_2022/iflb2gs/"
  },
  {
    "kind": "t1",
    "id": "ifkwy7m",
    "author": "2cimarafa",
    "score": 16,
    "createdUtc": 1657448489,
    "body": "Are some smart people just naturally gullible? My boyfriend is extremely gullible. Sometimes he'll send me instagram posts of literal fake news (not really partisan, more like tabloid-esque 'the Queen has cancer and 30 days to live' headlines, or 'PROOF Rishi Sunak responsible for taking Partygate photos', ie., things that are plausible but also functionally made-up by the post); he sometimes struggles to tell whether some mockumentaries are fictional until 10-15 minutes in. Objectively he's very intelligent according to widely held IQ proxies, test scores, grades, his job and so on. But I'm sometimes stunned at his lack of scepticism, I'm actually very worried that one day someone could trick him into a stupid investment or into being mugged by leading him into an alleyway under false pretences or something. \n\nDo you know people like this (maybe you're together with one)? Is there a solution or do I just have to live with this concern?",
    "permalink": "/r/TheMotte/comments/vvl5yv/smallscale_question_sunday_for_july_10_2022/ifkwy7m/"
  }
]
