[
  {
    "kind": "t1",
    "id": "ij92y58",
    "author": "qpworitu",
    "score": 3,
    "createdUtc": 1659832173,
    "body": "What does the motte do for work? I dropped out of a software engineering degree after a couple internships taught me that desk jobs make me want to suck start a shotgun, finished a degree in Business Admin to have something, and now I'm a bit lost. Now I'm 25 and floating around retail. I enjoy the physical labor and enforced socialization with customers, but I'm trying to map out a plan for an actual career where I can make money that isn't just above poverty level and get weekends off.\n\nBroadly, I like physical work and interacting with people, but have a difficult time doing things I find pointless or immoral and can't tolerate the heat very well. I'd prefer to avoid further education except as a last resort.\n\nAny tips?",
    "permalink": "/r/TheMotte/comments/weyt58/wellness_wednesday_for_august_03_2022/ij92y58/"
  },
  {
    "kind": "t1",
    "id": "iix1zxm",
    "author": "ItsAPomeloParty",
    "score": 5,
    "createdUtc": 1659622178,
    "body": "Anybody got a remedy for the daily diarrhea that lasts about a week after a night of drinking when you're middle aged?\n\nI mean I know the answer is don't drink, but suppose the deed is done.\n\nDrank for the first time in months recently. Hangover was bearable, about what you'd expect from one. But the real drag was for a while afterward every single day was diarrhea. Intestines are not a fan of the whole drinking thing. For that and other reasons I do not plan on doing this very often at all--but any helpful tips to keep in mind would be appreciated.",
    "permalink": "/r/TheMotte/comments/weyt58/wellness_wednesday_for_august_03_2022/iix1zxm/"
  },
  {
    "kind": "t1",
    "id": "iivbqf8",
    "author": "JhanicManifold",
    "score": 27,
    "createdUtc": 1659583045,
    "body": "Well, today I made the gigantic mistake of trying to play devil's advocate in an abortion debate with a smart left-leaning guy. The lack of norms surrounding steelmanning, the intellectual turing test and not holding your position too emotionally just made the whole thing unbelievably frustrating. The guy was pathologically unable to understand that his ideological opponents didn't have evil motives, but that they were normal, well-meaning people just like him. \n\nIn finding the last few islands of good reasoning remaining on the internet, I might have forgotten how people (even smart ones) debate in the wild. I think no left-leaning person is ever really exposed to coherent right-wing arguments, and even when couched in a \"I'm just playing devil's advocate\" frame, it still elicits frustration and anger in them. Lesson learned: don't ever debate anything political or religious unless you have reason to think that the person is one of the vanishingly few who can do that without frustration.",
    "permalink": "/r/TheMotte/comments/weyt58/wellness_wednesday_for_august_03_2022/iivbqf8/"
  },
  {
    "kind": "t1",
    "id": "iiti1r4",
    "author": "wear146",
    "score": 6,
    "createdUtc": 1659553752,
    "body": "I have a seven hour flight tomorrow, can anyone recommend any iPhone/iPad games or books (I like to read fairly light weight things when I travel, something like The Butchers Boy would be my Goto sort of novel)",
    "permalink": "/r/TheMotte/comments/weyt58/wellness_wednesday_for_august_03_2022/iiti1r4/"
  },
  {
    "kind": "t1",
    "id": "iitfiat",
    "author": "disposablehead001",
    "score": 4,
    "createdUtc": 1659552715,
    "body": "Any recommendations for bidets?",
    "permalink": "/r/TheMotte/comments/weyt58/wellness_wednesday_for_august_03_2022/iitfiat/"
  },
  {
    "kind": "t1",
    "id": "iite1ng",
    "author": "PM_ME_UR_OBSIDIAN",
    "score": 2,
    "createdUtc": 1659552125,
    "body": "How do you keep an indoor cat stimulated/entertained?",
    "permalink": "/r/TheMotte/comments/weyt58/wellness_wednesday_for_august_03_2022/iite1ng/"
  },
  {
    "kind": "t1",
    "id": "iit0kaw",
    "author": "punishedmicah",
    "score": 7,
    "createdUtc": 1659546802,
    "body": "I'm moving across the country next week to a small city in the middle of the mountain west. It has a college and is a (very) regional economic hub, but certainly ain't a social powerhouse.\n\nAny advice for meeting people in their early-mid 20s? I know basically nobody there.",
    "permalink": "/r/TheMotte/comments/weyt58/wellness_wednesday_for_august_03_2022/iit0kaw/"
  },
  {
    "kind": "t1",
    "id": "iirygg2",
    "author": "practical_romantic",
    "score": 8,
    "createdUtc": 1659531430,
    "body": "I caught a severe infection my toe which stopped me from working out. I had been consistent for two weeks and on the last day pulled 60 kgs for 3 sets of 4 reps at a bodyweight of 68. That is some progress.\n\nMy life is still in shambles, time management issues, adhd, just the general inability to stick long term but I did have some progress, I did 10 hours (first 10 videos are longer on average for this 120 video playlist) of the [DSA Playlist for my job interviews](https://www.youtube.com/playlist?list=PLDzeHZWIZsTryvtXdMr6rPh4IDexB5NIA).\n\nI took me a month to do it and that was all due to me simply not changing my ways, This is still much much better than 0 which is all I have done since beginning college and I do feel good in having made some progress. My aim is to do all 120 plus videos by the end of the month so that I can get a job I desire.\n\nAction leads to more action......Excuses lead to more excuses.Both have their own momentum.- RSD Tyler\n\nI cannot thank this place enough for being rude to me at times and pointing out that I was posting fluff and not actual progress. Here is a little bit of it, not a lot, not good but still a whole lot more than I likely would have done given my track record.\n\nI aim to pull close to 100 kgs and finish the entire playlist by next month, hopefully have a job in hand too. I am in my final year of uni and my uni has firms visit us for jobs so am doing this just for that. Leetcode hard enough and you will get a job.\n\nMy low CGPA (6.79/10) is an issue so shall try to bump it up to 7 or above this year and get back to my NLP internship hopefully.\n\nAlso my stupid decisions did have their consequences and my brother is paying for it. My parents enrolled him into a third tier BCA(bachelors' of computer applications, A bachelors degree in Computers that is laughed at by everyone for being a meme degree only taken by losers) at a local uni here in my hometown citing my own academic failures as they are extremely worried that if my brother performs like me, they can only get him to pass here and not outside at a better uni. I feel really bad. I am responsible for making the life of my entire family worse and likely permanently.",
    "permalink": "/r/TheMotte/comments/weyt58/wellness_wednesday_for_august_03_2022/iirygg2/"
  }
]
