[
  {
    "kind": "t1",
    "id": "ih1pz9v",
    "author": "Navalgazer420XX",
    "score": 1,
    "createdUtc": 1658409921,
    "body": "Are salt intake guidelines too low? (Am I getting enough salt?)\n\nThe FDA recommends eating less than a teaspoon of salt per day, while animals our size generally eat a quarter to a third of an oz per day.  \nI don't eat any processed food, so the only salt I get is on meat and fried eggs. Have been developing salt cravings this summer to the point that livestock mineral salt looks really delicious, which is a pretty reliable sign I'm missing _something_.   \nEverything out there is just yelling at people not to eat salt, but maybe someone here has done some proper research?\n\nBonus question: other than a costco multivitamin, what's a good extra source of zinc and other useful minerals?",
    "permalink": "/r/TheMotte/comments/w3f00s/wellness_wednesday_for_july_20_2022/ih1pz9v/"
  },
  {
    "kind": "t1",
    "id": "ih1erlm",
    "author": "Anouleth",
    "score": 1,
    "createdUtc": 1658404308,
    "body": "Another month, another post about relentless negative thoughts. Mostly surrounding the gym, my lack of progress, and generally feeling weak, lazy, fat, etc. Weight gain has unfortunately mostly stalled, due to working a physically demanding job with few opportunities to eat... but difficult to escape the belief that any weight gained wouldn't just be fat anyway. Have started running again with a friend (who has serious problems controlling his weight). I tend to get awful soreness/tightness in my shins, but seems to be getting less bad. Another friend has returned to the gym with me too, which is nice, except that it's because he broke up with his girlfriend, so it feels a little bit wrong to take pleasure from a bad event like that.",
    "permalink": "/r/TheMotte/comments/w3f00s/wellness_wednesday_for_july_20_2022/ih1erlm/"
  },
  {
    "kind": "t1",
    "id": "igz1v8u",
    "author": "Atersed",
    "score": 8,
    "createdUtc": 1658354887,
    "body": "Herman Miller chairs - expensive meme or ergonomic dream?",
    "permalink": "/r/TheMotte/comments/w3f00s/wellness_wednesday_for_july_20_2022/igz1v8u/"
  },
  {
    "kind": "t1",
    "id": "igyyi6u",
    "author": "Gorf__",
    "score": 15,
    "createdUtc": 1658353382,
    "body": "I quit drinking and vaping.\n\nAccording to Fitbit my resting heart rate is already 10bpm lower, and my HRV is 20ms+ higher.\n\nI’ve tried to quit numerous times but I think this is the actual time. I’m just tired of feeling like dog shit most of the time. I’m tired and haven’t been exercising like I used to.\n\nVaping was always dumb, I don’t even want that in my life. But I can’t resist it when I’m drunk, and I’m always around it, so I ended up just doing it by default.\n\nAlcohol is mostly just nice because it’s weird to not drink, at least in my friend group. So it’s just avoiding that whole awkwardness. But, it does seem like it’s getting more common to encounter people who don’t drink. Maybe that’s just because I’m getting older. In any case, I’m starting to give less of a fuck about that. Just let me live my life, I don’t need to put garbage in my body just to make you feel better.",
    "permalink": "/r/TheMotte/comments/w3f00s/wellness_wednesday_for_july_20_2022/igyyi6u/"
  },
  {
    "kind": "t1",
    "id": "igym84d",
    "author": "wmil",
    "score": 6,
    "createdUtc": 1658348120,
    "body": "Any advice for joint issues? I have some chronic ankle problems that my doctor brushes aside. \n\nI'm just curious what has worked for people.",
    "permalink": "/r/TheMotte/comments/w3f00s/wellness_wednesday_for_july_20_2022/igym84d/"
  },
  {
    "kind": "t1",
    "id": "igx4h21",
    "author": "QuantumFreakonomics",
    "score": 18,
    "createdUtc": 1658326812,
    "body": "Is the main point of a therapist to pay someone for the emotional labor of listening to you rant about your problems, nod along, and then provide comforting but non-falsifiable advice? I’ve been skeptical of trying one because I have serious doubts they would help actually solve the problems I have, but lately the closest thing I have to friends have been getting fired of putting up with my needy self-pitying bullshit (frankly I can’t blame them).",
    "permalink": "/r/TheMotte/comments/w3f00s/wellness_wednesday_for_july_20_2022/igx4h21/"
  }
]
