[
  {
    "kind": "t1",
    "id": "iml50cu",
    "author": "ebrso",
    "score": 1,
    "createdUtc": 1661986675,
    "body": "My younger brother died suddenly in his sleep earlier today.  He had a heart condition, but this was totally unexpected.  He was in his early 30s.  I had spoken to him on Sunday.  I only found out a few hours ago.  My parents are devastated.  I'm not sure why I'm posting this.  How do people go on after this?",
    "permalink": "/r/TheMotte/comments/x261n8/wellness_wednesday_for_august_31_2022/iml50cu/"
  },
  {
    "kind": "t1",
    "id": "imkfe12",
    "author": "[deleted]",
    "score": 1,
    "createdUtc": 1661976531,
    "body": "[deleted]",
    "permalink": "/r/TheMotte/comments/x261n8/wellness_wednesday_for_august_31_2022/imkfe12/"
  },
  {
    "kind": "t1",
    "id": "imjr65j",
    "author": "PM_ME_UR_OBSIDIAN",
    "score": 1,
    "createdUtc": 1661967344,
    "body": "I'm looking for a really good personal organizer, ideally a combination calendar and task list. As of today I am using Google Calendar combined with Todoist.\n\nTodoist caveats:\n\n- No tracking of start date, only due date. Any task with a date configured is assumed to be a discrete amount of work to be done on the day that it is due, or shortly before.\n- There is no concept of prioritization within a time window. I can't ask \"what is the most urgent task that I need to get done within two weeks?\" \n- If I have a daily recurring task and I mark it as done for yesterday, then the next occurence is tomorrow. There is no concept of catching up on overdue engagements.\n\nThe app is swell though.",
    "permalink": "/r/TheMotte/comments/x261n8/wellness_wednesday_for_august_31_2022/imjr65j/"
  },
  {
    "kind": "t1",
    "id": "imixmzt",
    "author": "GeorgeMacDonald",
    "score": 1,
    "createdUtc": 1661955919,
    "body": "Someone on here recommended the podcast The Drive by Peter Attia. I started listening to it and it is a great podcast! I don’t know too much about the science of health besides the very basics so this is pretty cool. \n\nWhat episodes do you all recommend? I listened to the skin care episode (forgot which one that was). The upshot was use sunscreen daily, vitamin A cream and interestingly enough vitamin C cream on your face. I have episodes 134 and 206 downloaded which are about preventing heart disease (I have some bad family history there) and exercise respectively. \n\nSpecifically, I am interested in the exercise ones. I do crossfit type high intensity workouts three times per week which is 3 hours of exercise. I have a feeling that some more time with lower intensity exercise would be beneficial to me in addition to what I do but that’s just my intuition not a science based thing. \n\nNutrition is also an interest of mine so episodes on that would be nice too. My basic knowledge is to eat less red meat, eat more vegetables inching one’s way into a vegetable based diet (which would be tough for me as I love carbs and meat and when I only eat veggies I get super hungry shortly thereafter). \n\nThe Revolutions podcast by Mike Duncan was also recommended and is very good.",
    "permalink": "/r/TheMotte/comments/x261n8/wellness_wednesday_for_august_31_2022/imixmzt/"
  },
  {
    "kind": "t1",
    "id": "imi5pyi",
    "author": "6tjk",
    "score": 1,
    "createdUtc": 1661941643,
    "body": "What is the best French to English translation software?",
    "permalink": "/r/TheMotte/comments/x261n8/wellness_wednesday_for_august_31_2022/imi5pyi/"
  }
]
