[
  {
    "kind": "t1",
    "id": "il1270m",
    "author": "gearofnett",
    "score": 1,
    "createdUtc": 1660969711,
    "body": "How do I get back the will to improve myself and live healthy? I was always driven by some goal that I would set for myself, but I've managed to achieve everything I wanted in the past few years, and the new goals I try to set for myself are not motivating enough for me to change my behavior. My regular day consists of waking up at 12-3pm, browsing the internet/reading a book/watching youtube or movie + 1 hour of work (if needed) + cook food, then going to bed at 3-6am. It's not all bad, on the weekends I go out with friends, and I also travel 3-4 times a year, but I understand that my regular day schedule is extremely unhealthy. If I keep living like that I won't be well physically or mentally. Even though I understand the consequences, it's still not motivating enough to change my ways. I try to fix my sleep, but after 2-3 days I'm back to that degen schedule because I literally don't have a reason to be awake early. I work for myself, so I don't need to be up early. All my friends and family work regular jobs, so I can't interact with them at that time either. I'm physically fit (as much as one can be when not working out consistently) and don't eat junk food, so I don't have an urgent need or want to go to the gym. I used to work out in the past and I know how much of an impact it has on your mental, but again, for some reason me knowing all that is not enough to push me to change. \n\nI'm very tempted to get a regular 9-5 job or join the military just for the sake of having responsibilities that would force me to have a normal human schedule and hope that the habits I learn during that time stick with me for the rest of my life.",
    "permalink": "/r/TheMotte/comments/wqhcx8/wellness_wednesday_for_august_17_2022/il1270m/"
  },
  {
    "kind": "t1",
    "id": "ikuljbf",
    "author": "MacaqueOfTheNorth",
    "score": 4,
    "createdUtc": 1660857923,
    "body": "Three of my family members have gotten Lyme disease (edit: actually one case is some other tick borne illness) this summer. I'd never heard of anyone I know getting it before. There seems to be an epidemic. Any advice on how to avoid it?\n\nIt seems like a horrible disease to get, much worse than Covid.",
    "permalink": "/r/TheMotte/comments/wqhcx8/wellness_wednesday_for_august_17_2022/ikuljbf/"
  },
  {
    "kind": "t1",
    "id": "iku9dfu",
    "author": "FiveHourMarathon",
    "score": 3,
    "createdUtc": 1660853377,
    "body": "Where can I buy a really good umbrella? I've been annoyed or disappointed by most umbrellas I've owned, so I've never really used them much. somebody out there must make a good one right?",
    "permalink": "/r/TheMotte/comments/wqhcx8/wellness_wednesday_for_august_17_2022/iku9dfu/"
  },
  {
    "kind": "t1",
    "id": "iktdbsz",
    "author": "Blacknsilver1",
    "score": 7,
    "createdUtc": 1660841004,
    "body": "I can recommend [this episode of Andrew Huberman's podcast](https://www.youtube.com/watch?v=DTCmprPCDqc) to anybody interested in longevity, exercise, nutrition, testosterone/estrogen and similar health and science-related topics.  \nPhenomenal episode, I learned a ton from it.  \n In fact, I kind of wish we had a monthly or yearly megathread for discussing self-improvenent in the context of high-quality scientific studies. I think this is a topic with surprisingly little discussion for how significant the potential benefits are.",
    "permalink": "/r/TheMotte/comments/wqhcx8/wellness_wednesday_for_august_17_2022/iktdbsz/"
  },
  {
    "kind": "t1",
    "id": "ikq6pg1",
    "author": "Nerd_199",
    "score": 6,
    "createdUtc": 1660779716,
    "body": "Any tips on getting a good Job Without going to college? Like internship or Certifications , Etc. I am personal real worry about getting myself in debt.",
    "permalink": "/r/TheMotte/comments/wqhcx8/wellness_wednesday_for_august_17_2022/ikq6pg1/"
  },
  {
    "kind": "t1",
    "id": "ikpgcyx",
    "author": "Gorf__",
    "score": 10,
    "createdUtc": 1660769116,
    "body": "So I'm switching to a mostly plant-based diet. I've been interested in nutrition for a long time, and for a while I've been circling this as probably the best approach to food long-term for health and longevity. The ethics side of it is nice too, but I'm not super interested in discussing that. This is mostly an experiment to see how I feel, and how my weight and blood markers look after a while. I'm trying to take a 90/10 approach, eating as plant-based as possible for all of my staple meals at home, but allowing some meat and dairy in when necessary, mostly when eating out. I haven't eaten any red meat or poultry in a few weeks, but I've had fish here and then when out at restaurants, as well as some dairy stuff - some cheese here and there and ranch dressing.\n\nGenerally I've been a hardcore meat-eater, so up until about 3 weeks ago, every dish was very focused around meat, and any vegetables were there as condiments or just because I felt like I \"should\" make myself eat some broccoli. It seems to me that this is an extremely common approach to food in the US. Everyone I know eats this way. Most of us have this idea that if you take away meat and dairy then you're stuck just eating salads all the time, but that's not the case at all. I've been eating oatmeal + fruit + some agave for breakfast; a smoothie and usually some sort of leftovers for lunch; and the formula for dinner is roughly: some a carb (whole grain pasta, brown rice, quinoa, etc) with a few vegetables mixed in and some kind of sauce for flavoring. The other night I made whole grain spaghetti with homemade tomato sauce (just cook down canned diced tomatoes and throw in some garlic and spices), sautéed mushrooms, roasted asparagus, and then topped with sautéed spinach, and then I ate that for lunch yesterday and today, and it was delicious.\n\nSo it's been a big change, but I'm loving it. When you're eating a wide variety of fruits and vegetables, there's just a lot more variation in flavor and texture going around. I'm finding out that meat itself is kind of boring: it's mostly texture, salt, and fat flavor. It's all of the stuff surrounding it that makes it good. Really, meat is already losing its allure to me altogether.\n\nI also feel less full and bloated after a meal. I'll be full because of the bulk of all the vegetables I just ate, but that goes away pretty quickly; otherwise I feel much better than I would after pounding a burger and fries.\n\nWhy am I using the term \"plant-based\" and not vegan? To me, vegan has a connotation of doing it more for ethical concerns, and plant-based has a connotation of being based more on nutrition. But that's just my own perception. A whole food plant based diet is one where you focus on eating plants that came from the ground more or less directly, maybe heating, chopping, and/or seasoning them first, but not much alteration beyond that. Ie, avoiding as many processed foods as possible - so while it's probably ok to have an Impossible Burger every now and then, it shouldn't be a staple. Folks who eat vegan for ethical reasons are probably more likely to eat processed foods like tofurkey or whatever, which isn't really any healthier than just eating meat all the time.\n\nSo the inevitable question is: _so where are you getting all of your protein?_ First of all, the whole \"incomplete protein\" thing isn't true - all plants have all amino acids. Yes, the amounts of each vary, but if you're eating a variety of plants then it's nothing to worry about. Incomplete proteins were written about in this popular vegetarian book in the 70s, and the author later realized her mistake and backed off of it, but it was too late - the idea had already been solidified in public consciousness.\n\nSecond, the actual amount of protein we need is probably majorly inflated for most people. Sure, bodybuilders might need more, but even they are probably majorly overdoing it. There's some good discussion about this in the book _Proteinaholic_ by Garth Davis.\n\nIn any case, it's pretty easy to hit solid protein numbers from eating plants, especially if you're getting lots of legumes. And protein shakes are still a thing if you need even more.\n\nThe only issue I've had so far is that I'm farting a lot, and the farts are pretty bad. I think I went overboard in going from eating like 10-15g of fiber a day to like 50g. I'm going to try dial that back and then ramp it back up more slowly. So maybe more white rice and pasta for a bit as I give my GI tract more time to adjust to the massive amounts of fiber.",
    "permalink": "/r/TheMotte/comments/wqhcx8/wellness_wednesday_for_august_17_2022/ikpgcyx/"
  },
  {
    "kind": "t1",
    "id": "ikpds17",
    "author": "sagion",
    "score": 14,
    "createdUtc": 1660768161,
    "body": "I'm near the end of pregnancy, and I've got a few problems going on.\n\nA month or so ago I was diagnosed with gestational diabetes. It's not fair. Of the [risk factors](https://www.cdc.gov/diabetes/basics/risk-factors.html):\n\n&gt;You’re at risk for gestational diabetes (diabetes while pregnant) if you:\n\n&gt;   * Had gestational diabetes during a previous pregnancy.\n&gt;   * Have given birth to a baby who weighed over 9 pounds.\n&gt;   * Are overweight.\n&gt;   * Are more than 25 years old.\n&gt;   * Have a family history of type 2 diabetes.\n&gt;   * Have a hormone disorder called polycystic ovary syndrome (PCOS).\n&gt;   * Are an African American, Hispanic or Latino, American Indian, Alaska Native, Native Hawaiian, or Pacific Islander person.\n\nI have one - over 25. Never been tested for PCOS, so I guess I can't completely rule that out, but there's a reason I've never tested for it. As far as my doctor and I can tell, this was random chance. My pancreas isn't processing insulin right because of pregnancy hormones from the placenta. Now I have to track my diet for carb intake, limiting but not avoiding carbs, test my blood glucose, and maintain some daily exercise (been getting harder to do). The diet is the most frustrating part. Ok, no, the long term risks to both my baby and me are the most frustrating thing. There's not much risk of a large-baby-birth, which I'll come back to, but the birth issues are worrisome if unlikely, and then the higher chance of both of us getting type II diabetes is, again, unfair. I would like to know the weight of that risk when controlled for the other risk factors. When your gestational diabetes may have been random chance and not because of factors that also influence type II diabetes (weight, family history, activity level), how big is that risk increase? My doctor thinks in all likelihood everything will turn out fine as long as I stick with the plan.\n\nAs I mentioned, the low-carb diet is a bit frustrating. I've adapted for the most part, but planning consistent meals is still tricky, particularly when my pizza-craving husband forgets my restrictions. We've gone out of town a couple of times and had family come stay with us. Those worked out ok mostly. I had to find a couple of creative spots to test myself, and once while out I broke down in tears after spending 15 minutes looking over a couple of walkable cafes for a quick, low-carb lunch option only to find my choice opened at 11 but didn't start the kitchen until 11:30, when we had to be elsewhere. I had also skipped breakfast and passed up getting a latte, chai, or pastry, which would all be bad diet choices. In general, it takes a lot more time and thought to pick out a restaurant that won't wreck my numbers. So much bread, rice, potatoes, or noodles that I'd rather not spend money on to not eat. And then there's looking up food nutrition, guessing what information gets close to what I'm actually having. Not fun when calorie counting, even worse when my baby's health is on the line. Less bad when I'm home and can go with home cooking, but still tedious.\n\nOn top of this, my baby keeps hovering in the 20th percentile of fetal weight. My doctor is a little concerned but otherwise chill about this, believing that he just may be a genetically small baby since I'm small myself (5'3\" and petite). My husband, however, is very worried about the negative effects of a low-weight birth and wants me to gain weight. That's not very compatible with what I'm supposed to do to manage my gestational diabetes. Low carb cuts out a lot of high-calorie stuff, particularly *yummy* high-calorie foods. I may have dropped a pound in the first few days of the diagnosis, before I got the guidance, when all I came up with as \"safe to eat\" and easy was salad. Now I've got more meat, dairy, and nuts in there. I've agreed with my husband to try tracking my calories to make sure I am getting enough, and he's agreed to try to attend the next appointment to talk to my doctor about the baby's weight. It's stressful and bizarre to hear my husband say he wants me to get fat. I don't want my baby to be too small, but I also don't want to exacerbate the gestational diabetes by gaining excess weight. Throw in typical late pregnancy bad sleep, and it's all so stressful to balance. I'd just like our little guy to get here healthy, safe, and sound.",
    "permalink": "/r/TheMotte/comments/wqhcx8/wellness_wednesday_for_august_17_2022/ikpds17/"
  },
  {
    "kind": "t1",
    "id": "ikp4cjy",
    "author": "Atersed",
    "score": 5,
    "createdUtc": 1660764653,
    "body": "I have a £500 \"learning\" budget from work, and no idea what to spend it on. I am a software tester looking for a programming job, but all the programming resources I use range from free to very cheap. I could buy physical textbooks, but prefer digital (which are free or piratable).\n\nBudget can be spent on learning \"anything\", e.g. pottery lessons, but I must be a boring person and don't have many hobbies or ideas.\n\nAny suggestions? Good programming resources to spend money on? Novel ideas?",
    "permalink": "/r/TheMotte/comments/wqhcx8/wellness_wednesday_for_august_17_2022/ikp4cjy/"
  },
  {
    "kind": "t1",
    "id": "ikof5fq",
    "author": "MacaqueOfTheNorth",
    "score": 1,
    "createdUtc": 1660755199,
    "body": "How likely is it that various common minor health problems (e.g. tinnitus) are caused sexually transmitted infections? If they are, is there a way to undo the damage or get rid of the infection?\n\nEDIT: This was not a question specifically about tinnitus. That was just an example.",
    "permalink": "/r/TheMotte/comments/wqhcx8/wellness_wednesday_for_august_17_2022/ikof5fq/"
  },
  {
    "kind": "t1",
    "id": "ikoevdl",
    "author": "Iconochasm",
    "score": 6,
    "createdUtc": 1660755095,
    "body": "Is Adrafiil available anywhere?  If not, any suggestions for a replacement?",
    "permalink": "/r/TheMotte/comments/wqhcx8/wellness_wednesday_for_august_17_2022/ikoevdl/"
  },
  {
    "kind": "t1",
    "id": "ikmw6jf",
    "author": "societal",
    "score": 5,
    "createdUtc": 1660728925,
    "body": "I need to find a new hobby that's worth my time and provides immediate rewards when I'm done with it and incentive to do it more?  Any advice?",
    "permalink": "/r/TheMotte/comments/wqhcx8/wellness_wednesday_for_august_17_2022/ikmw6jf/"
  },
  {
    "kind": "t1",
    "id": "ikmstw7",
    "author": "[deleted]",
    "score": 9,
    "createdUtc": 1660726179,
    "body": "[deleted]",
    "permalink": "/r/TheMotte/comments/wqhcx8/wellness_wednesday_for_august_17_2022/ikmstw7/"
  },
  {
    "kind": "t1",
    "id": "ikmsgx0",
    "author": "whenhaveiever",
    "score": 10,
    "createdUtc": 1660725883,
    "body": "Follow up for [this comment](https://www.reddit.com/r/TheMotte/comments/vhy8hb/wellness_wednesday_for_june_22_2022/id9zyuu/). Has it really been eight weeks?\n\nThe pregnancy has been coming along nicely. We've had two sets of ultrasounds so far, and our kid is the size of a lemon now. I've heard about pregnancy cravings, but I'd never heard of pregnancy aversions. They're apparently a thing, and it hops from one food to the next, including long-time favorite foods, so finding something that she's willing to eat can be challenging. But morning sickness barely showed up, and nothing like in the movies, so we're thankful for that. We're starting to figure out how to rearrange the house and loosely thinking about names. Instead of paying some $700 for a DNA test now that would tell us the sex, we'll wait until the week 20 ultrasound to find out for free. In the meantime, I'm more accustomed to using the singular *they* than my mom is, and accidentally had her thinking we were having twins since I kept saying *they*.\n\nI visited my parents (on the other side of the country, so I'm not there very often). I got there in time to help my dad come home from rehab, and help both my parents through a remodel of their ground floor to add a shower plus room for a wheelchair to negotiate through the bathroom. That way dad can have everything he needs without stairs. He eats very little, and when we try to encourage him, he says he \"just can't.\" Finding something that *he's* willing to eat can also be challenging. Because he's anemic, his doctor put him on prenatal vitamins as a cheap source of easy iron, and with a few things going on in his gut, he's gotten a few ultrasounds. It's odd how life rhymes sometimes. Since I've been back on this side of the country, dad was in and out of the hospital another time. They suspected a fistula and he was going to get surgery, then they decided he doesn't have one and just gave him antibiotics. I've lost count of how many times he's been in there in the last year and a half, and while each one is necessary at the time, each time he comes back weaker and has to spend weeks regaining his strength.\n\nWe also visited her parents (not as far away as mine, but far enough that it had been awhile). Since that trip, I've found it hard to get back to the normal routine. It seems especially more difficult to get up in the morning, and I have to really push myself to get going. I hope it's just a slump. I think part of it is regretting that I moved away from my parents way back when, and that I've spent so much time away from them. I think part of it is in some way realizing that I'm going to be sleeping much less once the baby comes, and so I might as well enjoy it while I can. But I'm also not enjoying it. It makes me feel like crap.",
    "permalink": "/r/TheMotte/comments/wqhcx8/wellness_wednesday_for_august_17_2022/ikmsgx0/"
  }
]
