[
  {
    "kind": "t1",
    "id": "ingc4la",
    "author": "practical_romantic",
    "score": 4,
    "createdUtc": 1662560322,
    "body": "So this is likely the final wellness wednesday thread.\n\nI met my cousin sister and we spent a bunch of time just roaming around the city, talking about stuff. We saw my old school where I spent 11 years. We later went to meet my high school senior who is also my cousins friend. I remember being around that chick and she was quite nice.\n\nI first met her in 2014 as a 14 year old in 9th grade and immediately made fun of her. My cousin herself met her a few years later. This senior of mine shared a cigarette with me and we all discussed our struggles in life with parents who have sky high academic expectations. It was cathartic and easily the highlight of my month.\n\nI am in good hands now, I workout almost daily, try to work, see my psychiatrist on time and am trying my best. I still like that history girl but for now I need a job plus research gig. Hopefully I meet her after i get this stuff done by the end of the year and complete that chapter of my life too.\n\nThanks to everyone on r/TheMotte it has been a pleasure to grow up here.",
    "permalink": "/r/TheMotte/comments/x261n8/wellness_wednesday_for_august_31_2022/ingc4la/"
  },
  {
    "kind": "t1",
    "id": "imp8wfh",
    "author": "lookingforthrowaway1",
    "score": 6,
    "createdUtc": 1662061121,
    "body": "Has anyone on here had any success in convincing a doctor to pursue a particular treatment course? \n\nA family member is currently experiencing an uncommon health issue on which there is limited research in the literature. I’ve found a few papers indicating that a certain treatment, although aggressive and not usually considered necessary, is 100% effective in preventing a fatal outcome. These are all peer-reviewed papers in respected academic journals written by well-credentialed researchers at reputable university medical schools. \n\nHow can I bring this research up to my family member’s doctor without offending their ego or something? Can I bring a printout with these papers as a reference and summarizing their key points?",
    "permalink": "/r/TheMotte/comments/x261n8/wellness_wednesday_for_august_31_2022/imp8wfh/"
  },
  {
    "kind": "t1",
    "id": "imo2pj9",
    "author": "crowstep",
    "score": 8,
    "createdUtc": 1662044897,
    "body": "This probably isn't the best place for relationship advice but here goes nothing.\n\nMy live-in girlfriend of one year recently told me that while she loves me, she isn't 'in love' with me. Apparently these things are quite different for her.\n\nEssentially, while she has loved all of her previous boyfriends, there was only one that she was 'in love' with, who was from several years ago and not the one before me.\n\nShe told me it might take time for her to feel 'in love', but that if she doesn't feel it, she'll break up with me. Her parents had a nasty divorce so she's paranoid about settling down with someone who isn't her 'soulmate'. (Not her exact words, but that was the gist of it).\n\nOverall I feel pretty hurt by this. Saying we loved eachother seemed like a big deal to me, but apparently for her it didn't really count to the same degree. Now it feels like there's a timer on our relationship and if I don't meet some ineffable standard in her head by a certain point, it's over. I was also pretty stung by the idea that I (and apparently, all her other exes) don't measure up to the one that got away.\n\nWe spoke about it at the time of course, but the more I think about this, the more it bothers me. I'm unsure whether to bring it up or just entrust my fate to the fickleness of female affection and hope that I eventually provoke more feelings in her than I am now. I can hardly guilt her into changing get feelings, so I'm reluctant to bring it up at all. And if I'm honest, I worry that even letting her know it bothered me would make her less attracted to me.",
    "permalink": "/r/TheMotte/comments/x261n8/wellness_wednesday_for_august_31_2022/imo2pj9/"
  },
  {
    "kind": "t1",
    "id": "iml50cu",
    "author": "ebrso",
    "score": 18,
    "createdUtc": 1661986675,
    "body": "My younger brother died suddenly in his sleep earlier today.  He had a heart condition, but this was totally unexpected.  He was in his early 30s.  I had spoken to him on Sunday.  I only found out a few hours ago.  My parents are devastated.  I'm not sure why I'm posting this.  How do people go on after this?",
    "permalink": "/r/TheMotte/comments/x261n8/wellness_wednesday_for_august_31_2022/iml50cu/"
  },
  {
    "kind": "t1",
    "id": "imkfe12",
    "author": "[deleted]",
    "score": 0,
    "createdUtc": 1661976531,
    "body": "[deleted]",
    "permalink": "/r/TheMotte/comments/x261n8/wellness_wednesday_for_august_31_2022/imkfe12/"
  },
  {
    "kind": "t1",
    "id": "imjr65j",
    "author": "PM_ME_UR_OBSIDIAN",
    "score": 4,
    "createdUtc": 1661967344,
    "body": "I'm looking for a really good personal organizer, ideally a combination calendar and task list. As of today I am using Google Calendar combined with Todoist.\n\nTodoist caveats:\n\n- No tracking of start date, only due date. Any task with a date configured is assumed to be a discrete amount of work to be done on the day that it is due, or shortly before.\n- There is no concept of prioritization within a time window. I can't ask \"what is the most urgent task that I need to get done within two weeks?\" \n- If I have a daily recurring task and I mark it as done for yesterday, then the next occurence is tomorrow. There is no concept of catching up on overdue engagements.\n\nThe app is swell though.",
    "permalink": "/r/TheMotte/comments/x261n8/wellness_wednesday_for_august_31_2022/imjr65j/"
  },
  {
    "kind": "t1",
    "id": "imixmzt",
    "author": "GeorgeMacDonald",
    "score": 7,
    "createdUtc": 1661955919,
    "body": "Someone on here recommended the podcast The Drive by Peter Attia. I started listening to it and it is a great podcast! I don’t know too much about the science of health besides the very basics so this is pretty cool. \n\nWhat episodes do you all recommend? I listened to the skin care episode (forgot which one that was). The upshot was use sunscreen daily, vitamin A cream and interestingly enough vitamin C cream on your face. I have episodes 134 and 206 downloaded which are about preventing heart disease (I have some bad family history there) and exercise respectively. \n\nSpecifically, I am interested in the exercise ones. I do crossfit type high intensity workouts three times per week which is 3 hours of exercise. I have a feeling that some more time with lower intensity exercise would be beneficial to me in addition to what I do but that’s just my intuition not a science based thing. \n\nNutrition is also an interest of mine so episodes on that would be nice too. My basic knowledge is to eat less red meat, eat more vegetables inching one’s way into a vegetable based diet (which would be tough for me as I love carbs and meat and when I only eat veggies I get super hungry shortly thereafter). \n\nThe Revolutions podcast by Mike Duncan was also recommended and is very good.",
    "permalink": "/r/TheMotte/comments/x261n8/wellness_wednesday_for_august_31_2022/imixmzt/"
  },
  {
    "kind": "t1",
    "id": "imi5pyi",
    "author": "6tjk",
    "score": 1,
    "createdUtc": 1661941643,
    "body": "What is the best French to English translation software?",
    "permalink": "/r/TheMotte/comments/x261n8/wellness_wednesday_for_august_31_2022/imi5pyi/"
  }
]
