[
  {
    "kind": "t1",
    "id": "igm16xj",
    "author": "QuarkweightGOAT",
    "score": 4,
    "createdUtc": 1658124879,
    "body": "[Following up.](https://www.reddit.com/r/TheMotte/comments/vsj44o/wellness_wednesday_for_july_06_2022/ifofoo2/)\n\nWeek 3/60 is now behind me.\n\nI fasted Tuesday, Wednesday, Friday and most of Saturday. \n\nUnfortunately, I had a drinking lapse. Either Thursday or Friday I justified to myself, in usual alcoholic fashion, to drink “just one last time.” The plan was to grab a “mickey” of rum (contains 8 standard drinks) for my last eating day of the week (Sunday) and factor that into total calories. I grabbed it on Saturday since liquor stores open late on Sundays which would prevent me from beginning to drink right away on the Sunday (yes, I know). Couldn’t resist the urge to have a few drinks that same day and ended up drinking the whole thing. Was very surprised by the effect. Tolerance went way down partly because I didn’t drink for a few weeks but also the fasting did a number. I grabbed another mickey earlier today. I finished drinking around 2pm EDT so pretty much sober now. I know I said I would abstain throughout this at the outset but am more committed to doing that now than before. I have derailed myself many times through drinking and won't do it for this. I will abstain 100% until the end of the 60 weeks. Words are cheap and I can't time travel but am confident in my ability to stay sober while I finish this transformation at the minimum.\n\nPositive news. I continue to lose fat at a rapid rate. As mentioned last week, I am increasingly noticing loose skin around lower stomach in certain light. Hard to make a firm distinction between between stretch marks and sagging skin. Remaining fat around stomach also feels squishier than usual - do not know if this is a function of the density of adipose tissue itself or a loose skin issue. I unexpectedly caught the least flattering view possible of aforementioned skin a couple of days ago and was pleasantly surprised by how unbothered I was by its unsightliness.  Must say that I did not at all expect it to look that bad since I hardly notice it in most other settings yet I felt mostly indifferent. I was fixated on this concern previously because the bulk of my considerable weight gain went to my torso, the appearance of stretch marks,rapidity of weight gain, and the fact that I have an unusually slender build. \n\nAfter this leaning out phase is done I think I am going to see what can be done over the remainder of the 60 weeks about loose skin and be satisfied with the effort regardless of result. I initially undertook fasting specifically to address this concern but not sure if it helped at all. I am pretty confident in stating that it didn't hurt despite rapid fat loss. Conventional wisdom is that slow weight loss mitigates loose skin but that’s based on little more than intuition. Logic of fasting was autophagy and the body relying on excess skin as a protein source. Still mostly conjecture but whatever. Anyway, not to bothered by it so far. Maybe it will bug me more once I lose a bit more fat. We’ll see. \nWill likely apply some or all of the following measures which are purported to help with loose skin pending more research: topical vitamin c, hyaluronic acid, dry brushing, high fluid intake, moisturizing, microneedling, collagen supplementation, and of course resistance training to maybe help fill in volume. Time seems to be the most important factor but also important to temper expectations. \n\nFinal week of fasting lies ahead. I will fast Monday, Tuesday, eat maintenance on Wednesday, and then fast for the remaining 4 days of the week. Will slowly work to maintenance the following week. I will post pictures in 2 weeks after I have eaten roughly at maintenance am a few days removed from a calorie-deprived, depleted physical state. \n\nWill provide update next week. Thanks.",
    "permalink": "/r/TheMotte/comments/vxw6lz/wellness_wednesday_for_july_13_2022/igm16xj/"
  },
  {
    "kind": "t1",
    "id": "ig22xn5",
    "author": "LastNightLonely",
    "score": 13,
    "createdUtc": 1657754326,
    "body": "Thanks everyone who replied to [my post last week](https://www.reddit.com/r/TheMotte/comments/vsj44o/wellness_wednesday_for_july_06_2022/if3qh70/?context=3). I did indeed start swiping on other guys on Tinder. I somehow got four matches in a couple days, and two of them didn't even ghost me immediately! We switched to Snapchat texts and everything.\n\n...which was *absolutely exhausting*. I don't understand how people chat over text with near-strangers they're trying to possibly date. The notification sound now produces not so much butterflies as the panic response.\n\nOne guy gave me kind of pushy/weird vibes after a bit, so I blocked him, solving one problem. The other guy seems pretty cool so far. I followed TracingWoodgrains' advice of suggesting an in-person meeting soon, which seemed to go over well, but he's not going to be free until the weekend, dooming me to several days of awkward texting. We might do a call soon at least.\n\nOn one hand, I hope it goes well, but on the other, I wouldn't be too upset if this connection disintegrated. Perhaps I should hold out for meeting people in-person or as friends of friends. The board game group this week involved a guy who I'm pretty sure is gay; he's well outside my age range, but there being any gay guys there is progress.",
    "permalink": "/r/TheMotte/comments/vxw6lz/wellness_wednesday_for_july_13_2022/ig22xn5/"
  },
  {
    "kind": "t1",
    "id": "ig03xrr",
    "author": "f3zinker",
    "score": 14,
    "createdUtc": 1657726259,
    "body": "Disclaimer: Not from the US.\n\nPretty bummed out about not getting a specific job. I applied for a a job that was exactly what I was looking for. I had the exact tech stack they were looking for as well. Pay was good too (60k no tax, without bonus, not the US so this is a good pay). \n\nHowever, as a part of the interview process, I got handed an \"aptitude test\", which was a blatant IQ test. I have never done a real IQ test, but my scores are mensa.no (130), mensa.dk (135). Now I don't put in too much weight into those numbers but I don't think I am stupid. My IQ is probably around 120 if we go by proxies of IQ. \n\nI failed their IQ test hard. They didn't give me a percentile, but I got 61/100. Mind you this test was a lot harder than standard IQ tests. All the questions were 3-d instead of the normal 2-d patterns. My score was below their minimal threshold. Now are they looking for the next Einstein for a junior role, idk. But I am still quite salty about it. I know IQ has real predictive power over interviews and other proxies, so I got told straight to my face that I am not smart enough, which isn't pleasant even if you know about it.",
    "permalink": "/r/TheMotte/comments/vxw6lz/wellness_wednesday_for_july_13_2022/ig03xrr/"
  },
  {
    "kind": "t1",
    "id": "ifzpff2",
    "author": "QuantumFreakonomics",
    "score": 17,
    "createdUtc": 1657720357,
    "body": "\nThanks to the wonders of the Poisson distribution I actually had 2 Bumble matches message me in the last week, despite typically getting less than one a month. I’ve been incelposting a bit more than usual lately, so maybe writing this up will provide some context for my point of view as well as allowing  others to offer perspective and point out errors in places where I may be blind.\n\nMatch number 1 was a thin blonde who opened with “How are you doing handsome?” Yellow flag. That is not something that women say to me, especially not as an opening. I’m not grotesque or repulsive(I don’t think), but I’m certainly not “handsome”, otherwise I wouldn’t be a mid 20s kv. As we continue chatting it immediately becomes clear that this person is both horny and forward with said horniness to an extent that I find very suspicious. This isn’t how I’ve known girls to act, but she doesn’t talk like a scammer or bot and her pictures seem real. It’s a work day so I try to stall until the weekend with some playful flirting. At some point she drops “I’m male but very feminine”. Mystery solved. I don’t see a “report as wrong sex” button on the app, so I just unmatch and move on. \n\nMatch number 2 was more what I would consider “my type”. She’s a good bit overweight but has a cute face. She’s from the exurbs not the suburbs, has no visible tattoos or piercings, and overall seems to have a more conservative view of gender roles than the median woman on these apps. She sends me a “heyy” and I say hey back. No response. A few days later, after the debacle with match number 1 has played out, I admit I get desperate. I ask me friends if she’s out of my league, just to check if I’m being delusional. I get a “definitely not, go for it”. She has her Snapchat name on her Bumble profile, so I add her. We start texting on Snap. She replies very slowly, sometimes not at all, but there are a few moments where it feels like things are going well and there might be something there. \n\nI’ve had dating apps since my first year of college, but for most of that time I never really used them. This is the furthest I’ve ever gotten with a woman from these apps, and the furthest I’ve gotten with a woman since my not-really-a-gf gf in 8th grade that never got past holding hands. In the long breaks waiting for her replies, I notice my mental state deteriorating. It’s all I can really think about. I’ve never met her in person, but for the first time since early college I have a plausible path towards getting a girlfriend (or at least some kind of intimacy). I haven’t gotten the same butterflies when someone texts me since high school. I start checking my phone obsessively even though I have notifications on. When she leaves me on read I start to panic. I keep texting her. She never says stop, but I’m not a complete moron. I know what the most likely outcome is. At this point I almost want it just to have my sanity back. Finally she blocks me. I hate myself, but I’m free. No more obsession. It’s over. \n\nAfter writing this all out I am reminded of Scott Aaronson wanting to chemically castrate himself over fears he might harm a woman if he did not. I am not and have never considered going that far, but I do have to ask the question: Is it ethical for me to continue looking for a partner? Every woman who has ever swiped right on me either wishes she hadn’t or is indifferent. \n\nI’m 6’3 and make 70k a year if that’s relevant. Something is wrong with me.",
    "permalink": "/r/TheMotte/comments/vxw6lz/wellness_wednesday_for_july_13_2022/ifzpff2/"
  },
  {
    "kind": "t1",
    "id": "ifzla0z",
    "author": "disposablehead001",
    "score": 4,
    "createdUtc": 1657718495,
    "body": "Anyone have advice on how to improve my text game? I do pretty well with women irl but getting them to the first date is a struggle. I also don’t have enough matches to feel like I can I get in decent practice. I was ghosted by a cool match (into Feynman and nuclear energy, be still my heart) and I’m pretty sure I made two or three errors that killed that convo. When I get my next exciting match in 3-9 months, I don’t want to fuck it up again, but I expect I will because I don’t have a way to stay in form.",
    "permalink": "/r/TheMotte/comments/vxw6lz/wellness_wednesday_for_july_13_2022/ifzla0z/"
  },
  {
    "kind": "t1",
    "id": "ifzau68",
    "author": "JosephinesOtherMan",
    "score": 10,
    "createdUtc": 1657713151,
    "body": "Does anyone have any advice on making new and close friends as an adult with a baby?  Almost all of our friends moved away from our city during or after COVID.  \n\nMy wife and I traveled for a friend's engagement party (one of those friends who moved away)--it was fine.  The day after, we met up with an old friend of mine and an old college friend of hers who live there, and we had a much better time with them than we've had with any of our friends at home in a really long time.  \n\n... I'm finding myself feeling a little sad after that for two reasons:\n\n1. Most of our friends at home have moved away, and while it's not too hard to make little acquaintances or Jane Jacobs-esq \"public friendships\" around (especially with a baby), it seems very hard to find or develop close friendships at this point in our lives.\n2. Meeting up with those old friends made me realize how distanced a lot of my friendships at home were--we were a large crew of folks who met up to have fun together, but ultimately we weren't very close (the contrast between the friends at the engagement party and the old friends the day after felt fairly extreme)\n\nI have a handful of close friends who mean a lot to me, but almost all of them are distributed around, and we keep in touch when we can, though a lot of formerly close friendships have gotten a little less close over COVID for whatever reason too.  I vaguely worry that the only person who I can rely on is my wife (my family isn't reliable), and it scares me a little.",
    "permalink": "/r/TheMotte/comments/vxw6lz/wellness_wednesday_for_july_13_2022/ifzau68/"
  },
  {
    "kind": "t1",
    "id": "ifz2ezj",
    "author": "70rd",
    "score": 3,
    "createdUtc": 1657707589,
    "body": "Anything to watch out for besides oxybenzone (potential endocrine disruptor) in  sunscreens? Titanium dioxide was ruled [unsafe](https://www.efsa.europa.eu/en/news/titanium-dioxide-e171-no-longer-considered-safe-when-used-food-additive) as a food colorant, doesn't say anything about topical use however (this [study](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3423755/) suggests it should not be too bad.\n\nI've found [EWG](https://www.ewg.org/sunscreen/report/the-trouble-with-sunscreen-chemicals/)'s post but am unsure how reliable of a source they are.",
    "permalink": "/r/TheMotte/comments/vxw6lz/wellness_wednesday_for_july_13_2022/ifz2ezj/"
  }
]
