[
  {
    "kind": "t1",
    "id": "iawg85x",
    "author": "Relevant_stuff_",
    "score": 5,
    "createdUtc": 1654170256,
    "body": "Where can I buy modafinil in Europe?\n\nI'm from south america and I've been taking Concerta as part of a treatment from my doctor because of ADHD (with so far good results). \n\nNow I'm traveling in Europe for already two months and run out of medication a month ago. I know methylphenidate is more difficult to get and to avoid getting tested again by a doctor (I'm not staying that much time in a given country) I'm willing to try Modafinil as some say it has positive results. Any ideas?\n\n[I didn't check if this question is against the rules, hope it isn't]",
    "permalink": "/r/TheMotte/comments/v2a9l4/wellness_wednesday_for_june_01_2022/iawg85x/"
  },
  {
    "kind": "t1",
    "id": "iaugao4",
    "author": "Anouleth",
    "score": 10,
    "createdUtc": 1654124379,
    "body": "I've got COVID, which sucks. I went over two years without catching it even when living in the same flat as someone who had it. The first day was Monday, which was really bad. Couldn't sleep, couldn't really do anything but lie on the sofa and suffer. \n\nIt's also hitting me at a particularly rough time in terms of mood. It's been up and down the past few months, but now it's really down. Everything seems so miserable and pointless. All my thoughts are wholly negative. It's not that I can't appreciate that these thoughts are irrational, they are. But I still can't get them out of my head, even with my usual distractions.\n\nNot really looking for advice because I wouldn't make good use of it anyway. I don't know what I'm looking for or what I want, because it feels totally impossible to be happy at this point.",
    "permalink": "/r/TheMotte/comments/v2a9l4/wellness_wednesday_for_june_01_2022/iaugao4/"
  },
  {
    "kind": "t1",
    "id": "iatuu06",
    "author": "MoebiusStreet",
    "score": 6,
    "createdUtc": 1654114939,
    "body": "What can be done for insect bites, particularly mosquitoes? My wife has an extreme reaction to them. For me, if I can ignore a mosquito bite for half an hour, it goes away. For my wife, it gets worse, becoming a raised red welt the next day.\n\nApplying benadryl or hydrocortisone cream doesn't seem to provide much relief. About the only thing she's found is to apply ice, but that's a very short-term effect and doesn't address the underlying problem.\n\nI wonder why there's no treatment (afaik) for desensitization, like we do for allergies.",
    "permalink": "/r/TheMotte/comments/v2a9l4/wellness_wednesday_for_june_01_2022/iatuu06/"
  },
  {
    "kind": "t1",
    "id": "iat2rxh",
    "author": "Sorie_K",
    "score": 8,
    "createdUtc": 1654103317,
    "body": "A few months ago I switched from coffee to caffeine pills.  By doing so I've managed to way reduce my caffeine intake, the alertness lasts longer and has less jitters.  So I think it was a good move overall.  But strangely I seem to have lost my desire to read?  Previously I read voraciously pretty much every spare moment I had, but now for no clear reason i can't seem to make it past a few paragraphs without losing my interest.  I've had to start listening to podcasts, which i always kind of struggled with, because it seems to be the only way i can cram info into my head.  My desire to write has kind of gone in the same direction as well.  I miss both of those things, but my overall mood and energy throughout the day are so much better that I havent switched back yet.  And instead of reading and writing all the time I'm spending way more time hanging out with people face to face, which is probably good overall.  I think my mood is also just better because im engaging less with politics and the culture war and all the toxicity that comes with that.  I'm at a very weird place where i seem to have sort of inexplicably lost my main lifelong hobby, and it's definitely bothersome, but I'm not anywhere near as upset about it as I should be?",
    "permalink": "/r/TheMotte/comments/v2a9l4/wellness_wednesday_for_june_01_2022/iat2rxh/"
  },
  {
    "kind": "t1",
    "id": "iasz8wc",
    "author": "disposablehead001",
    "score": 11,
    "createdUtc": 1654101848,
    "body": "I’m done with year 1 of med school! Motivation was a big obstacle academically, but my scores had an upward trajectory after I started bupropion + methylphenidate. Another year of living in the boonies, then I get to move to a better spot for clinicals. \n\nIm trying to minimize my exposure to video games, as I get sucked in and lose days of my life. Thanks Stellaris. I’m training for a cycling race, trying to read a book a week, and have a part-time research gig to keep me busy. Dating is the one big complaint, and while the local scene sucks, I’m going to try and get out to social settings more often this summer, more for the practice than anything else.",
    "permalink": "/r/TheMotte/comments/v2a9l4/wellness_wednesday_for_june_01_2022/iasz8wc/"
  },
  {
    "kind": "t1",
    "id": "iaspmn8",
    "author": "diatribe_lives",
    "score": 5,
    "createdUtc": 1654097799,
    "body": "Looking into buying a townhouse built by DR Horton. Anyone have experience with them, or tips in general for buying a first house? In particular I'm wondering whether I need a realtor to negotiate a deal with them to buy a townhouse under construction. With how busy I am, it's been difficult to find many resources for getting started with my first house.\n\nThe place costs \\~$500k and I'm pretty much just buying it as an investment (though living there will be very nice compared to my current \\~550 sqr ft apartment)",
    "permalink": "/r/TheMotte/comments/v2a9l4/wellness_wednesday_for_june_01_2022/iaspmn8/"
  },
  {
    "kind": "t1",
    "id": "iasl96i",
    "author": "Difficult_Ad_3879",
    "score": 2,
    "createdUtc": 1654095904,
    "body": "Any natural depressants more powerful than chamomile but less risky for longterm use than alcohol?",
    "permalink": "/r/TheMotte/comments/v2a9l4/wellness_wednesday_for_june_01_2022/iasl96i/"
  },
  {
    "kind": "t1",
    "id": "ias03u3",
    "author": "Southkraut",
    "score": 2,
    "createdUtc": 1654085518,
    "body": "Hayfever. Does anyone have a silver bullet for that one?\n\nEdit: It's not a problem indoors; the goal would be to get me back out of doors even during pollen season.",
    "permalink": "/r/TheMotte/comments/v2a9l4/wellness_wednesday_for_june_01_2022/ias03u3/"
  },
  {
    "kind": "t1",
    "id": "iarqded",
    "author": "der_holle_rache",
    "score": 5,
    "createdUtc": 1654078766,
    "body": "I do not feel any pleasure when reaching the objectives I set myself; being them exams, monetary rewards or gym goals: once they have been reached there is no satisfaction. This predicament makes quite difficult to remain motivated: the only way I've found to help reach the above-mentioned objectives is adopting a behavioral and robotic method like the pomodoro timer and shut down any kind of thinking and emotions: \"Execute, do not think of the reward!\".\n\nNevertheless these methods have begun to work less effectively each time I use them since there is no light at the end of the tunnel: \"Why should I execute these commands if, at the end, I will feel no satisfaction from it?\", besides, constantly maintaining a robotic attitude toward a major part of life is stressful and easily spirals into an endless cycle of anxiety, desperation, depression and procrastination.\n\nHas anyone here ever felt the same way? Do you have any advice?",
    "permalink": "/r/TheMotte/comments/v2a9l4/wellness_wednesday_for_june_01_2022/iarqded/"
  },
  {
    "kind": "t1",
    "id": "iarntb1",
    "author": "practical_romantic",
    "score": 1,
    "createdUtc": 1654076596,
    "body": "End of my hellish exam cycle, preparing for software jobs and research. plus physical culture.\n\nMy hellish exam cycle that began in August last year ends tomorrow. I have had somewhere from 50 to 60 exams in 240 days and tanked my cgpa from 8.5 to 7 and it'll likely dip below 7 (out of 10 that is). more on that later.\n\nSoftware Dev jobs prep(placements) and Research.\n\nI'll be free till August first week and will do algoexpert plus my research in NLP. Placements is the term used to describe the annual hiring season where firms visit big reputed unis (like mine) and conduct tests to hire final year students. So it last from August to December and is the sole reason why pajeets even go to cram schools. I will be using algoexpert to prepare for mine and after the 180 questions on it are through, I will switch to leetcode. I want to get a good paying job so that my purpose of uni is fulfilled. Ideally I woould want to get a remote one and then move to the west as India is a decaying country due to unfortunate circumstances.\n\nThe prof is in an IIT that's far away and the entire project is remote. I'm a failure as a person at most levels so hope I can change now. I will finally get to work with a decent ML researcher and if this goes well, I will then get to work with an even better researcher. India sucks when it comes to research of any kind anywhere at all.\n\nPhysical Culture.\n\nI finally now have two uninterrupted months with literally zero uni so will work out daily and hopefully try to join the local freestyle wrestling practise. I hope they take me in and I can do well, not get injured. I have wanted to work out for the longest amount of time but being really really really lazy and terrible with time management meant that I would simply end up not studying what was taught in my classes and have to skip gym sessions to study for my exams, not anymore thankfully.\n\nI will also watch the new top gun in theatres and visit places in my city with my family.\n\n**End of my hellish exam cycle.**\n\nI hated every single second of it. My uni has this power couple that were the first PhD in the department and 18 of the 25 full time faculty here are their PhD students or rather who got a PhD from them. I know I've not done well but mmthe syllabi here I genuinely outdated as most people are not smart enough to teach. 18 out of 25 is not a normal number given that India has significantly better research institutes.\n\nRegardless, you cannot complain officially as then they'd just fail me in exams. Regardless I'm happy that it's over but sad that it happened. Going from 24 in 360 days to 60 in 240 is just fucking stupid and I'll forever hate my uni for it. I missed everything, extra curricular, research, friends, night outs, internships, girls, fucking everything over exams about subjects that are taught in the worst way. Most of not all of them are useless as the teachers would come to class after stealing slides from Stanford. They'd skip over them and copy papers too. The entire point isn't to learn anything but to conduct exams and then bully kids as that's how they feel important.\n\nThis isn't just because I did poorly but also because my uni is beyond repair. A central university gig is highly prestigious and offers people lifetime benefits and numerous perks so everyone who's here exists just to milk it.\n\nI'm happy that my exams are over. I genuinely fucking hate everyone and everything. After years of cram school I got the same treatment again. College is supposed to be magical man, not be an exam fest where you literally learn nothing, absolutely nothing of use. I was in the 99.9xx percentile in the country and despite that this is the kinda trash I have to deal with.\n\nOverall\n\nWhat has happened has happened, I just am happy that I will finally have some time off. Wish me luck and please drop some other Software engineering job interview or test tips if you have any. Thanks and I am super grateful about life too, as fucked as my uni is (the faculty is too stupid to have passed the exams the undergrad did, this is a fact as Indian higher education has tremendous status decay so most masters or PhDs in tech are not worth the paper they are printed on PhD means that only the scums in tech get faculty jobs, humanities is infinitely better quality wise) I still have decent amount of prestige in society and will get a decent paying job. I have a good life that I fuck up due to my own laziness and I aim to fix that.\n\nWill get my wisdom tooth removed, get finasteride prescription, get my acne scars treated and a bunch of personal grooming done. Cannot wait!",
    "permalink": "/r/TheMotte/comments/v2a9l4/wellness_wednesday_for_june_01_2022/iarntb1/"
  },
  {
    "kind": "t1",
    "id": "iarbe4m",
    "author": "DuplexFields",
    "score": 13,
    "createdUtc": 1654065563,
    "body": "[Fork Theory](https://yay855.tumblr.com/post/685828242766217216/teabeakay-cipheramnesia-jenroses-have-i), from Tumblr, a corollary to [Spoon Theory](https://butyoudontlooksick.com/articles/written-by-christine/the-spoon-theory/). Why am I bringing this here? First, because I experienced it this past week during a stressful family vacation, in an incident literally involving a plastic fork breaking, thankfully in food, not stuck into me. Second, it's already got 107,785 re-tumbles, it'll become part of the mental health vocab pretty quickly:\n\n&gt; Have I told y’all about my husband’s Fork Theory? \n\n&gt; If I did already, pretend I didn’t, I’m an old.\n\n&gt; So the Spoon Theory is a fundamental metaphor used often in the chronic pain/chronic illness communities to explain to non-spoonies why life is harder for them. It’s super useful and we use that all the time.\n\n&gt; But it has a corollary. \n\n&gt; You know the phrase, “Stick a fork in me, I’m done,” right?\n\n&gt; Well, Fork Theory is that one has a Fork Limit, that is, you can probably cope okay with one fork stuck in you, maybe two or three, but at some point you will lose your shit if one more fork happens. \n\n&gt; A fork could range from being hungry or having to pee to getting a new bill or a new diagnosis of illness. There are lots of different sizes of forks, and volume vs. quantity means that the fork limit is not absolute. I might be able to deal with 20 tiny little escargot fork annoyances, such as a hangnail or slightly suboptimal pants, but not even one “you poked my trigger on purpose because you think it’s fun to see me melt down” pitchfork.\n\n&gt; This is super relevant for neurodivergent folk. Like, you might be able to deal with your feet being cold or a tag, but not both. Hubby describes the situation as “It may seem weird that I just get up and leave the conversation to go to the bathroom, but you just dumped a new financial burden on me and I already had to pee, and going to the bathroom is the fork I can get rid of the fastest.”\n\nFYI I'd started to work on a theory of \"preservation of hassle,\" but Fork Theory has the memetic jazz which mine didn't.",
    "permalink": "/r/TheMotte/comments/v2a9l4/wellness_wednesday_for_june_01_2022/iarbe4m/"
  }
]
