[
  {
    "kind": "t1",
    "id": "igz1v8u",
    "author": "Atersed",
    "score": 1,
    "createdUtc": 1658354887,
    "body": "Herman Miller chairs - expensive meme or ergonomic dream?",
    "permalink": "/r/TheMotte/comments/w3f00s/wellness_wednesday_for_july_20_2022/igz1v8u/"
  },
  {
    "kind": "t1",
    "id": "igyyi6u",
    "author": "Gorf__",
    "score": 1,
    "createdUtc": 1658353382,
    "body": "I quit drinking and vaping.\n\nAccording to Fitbit my resting heart rate is already 10bpm lower, and my HRV is 20ms+ higher.\n\nI’ve tried to quit numerous times but I think this is the actual time. I’m just tired of feeling like dog shit most of the time. I’m tired and haven’t been exercising like I used to.\n\nVaping was always dumb, I don’t even want that in my life. But I can’t resist it when I’m drunk, and I’m always around it, so I ended up just doing it by default.\n\nAlcohol is mostly just nice because it’s weird to not drink, at least in my friend group. So it’s just avoiding that whole awkwardness. But, it does seem like it’s getting more common to encounter people who don’t drink. Maybe that’s just because I’m getting older. In any case, I’m starting to give less of a fuck about that. Just let me live my life, I don’t need to put garbage in my body just to make you feel better.",
    "permalink": "/r/TheMotte/comments/w3f00s/wellness_wednesday_for_july_20_2022/igyyi6u/"
  },
  {
    "kind": "t1",
    "id": "igym84d",
    "author": "wmil",
    "score": 1,
    "createdUtc": 1658348120,
    "body": "Any advice for joint issues? I have some chronic ankle problems that my doctor brushes aside. \n\nI'm just curious what has worked for people.",
    "permalink": "/r/TheMotte/comments/w3f00s/wellness_wednesday_for_july_20_2022/igym84d/"
  },
  {
    "kind": "t1",
    "id": "igx4h21",
    "author": "QuantumFreakonomics",
    "score": 1,
    "createdUtc": 1658326812,
    "body": "Is the main point of a therapist to pay someone for the emotional labor of listening to you rant about your problems, nod along, and then provide comforting but non-falsifiable advice? I’ve been skeptical of trying one because I have serious doubts they would help actually solve the problems I have, but lately the closest thing I have to friends have been getting fired of putting up with my needy self-pitying bullshit (frankly I can’t blame them).",
    "permalink": "/r/TheMotte/comments/w3f00s/wellness_wednesday_for_july_20_2022/igx4h21/"
  }
]
