[
  {
    "kind": "t1",
    "id": "if5qk02",
    "author": "rekruldas",
    "score": 10,
    "createdUtc": 1657162033,
    "body": "I developed some bad habits in my past, and now I feel trapped.  Trapped as in \"I'd be killing myself tomorrow\" were my parents dead. They're not, so I can't. Don't know what to do with myself.\n\nNo career, no CV, no friends. Not that I alienated them, a little of that, but mostly,  I had few friends, and they all drifted away after I dropped out of uni.  Before that, friends from high school drifted away because I went to another city for uni.No context anymore, and I felt ashamed too. I don't feel like getting to know any people. There's nothing I can offer them, and where would I get to know them anyway ? Gym ? People go there to exercise, not to socialise.\n\nLonger re-statement of my malfunction in a reply to this.",
    "permalink": "/r/TheMotte/comments/vsj44o/wellness_wednesday_for_july_06_2022/if5qk02/"
  },
  {
    "kind": "t1",
    "id": "if44t2h",
    "author": "Nerd_199",
    "score": 4,
    "createdUtc": 1657136697,
    "body": "\nDo you you guys got any good advice for young adults in genral?\n\nLike to how better social skills/personal financial?",
    "permalink": "/r/TheMotte/comments/vsj44o/wellness_wednesday_for_july_06_2022/if44t2h/"
  },
  {
    "kind": "t1",
    "id": "if3qh70",
    "author": "LastNightLonely",
    "score": 8,
    "createdUtc": 1657130676,
    "body": "Another awkward guy who could use some dating advice here.\n\nI'm 23, male, white, just finished a master's degree, starting a career in software engineering, normal-looking (though skinny; I'm working on that), and shy in large groups of new people (but alright one on one). The main problem is that I'm gay in a moderate-size city in the US South, population 150,000, whose main university was recently ranked the least LGBT-friendly public university in the nation.\n\nDue to general awkwardness and being busy during college and grad school, I've never kissed a guy or been on a date, but girls have definitely liked me, so I think I would do alright if I could just meet some gay guys that are at least slightly nerdy. My question is then how to do that.\n\nThere are gay bars in town, but bars aren't at all my scene, I personally don't drink for genetic reasons, I'm not looking for a hookup (I could just use Grindr if I was), and it just seems like my kind of guy is unlikely to be at a bar. But maybe I should try anyway?\n\nI tried Tinder and Bumble, but the pools are so small (I exhausted them in just a couple hours) and a large proportion of guys smoke (a deal-breaker for me) or are just looking for a hookup. I got a couple matches, but they almost immediately stopped responding, which I suppose is to be expected on the apps.\n\nTo make some regular friends in town, I've started going to a board game club. There used to be a pretty active programmers community in town, which apparently kind of collapsed during the pandemic, but I'll keep an eye on it. For some physical activity I'm thinking about joining a recreational soccer league this fall.\n\nThoughts on any of this would be appreciated, thanks!",
    "permalink": "/r/TheMotte/comments/vsj44o/wellness_wednesday_for_july_06_2022/if3qh70/"
  },
  {
    "kind": "t1",
    "id": "if3dicu",
    "author": "Atersed",
    "score": 6,
    "createdUtc": 1657125525,
    "body": "Has anyone managed to reverse their myopia? \n\n&gt;This is a method that says that some specific poor vision habits plus slightly-too-powerful glasses induce myopia, and that some other specific good vision habits plus different glasses can reverse it.\n\n&gt; In various corners of the internet there is an overwhelming abundance of anecdotal claims from people who aren't sockpuppets (I checked) that the model's interventions are effective. This is what led me to try it. A lot of the information here is based on a synthesis of the perspectives provided by people in various communities attempting this process.\n\nhttps://www.losetheglasses.org/\n\nThe key idea seems to be not to over-correct your vision for your current task. If you are looking at a computer for 8 hours a day, do not wear your full strength distance glasses, but a weaker pair that are just strong enough to see the screen.\n\nThis sounds plausible and fairly cheap to try.",
    "permalink": "/r/TheMotte/comments/vsj44o/wellness_wednesday_for_july_06_2022/if3dicu/"
  },
  {
    "kind": "t1",
    "id": "if3cld0",
    "author": "bl1y",
    "score": 14,
    "createdUtc": 1657125172,
    "body": "Woke up at midnight, puked, had to shower to get cleaned up, restless sleep off and on, 101 fever.\n\nGo online to order some comfort foods. Payment declined. Check bank, card hold, $1000+ in fraud charges. Cancel card, won't have new one for up to 2 weeks.\n\nAnyways, send wellness please. I am out of wellness.",
    "permalink": "/r/TheMotte/comments/vsj44o/wellness_wednesday_for_july_06_2022/if3cld0/"
  },
  {
    "kind": "t1",
    "id": "if2tf3d",
    "author": "punishedmicah",
    "score": 6,
    "createdUtc": 1657117588,
    "body": "https://www.painscience.com/articles/pain-is-weird.php#sec_welcome\n\nReally neat article about the way pain functions. Situated a lot of things into context for me. \n\nDoes anyone have reading recommendation talking about the way our brains act in moments of acute stress, from a somewhat larger angle? One thing I want to cultivate is calmness in times of crisis.",
    "permalink": "/r/TheMotte/comments/vsj44o/wellness_wednesday_for_july_06_2022/if2tf3d/"
  },
  {
    "kind": "t1",
    "id": "if2soy3",
    "author": "SomewhatEmbarassed",
    "score": 16,
    "createdUtc": 1657117279,
    "body": "I need to log off. Terminally online leftists are really getting to me. Bullies, the lot of them. Rotten and self-righteous without any substance to back up their principles. I'm tired of their justifications, because it too often results in the wrong people getting hurt by them. \nI don't want to fall victim to divide-and-distract tactics, and yet when I feel so alone in my frustrations, it's difficult to focus on more important things.",
    "permalink": "/r/TheMotte/comments/vsj44o/wellness_wednesday_for_july_06_2022/if2soy3/"
  },
  {
    "kind": "t1",
    "id": "if2s33v",
    "author": "GrendelBlackedOut",
    "score": 10,
    "createdUtc": 1657117020,
    "body": "Is there a point where some sort of law of diminishing returns kicks in with respect to cardiovascular fitness? I hate exercising. It brings me no pleasure whatsoever. I would, however, like to have as much high quality time with my wife and kids as possible. My current cardio routine consists of running a 5k on a treadmill twice a week (typical time \\~23:30-24 minutes) and a 5-mile outdoor run perhaps once every 3-4 weeks (typical time \\~40-42 minutes). Is there any incremental utility in running more or could I be happy just maintaining this?",
    "permalink": "/r/TheMotte/comments/vsj44o/wellness_wednesday_for_july_06_2022/if2s33v/"
  },
  {
    "kind": "t1",
    "id": "if2o0jm",
    "author": "Weaponomics",
    "score": 18,
    "createdUtc": 1657115227,
    "body": "I say many word, when few word do trick. \n\nHowever, I cannot think of few-word until I have already said many-word. \n\n(For example: I have revised 5 full paragraphs into what you see here, with almost no loss of content.)\n\nHow fix?",
    "permalink": "/r/TheMotte/comments/vsj44o/wellness_wednesday_for_july_06_2022/if2o0jm/"
  },
  {
    "kind": "t1",
    "id": "if2h0sf",
    "author": "punishedmicah",
    "score": 5,
    "createdUtc": 1657111870,
    "body": "Started getting into olympic weightlifting. It's a fun thing to organize my strength training around, and the incredibly technical nature of the snatch/clean-and-jerk would probably appeal to a lot of y'all. So many layers to dig into with these two moves. \n\nIt's a great sport because it requires strength, balance, flexibility and a Motte-level obsession with analysis and details.",
    "permalink": "/r/TheMotte/comments/vsj44o/wellness_wednesday_for_july_06_2022/if2h0sf/"
  },
  {
    "kind": "t1",
    "id": "if1ptbl",
    "author": "practical_romantic",
    "score": 4,
    "createdUtc": 1657092030,
    "body": "I'm able to get 2 hours of work done every other day and work out twice a week as the gym is 45 minutes away.\n\nNot great progress but programming is quite fun although taxing. My aim for this week is to workout 3 days a week and work 4-6 hours daily while ensuring I get plenty of sleep at the right time.\n\nIt's genuinely bad but still honest progress and with achievable goals.\n\nHere's also a text exchange between me and a friend of mine that describes an event which will be the last part of my post. \n\nSo I met my classmate who got into IIT Kanpur today for breakfast\nHe was here with two other dudes from his uni, one was from CS and the other from materials.\nMy classmate and the CS dude hadn't taken a year off like I had and they went from being wierdo nerds who were prentious to well adjusted people who'd indulge in hedonism and doing well in life.\nGood to get periodical reminders like today.\nI don't have any girls I text for now and will keep it that way.\nYou're right about time man.\nI can have all the fun in the world but for now, back to work.\n\nIIT Kanpur is the best uni in the country and is above the one I go to. Both these people have gotten selected by different grad schools (UIUC and CMU respectively) with a bare minium research profile since the recommendation of faculty there matters a lot. \n\nMy point is that there's a time and place to have fun and there's a time and place to just study, my current situation is the latter. \n\nI was genuinely surprised when I was able to solve programming questions and got a sense of joy doing that so shall continue. Working out is a tad hectic and people mock me for even trying since I've been doing it on and off for the past year but would go for a week and not go again for a month due to the pajeet exam schedule. \n\nAnyway, have a fun week ahead.",
    "permalink": "/r/TheMotte/comments/vsj44o/wellness_wednesday_for_july_06_2022/if1ptbl/"
  }
]
