[
  {
    "kind": "t1",
    "id": "ijrj3bk",
    "author": "self_made_human",
    "score": 28,
    "createdUtc": 1660162133,
    "body": "Aight lads, the moment of reckoning is here for me.\n\nI've always wanted to flee from India for fairer shores, and while the NHS might be slowly imploding, it's *still* miles ahead of what I have to deal with here.\n\nI've been preparing for the British medical licensing exam there for almost a year, which is probably the longest I've ever been able to focus on a task, although the bulk of the focused prep was in the past 3 months. And for once, I don't have that typical ADHD anxiety the night before the test, because I genuinely know I've done all I can, I score well above the cutoff in practise tests, and unlike pretty much every exam I've ever given, I don't find myself desperately cramming the night before to make up for not bothering before.\n\nMaybe it's that this is something that I *want*, as opposed to entering medicine or making it through med school, a decision prompted more by the fact that there wasn't any other profession I preferred, rather than a genuine passion for it. I mostly phoned it in then, but faced with the prospect of finally striking out on my own, and making something of myself in foreign shores, I actually did things right for once.\n\nIn fact, I have more anxiety about my *lack* of anxiety than anything else, to know that I'm probably going to make it through regardless of reckless scrambles is a novel feeling for me.\n\nWish me luck, while this isn't the end of the journey by any means, it's the first milestone along the way, and I genuinely hope I make it through. The grass may or may not be greener on the other side, but I'm determined to find out for myself..",
    "permalink": "/r/TheMotte/comments/wkpy9w/wellness_wednesday_for_august_10_2022/ijrj3bk/"
  },
  {
    "kind": "t1",
    "id": "ijqkmzn",
    "author": "[deleted]",
    "score": 2,
    "createdUtc": 1660149333,
    "body": "[deleted]",
    "permalink": "/r/TheMotte/comments/wkpy9w/wellness_wednesday_for_august_10_2022/ijqkmzn/"
  },
  {
    "kind": "t1",
    "id": "ijp7suz",
    "author": "practical_romantic",
    "score": 11,
    "createdUtc": 1660126497,
    "body": "Worked out daily this month and did study. I do get jaded and feel some brain fog later in the day but the moment I sit on my desk, it goes away like mist after seeing the morning sun. Same for my gym.\n\nI did 40+ reps on the deadlift and squats on Monday and puked right after my workout due to having eaten nothing all day but 3 bananas. I am constantly hungry, sleep like a baby (slept for legit 10 hours yesterday night) and feel mentally sharp. I can feel my brain peak and dip, something I never could feel before as the entire day was foggy. \n\nI eat anywhere from 3 to 6 eggs daily. I would feel full at 2 earlier but feel hungry constantly now. My posture is much better. Deadlifts and Lat pulldowns fuck my back muscles up so much that I can feel them all day and they do not let me slouch. I have lost an inch or two off my waist even though I am underweight and gained a kg of weight so it is not fat.\n\nI have done 12 videos on my playlist so far, aim is to get to 42 by the end of this week and ensure that I do 4 hours of solid undistracted work daily without fail or any breaks (by work I just mean Data Structures and Algorithms).\n\nIt is not much but I am a level 1 slime so leveling up takes time. Just need to grind and keep action as the default state.",
    "permalink": "/r/TheMotte/comments/wkpy9w/wellness_wednesday_for_august_10_2022/ijp7suz/"
  }
]
