[
  {
    "kind": "t1",
    "id": "ilsrtci",
    "author": "BhagwaRaj",
    "score": 1,
    "createdUtc": 1661468769,
    "body": "How to not feel tired after lifting? I feel absolutely drained, want to lie down, which I do. Is lowering the training max the only way? I do eat, I've been eating 2500-2600kcals, with enough protein 120g+",
    "permalink": "/r/TheMotte/comments/wwbr8k/wellness_wednesday_for_august_24_2022/ilsrtci/"
  },
  {
    "kind": "t1",
    "id": "ilq859f",
    "author": "futureflier",
    "score": 1,
    "createdUtc": 1661432551,
    "body": "I would like to try oral minoxidil for hair loss, but it’s not available where I live.\nHowever, looking at topical solution it’s ethanol, propylene glycol, water and minoxidil at 1mg/ml. \nSo I guess it should be pretty safe to consume with straightforward dosing. Is there any catch, like oral and topical minoxidil being in different form etc.?",
    "permalink": "/r/TheMotte/comments/wwbr8k/wellness_wednesday_for_august_24_2022/ilq859f/"
  },
  {
    "kind": "t1",
    "id": "ilpc6ix",
    "author": "Flapling",
    "score": 1,
    "createdUtc": 1661410870,
    "body": "If you were in the US, and you wanted to get semaglutide even though your health insurance won't cover it because you're not quite obese enough, how would you go about it?",
    "permalink": "/r/TheMotte/comments/wwbr8k/wellness_wednesday_for_august_24_2022/ilpc6ix/"
  },
  {
    "kind": "t1",
    "id": "iloo9nm",
    "author": "Rowan93",
    "score": 1,
    "createdUtc": 1661396117,
    "body": "What's a way that an intelligent person can make a \"part-time minimum-wage job\" tier income, that isn't the obvious one? And/or what's a better way I can find same than posting the question here?\n\nWell, the other obvious one is to get a better job, so to clarify why it's even a problem: I'm basically a NEET right now, have been for like 6 years, failed to complete my undergraduate (physics) degree, never been employed. So, it at least *feels like* I have no marketable skills, and like my executive dysfunction will keep me that way. Also my social anxiety has probably only got worse in this time.\n\nSo, what options aren't I considering, or haven't I heard of?",
    "permalink": "/r/TheMotte/comments/wwbr8k/wellness_wednesday_for_august_24_2022/iloo9nm/"
  },
  {
    "kind": "t1",
    "id": "ilmxnyb",
    "author": "SkookumTree",
    "score": 3,
    "createdUtc": 1661370315,
    "body": "I'm on the autism spectrum and want to become as graceful as the average neurotypical. I understand that this might be a nearly impossible task; there are neurotypicals out there that almost never make social blunders...and this is not far from average, in my view. I've been practicing lots, and have made some new friends...but I still get the feeling that they are basically secretly annoyed by me and only tolerating me out of a sense of pity and politeness. How might I get to the place where I think the average neurotypical is: seemingly effortlessly graceful, never making a mistake big enough to be put into words while sober. Watching two average people talk, to me, is like watching Olympic gymnasts or professional ballerinas. My therapist has been helpful - but she hasn't given me much that would help me get that level of grace.\n\nAlso: I find it interesting that people expect me, at 27, to have had some relationship history even though I am shorter than average and not that good looking - as well as being awkward. I wonder if they expect me to have, at least at some point, have bitten the bullet and been in a relationship with someone who I wasn't all that interested in or who had very real shortcomings that impacted them every day...maybe they were 300 pounds overweight. Maybe they had a drug or alcohol problem. Maybe they were no shit crazy and wound up in mental hospitals twice a year. IDK what it is. Is there any way that I could figure out how to accept being a nurse and caretaker to someone that is more or less disgusted by me? I'd like to have a family, and if that is what it takes I'd consider it, but it is a hard pill to swallow - being a single father, functionally, while also being a nurse and caretaker for a wife that is committing slow suicide. That takes toughness and discipline.",
    "permalink": "/r/TheMotte/comments/wwbr8k/wellness_wednesday_for_august_24_2022/ilmxnyb/"
  },
  {
    "kind": "t1",
    "id": "ilme9gr",
    "author": "Gorf__",
    "score": 12,
    "createdUtc": 1661362977,
    "body": "I tested positive for covid yesterday. I'm still kind of doing some work, but mostly just keeping up with absolutely critical stuff, and taking it easy otherwise.\n\nWhen I was a kid and would get to stay home sick from school, I'd always play video games. My mom wouldn't let me stay home unless I was actually pretty sick, but if I did, then I'd usually get to play for a while. Now I have this association with being sick and playing video games.\n\nSo I'm finding myself at home, sick, trying to find a game to play. But, I can't really even manufacture an interest for games anymore. Even after looking through a bunch of reviews, reddit threads, etc. I want to want to play something, but I can't conjure it at all.\n\nIdk, has anyone else noticed a similar decline in interest in gaming over the years? I never thought I'd get old and stop playing games. But, here we are, and I'm only 30. Nowadays I mostly just want to read a book, browse Hacker News, or work on some side programming projects.",
    "permalink": "/r/TheMotte/comments/wwbr8k/wellness_wednesday_for_august_24_2022/ilme9gr/"
  },
  {
    "kind": "t1",
    "id": "ilmasea",
    "author": "LoreSnacks",
    "score": 6,
    "createdUtc": 1661361684,
    "body": "What's the best source for looking up nutritional information (mostly calories) on non-prepared food ingredients? I remember getting good results just from google a few years ago, but now there are a lot of unreliable or irrelevant results.",
    "permalink": "/r/TheMotte/comments/wwbr8k/wellness_wednesday_for_august_24_2022/ilmasea/"
  },
  {
    "kind": "t1",
    "id": "ilm8ko6",
    "author": "gimmickless",
    "score": 10,
    "createdUtc": 1661360854,
    "body": "Good news: my work on the neighborhood newsletter has opened enough doors to start hosting business networking meetings in my neighborhood. I've done one in July &amp; August so far. I charge a small fee for coffee &amp; pastries ($10), and a local nonprofit is shouldering most of the financial load in paying for advertising. (mailing postcards to registered businesses within the ZIP code) Tonight, I'll be working with a local marketer to start scriptwriting for online video content.\n\nResults are mixed. Less than 10 people are showing up right now, but 3 are returning ticket buyers. Also, I've had people on city council show up. An acquaintance also wants to shadow me next month to set up a similar service across the other side of the city.\n\nSo now I've got to figure out how to keep pushing through the growth stage.  Current marketing (I'm told) costs $500/mo, which is not sustainable. The 501c3 has told me I cannot operate as a business if I'm to continue enjoying their support. It is possible to set up as a nonprofit with various designations (501c3, 501c4, 501c6) but I have to educate myself on the pros and cons of each of these. \n\nThe biggest con for now: I am used to making executive decisions by myself, and I don't feel get warm fuzzies about forming a board. I don't trust the talent pool available, given what I know.",
    "permalink": "/r/TheMotte/comments/wwbr8k/wellness_wednesday_for_august_24_2022/ilm8ko6/"
  },
  {
    "kind": "t1",
    "id": "illtpd0",
    "author": "thisismymilitaryalt",
    "score": 9,
    "createdUtc": 1661355250,
    "body": "What are some \"low-hanging fruit\"-type cybersecurity certifications that a non-coder could pick up relatively easily?\n\nI'm don't work in tech but I'm noticing more and more non-tech positions wanting some experience with cybersecurity. I'm looking for something self-paced but still produces a certificate that will at least get me past the HR gatekeepers.\n\nEdit: To clarify, I'm not looking to become a full cybersecurity practitioner, just something to demonstrate to whatever HR gremlin is gatekeeping the first-level screening that I understand the basics of cybersecurity. I'm running across a decent amount of non-tech / non-coder roles outside the cybersecurity field asking for \"demonstrated knowledge of cybersecurity\" without any further clarification.",
    "permalink": "/r/TheMotte/comments/wwbr8k/wellness_wednesday_for_august_24_2022/illtpd0/"
  },
  {
    "kind": "t1",
    "id": "illmva2",
    "author": "lambdatheultraweight",
    "score": 4,
    "createdUtc": 1661352548,
    "body": "I'm interested in trying some nootropics again. I have experience with Modadinil and it was alright, but not life-changing.\n\nI saw Nootropics Depot has a new product: OptiNAD+ to increase NAD+ levels.\nAssuming ND is a good store, is there something to NAD+?\nI'm also interested in Maca extract for energy purposes.\n\nIf anyone has experienced to share specifically about those two or success stories in general I'm very interested. How to safely source these things in Europe would also be good to know. Thanks!",
    "permalink": "/r/TheMotte/comments/wwbr8k/wellness_wednesday_for_august_24_2022/illmva2/"
  },
  {
    "kind": "t1",
    "id": "ill8yl8",
    "author": "DM-me-cool-blogposts",
    "score": 5,
    "createdUtc": 1661346725,
    "body": "Sanity check: Can someone see this? I don't see my comments nor my account when I look at reddit logged out in private tab.",
    "permalink": "/r/TheMotte/comments/wwbr8k/wellness_wednesday_for_august_24_2022/ill8yl8/"
  },
  {
    "kind": "t1",
    "id": "ilkt0k3",
    "author": "pmmecutepones",
    "score": 15,
    "createdUtc": 1661338092,
    "body": "As a short follow-up to my [wisdom teeth removal](https://old.reddit.com/r/TheMotte/comments/vn8roc/wellness_wednesday_for_june_29_2022/ie60a3u/) post: got them removed. Awaiting future pain.\n\nWhile I was there, I overhead a not-really private discussion between the nurses about the [removal of 377A](https://www.bbc.com/news/world-asia-62545577). Some of them defended the decision to protect the definition of marriage (\"the religious feel threatened\"), others decried the move as useless because of it. But overall, none of them were interested in actually defending 377A directly. \n\nI'm reminded of this passage from [_Neutral vs. Conservative_](https://slatestarcodex.com/2017/05/01/neutral-vs-conservative-the-eternal-struggle/)\n\n&gt; In the hospital where I work, there’s a RESIST TRUMP poster on the bulletin board in our break room. I don’t know who put it there, but I know that anybody who demanded that it be taken down would be tarred as a troublemaker, and anyone who tried to put a SUPPORT TRUMP poster up next to it would be lectured about how politics are inappropriate at work. This is true even though I think at least a third of my colleagues are Trump supporters.\n\nWhy do I post this in the Wellness Wednesday thread? Well...\n\nA few months back, I was really bummed out by observations like these. Like the Communist that seethes at perceived edifices to captialism all around him, I could not help but observe the prevailing attitude of mild cultural liberalism around me, and it brought me a significant amount of distress to think about my observations (which is to say, I upset myself daily). \n\nToday, I realise I'm no longer upset by the observations I make, even though I still believe in the baseline conclusion that society is fundamentally biased. Above all else, I no longer despair, I no longer feel blackpilled, and I think this is because I plan to actually **do things** to change the world. An obvious lesson for the depressed among us: Make plans, get organised, and above all else -- try. The work of struggle, whether consequentially productive or not, will make you happier for the moment.",
    "permalink": "/r/TheMotte/comments/wwbr8k/wellness_wednesday_for_august_24_2022/ilkt0k3/"
  }
]
