[
  {
    "kind": "t1",
    "id": "ii0xv4c",
    "author": "thisismymilitaryalt",
    "score": 1,
    "createdUtc": 1659034281,
    "body": "How do those of you in the private sector estimate your salary and value? \n\nI'm job hunting again and a lot of job applications are asking for a salary range. In the military my salary was almost entirely up to the whims of Congress so I never really thought about it that much. I have a pretty precise budget so I know the minimum I can live on, but I'm having trouble figuring out how high to go on top of that. On the one hand, I don't want to price myself out of a job but on the other hand I don't want to lowball myself and get taken for a ride. Suggestions?",
    "permalink": "/r/TheMotte/comments/w9703v/wellness_wednesday_for_july_27_2022/ii0xv4c/"
  },
  {
    "kind": "t1",
    "id": "ihzz0i8",
    "author": "Anouleth",
    "score": 1,
    "createdUtc": 1659020922,
    "body": "Any recommendations for a podcast?",
    "permalink": "/r/TheMotte/comments/w9703v/wellness_wednesday_for_july_27_2022/ihzz0i8/"
  },
  {
    "kind": "t1",
    "id": "ihvm026",
    "author": "Difficult_Ad_3879",
    "score": 14,
    "createdUtc": 1658942966,
    "body": "I’ve been reading some studies on alcohol. I’m pretty sure our culture is drinking incorrectly. Alcohol has a significant *retrograde* enhancement on memory; it especially enhances positive-valence memory and (perhaps) social/language memory, but only post-learning.  I don’t think the mechanism is conclusive but the hypothesis is that it works by reducing memory interference on information presented post-ingestion. There is no benefit to drinking *before* learning on memory acquisition, there is only a benefit *after* learning on memory *consolidation*. Drinking before any learning will negatively influence acquisition and retention. Or so studies suggest.\n\nThis would mean that, if we are to drink, we ought to (1) not pre-game; (2) exposure ourselves to a context where we desire to create preferentially happy memories, (3) drink immediately following the context. If we are drinking to bond socially, we want the bonding to be before the drinking starts. If we are drinking with a book, we may want to start reading before we start drinking. It would also seem that if we have to do some annoying negative thing, alcohol will enable it to be done without much negative effect on mood when it is over.\n\nIt’s surprising to read historical accounts of writers and thinkers drinking so much. It’s likely that culture used to be oriented toward this more beneficial style of drinking. Think: drinking in ode of some emotionally-charged celebration (wedding, then after-party); drinking the wine *in memory* of Christ; etc.",
    "permalink": "/r/TheMotte/comments/w9703v/wellness_wednesday_for_july_27_2022/ihvm026/"
  },
  {
    "kind": "t1",
    "id": "ihvigze",
    "author": "sargon66",
    "score": 5,
    "createdUtc": 1658941635,
    "body": "Sometimes I have trouble falling asleep because I keep ruminating on things that don't much bother me during the day.  Any suggestions for how to stop doing this?",
    "permalink": "/r/TheMotte/comments/w9703v/wellness_wednesday_for_july_27_2022/ihvigze/"
  },
  {
    "kind": "t1",
    "id": "ihvee4s",
    "author": "udfgt",
    "score": 17,
    "createdUtc": 1658940123,
    "body": "A few months ago somebody mentioned the [Stronglifts 5x5 regimen](https://stronglifts.com/5x5/) to get into shape, and I was inspired to join a gym. I've never been a weightlifter, as my exercise has always been cardio of some form primarily (running, swimming, biking). I fell off the horse a little during and immediately after college, and getting married added a lot of things onto my plate that let me gain quite a bit of weight.\n\nSo, after a few months of kicking the can down the road, I finally got a gym membership a month ago and have been going consistently. I was prepared for the effects to take a while and I've been slowly incrementing weight to where I'm pushing 20 lb plates now. I have actually been mildly surprised at how quickly I have been dropping weight and building muscle. My stomach fat has declined somewhat, and my running pace to and from the gym has increased noticably to where I am running, not jogging, and it feels incredible.\n\nI'm still trying to manage my diet, as my and my wife's schedules give us a lot of excuses to take the easy route of not cooking. However, I'm finding better alternatives to what I was eating and drinking and I'm slowly building new eating habits. I don't have a scale to measure myself, but my activity, vitality, and attitude have been sky-high for the last month.\n\nUltimately my crazy goal is to train for a triathlon. I've been gassing up some buddies for years and I finally am in a place where I can consistently work out. I have my sights set on a half ironman, as I trained for and failed to complete one years ago. My goal weight is a bit up in the air, but I want to hit 20%ish body fat before I start training hard again. Ideally, I'm 5'11\" so my guess is around 180-200, but I'm not sure how muscle weight works into that.\n\nI know there are some endurance guys in this community, as well as some fitness-focused people. I'm kind of curious to gauge what the community might think about a collective fitness challenge. Something like a \"complete a tri\" or \"complete a half marathon\" with some sort of meet-up for a race somewhere. Let me know if there is interest in something like that and I can brainstorm some ideas to follow up with. I'm going to aim to do races anyway, but getting some sort of community to aim with is something I haven't really done before, and it would be a cool challenge. Comment and critique is obviously welcome.",
    "permalink": "/r/TheMotte/comments/w9703v/wellness_wednesday_for_july_27_2022/ihvee4s/"
  },
  {
    "kind": "t1",
    "id": "ihvc4ob",
    "author": "reverend_bayes",
    "score": 6,
    "createdUtc": 1658939286,
    "body": "Anyone have a recommendation for an online (remote) personal trainer? I.e., someone who makes a diet and workout routine for you and checks in once a month or so to update it. In particular, I'm looking for one that's very metrics-/goal-oriented, which is why I thought this sub might be a good place to ask.\n\n(I'm a guy looking to gain muscle rather than lose weight. I know that there are free online workout plans I can follow instead that are just as good but spending money to overcome procrastination &amp; motivation issues is a good tradeoff for me here.)",
    "permalink": "/r/TheMotte/comments/w9703v/wellness_wednesday_for_july_27_2022/ihvc4ob/"
  },
  {
    "kind": "t1",
    "id": "ihv798g",
    "author": "bored_at_work_guy",
    "score": 4,
    "createdUtc": 1658937448,
    "body": "Started taking Metformin last week.  So far no issues.\n\nI took a blood test beforehand.  Had good free testosterone levels but high cholesterol.  Will be interesting to see how these change when I get tested again in a couple months.\n\nIn addition to life extension benefits, I'm hoping for a reduction in body fat.  Might not work since I'm already giving myself license to eat more carb heavy meals.",
    "permalink": "/r/TheMotte/comments/w9703v/wellness_wednesday_for_july_27_2022/ihv798g/"
  },
  {
    "kind": "t1",
    "id": "ihui2ep",
    "author": "AdviceThrowaway1901",
    "score": 7,
    "createdUtc": 1658927074,
    "body": "I’ve been smoking 2-3 of these [binoid THCP carts](https://www.binoidcbd.com/collections/thcp-products) a month. They’ve definitely improved my mental health a lot and I’ve even become more productive. Haven’t noticed any adverse health effects. Is there any good reason I should stop?",
    "permalink": "/r/TheMotte/comments/w9703v/wellness_wednesday_for_july_27_2022/ihui2ep/"
  }
]
